{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Practicing making gremlin queries\n",
    "\n",
    "From the [PRACTICAL GREMLIN: An Apache TinkerPop Tutorial](https://www.kelvinlawrence.net/book/PracticalGremlin.html) by **Kelvin R. Lawrence**\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys\n",
    "import numpy as np\n",
    "import pandas as pd\n",
    "import altair as alt\n",
    "sys.path.append('..')\n",
    "import helpers.dbquery as db\n",
    "import helpers.functions as f\n",
    "import yaml, ssl, asyncio\n",
    "import nb_black\n",
    "\n",
    "ssl._create_default_https_context = ssl._create_unverified_context\n",
    "asyncio.set_event_loop_policy(asyncio.WindowsSelectorEventLoopPolicy())\n",
    "import nest_asyncio\n",
    "# this is required for running in a Jupyter Notebook. \n",
    "nest_asyncio.apply()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "# using some static variables\n",
    "popID = '4253777177342'\n",
    "username = 'BillmanLocal2'"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 3.1. Introducing Gremlin\n",
    "https://www.kelvinlawrence.net/book/PracticalGremlin.html#gremlinintro\n",
    "\n",
    "```\n",
    "g.V().hasLabel('airport').groupCount().by('country')\n",
    "g.V().has('code','AUS').out().out().out().has('code','AGR').path().by('code')\n",
    "g.V().has('airport','code','DFW').values()\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>0</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>3794143165810</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6653752176151</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1227517311167</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6519578400148</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6471846259067</th>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0876465147511</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3369222775527</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6613533879046</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9883807940485</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9833564464287</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0573461376016</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9484698246542</th>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4939834578389</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4222061939323</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7220165068620</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3323278109620</th>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3229062775596</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8124662340858</th>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8096582192116</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9285140459817</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4597279352126</th>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "               0\n",
       "3794143165810  3\n",
       "6653752176151  2\n",
       "1227517311167  2\n",
       "6519578400148  3\n",
       "6471846259067  1\n",
       "0876465147511  3\n",
       "3369222775527  3\n",
       "6613533879046  2\n",
       "9883807940485  2\n",
       "9833564464287  3\n",
       "0573461376016  3\n",
       "9484698246542  1\n",
       "4939834578389  3\n",
       "4222061939323  2\n",
       "7220165068620  2\n",
       "3323278109620  4\n",
       "3229062775596  2\n",
       "8124662340858  1\n",
       "8096582192116  3\n",
       "9285140459817  3\n",
       "4597279352126  1"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = db.run_query(f\"g.V().hasLabel('pop').groupCount().by('isInFaction')\")\n",
    "pd.DataFrame(res).T"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>labels</th>\n",
       "      <th>objects</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[[], [], []]</td>\n",
       "      <td>[BillmanLocal2, Kerve, BillmanLocal2]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[[], [], []]</td>\n",
       "      <td>[Gouhillleskin, Kerve, BillmanLocal2]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[[], [], []]</td>\n",
       "      <td>[Gouhillleskin, Garmaiquaranfe, Kerve]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[[], [], []]</td>\n",
       "      <td>[Gouhillleskin, Garmaiquaranfe, Fort]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[[], [], []]</td>\n",
       "      <td>[Conrangu, Kerve, BillmanLocal2]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>95</th>\n",
       "      <td>[[], [], []]</td>\n",
       "      <td>[Renna U, Earth, Fort]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>96</th>\n",
       "      <td>[[], [], []]</td>\n",
       "      <td>[Roysa Ku, Earth, Kerve]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>97</th>\n",
       "      <td>[[], [], []]</td>\n",
       "      <td>[Roysa Ku, Earth, Fort]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>98</th>\n",
       "      <td>[[], [], []]</td>\n",
       "      <td>[Roysa Beam, Earth, Kerve]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99</th>\n",
       "      <td>[[], [], []]</td>\n",
       "      <td>[Roysa Beam, Earth, Fort]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>100 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "          labels                                 objects\n",
       "0   [[], [], []]   [BillmanLocal2, Kerve, BillmanLocal2]\n",
       "1   [[], [], []]   [Gouhillleskin, Kerve, BillmanLocal2]\n",
       "2   [[], [], []]  [Gouhillleskin, Garmaiquaranfe, Kerve]\n",
       "3   [[], [], []]   [Gouhillleskin, Garmaiquaranfe, Fort]\n",
       "4   [[], [], []]        [Conrangu, Kerve, BillmanLocal2]\n",
       "..           ...                                     ...\n",
       "95  [[], [], []]                  [Renna U, Earth, Fort]\n",
       "96  [[], [], []]                [Roysa Ku, Earth, Kerve]\n",
       "97  [[], [], []]                 [Roysa Ku, Earth, Fort]\n",
       "98  [[], [], []]              [Roysa Beam, Earth, Kerve]\n",
       "99  [[], [], []]               [Roysa Beam, Earth, Fort]\n",
       "\n",
       "[100 rows x 2 columns]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = db.run_query(f\"g.V().has('username','{username}').out().out().path().by('name')\")\n",
    "pd.DataFrame(res)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Geibryan', '3794143165810', 1, 'billmanhlaptop', 'faction']"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = db.run_query(f\"g.V().has('faction','name','Geibryan').values()\")\n",
    "res\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['billmanhlaptop']"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = db.run_query(f\"g.V().has('faction','name','Geibryan').values('username')\")\n",
    "res\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'id': 'd31c5d26-6e6c-4f5c-bad2-2604e48e0f1d',\n",
       "  'label': 'planet',\n",
       "  'type': 'vertex',\n",
       "  'properties': {'pl_name': [{'id': '7a73567c-697c-4866-8076-6d80698aebba',\n",
       "     'value': 'PSR B1257+12 c'}],\n",
       "   'pl_name.1': [{'id': '8fae4d0f-38c8-4980-8fb4-9291dc60a820',\n",
       "     'value': 'PSR B1257+12 c'}],\n",
       "   'hostname': [{'id': 'a31e998d-28cc-4448-a437-5e76decf9c32',\n",
       "     'value': 'PSR B1257+12'}],\n",
       "   'pl_letter': [{'id': '0b94f6c4-cf25-4f39-8e1a-0f4dbd67f589', 'value': 'c'}],\n",
       "   'default_flag': [{'id': '9830a6d9-a3ec-4b96-a7ea-b03c48cb4754',\n",
       "     'value': '0'}],\n",
       "   'sy_snum': [{'id': '2d758c1e-c185-47ed-816f-1f8e6194399e', 'value': '1'}],\n",
       "   'sy_pnum': [{'id': 'd396eb59-1b36-4334-8e10-8d1ab3ef2657', 'value': '3'}],\n",
       "   'sy_mnum': [{'id': 'e157a267-bae3-4d14-9756-9817455f1859', 'value': '0'}],\n",
       "   'cb_flag': [{'id': '1d6b3a11-2d3a-4e54-b0df-3bc3027106c8', 'value': '0'}],\n",
       "   'discoverymethod': [{'id': 'fe66dfb3-1899-4e35-9cca-215a3f5bc2e8',\n",
       "     'value': 'Pulsar Timing'}],\n",
       "   'disc_year': [{'id': '07497472-4273-4edd-9228-4921ffaf18bb',\n",
       "     'value': '1992'}],\n",
       "   'disc_locale': [{'id': '673570db-b748-447e-ace7-3e64c0e7fc7c',\n",
       "     'value': 'Ground'}],\n",
       "   'disc_facility': [{'id': '64f9b542-99f6-4ede-ab28-adcc2faf085f',\n",
       "     'value': 'Arecibo Observatory'}],\n",
       "   'soltype': [{'id': 'ccc4d064-845b-4787-9565-69a57cdb9d82',\n",
       "     'value': 'Published Confirmed'}],\n",
       "   'pl_controv_flag': [{'id': '59e73027-3183-4163-9e46-2620aa70663f',\n",
       "     'value': '0'}],\n",
       "   'pl_refname': [{'id': '5773613e-4323-4e3e-902f-dd489de18e01',\n",
       "     'value': '<a refstr=WOLSZCZAN_ET_AL__1992 href=https://ui.adsabs.harvard.edu/abs/1992Natur.355..145W/abstract target=ref> Wolszczan et al. 1992 </a>'}],\n",
       "   'pl_orbper': [{'id': 'cef88e04-f0ce-45eb-8a97-85f07f51adb7',\n",
       "     'value': '66.563'}],\n",
       "   'pl_orbpererr1': [{'id': 'ebbf3a21-e85c-4b71-8c33-19c097a3bcc5',\n",
       "     'value': '0.009'}],\n",
       "   'pl_orbpererr2': [{'id': 'dbb9ee70-87f7-4b92-9baf-c60d166f30f9',\n",
       "     'value': '-0.009'}],\n",
       "   'pl_orbperlim': [{'id': '4bdd8f92-e515-4bd2-a400-8503d3b3ee30',\n",
       "     'value': '0.0'}],\n",
       "   'pl_orbsmax': [{'id': '4a6b8c00-3043-45bb-93cc-e6f38e106177',\n",
       "     'value': '0.36'}],\n",
       "   'pl_orbsmaxlim': [{'id': '0b2daa6b-deef-4462-bbdb-e09e7528402e',\n",
       "     'value': '0.0'}],\n",
       "   'pl_orbeccen': [{'id': 'b3996351-0c8f-4bb3-a515-262dad3e600a',\n",
       "     'value': '0.022'}],\n",
       "   'pl_orbeccenerr1': [{'id': '2a234132-ccfb-464b-8c4b-9a8e61cebc37',\n",
       "     'value': '0.007'}],\n",
       "   'pl_orbeccenerr2': [{'id': 'ffb31d21-19f2-4787-85d9-7a410271ff36',\n",
       "     'value': '-0.007'}],\n",
       "   'pl_orbeccenlim': [{'id': 'bea59f2f-a4bd-4843-a8be-5ed6ac2786c3',\n",
       "     'value': '0.0'}],\n",
       "   'ttv_flag': [{'id': '4286da02-6525-42d3-9dee-eb3ae1bf3d37', 'value': '0'}],\n",
       "   'pl_orbtper': [{'id': '5f5f1cd8-4c35-4c18-9434-5e673ef0b659',\n",
       "     'value': '2448105.3'}],\n",
       "   'pl_orbtpererr1': [{'id': 'fc447f2f-3d05-4c53-8330-4e492869f403',\n",
       "     'value': '1.0'}],\n",
       "   'pl_orbtpererr2': [{'id': '0973088d-3633-4bd4-b41c-e0397590fd00',\n",
       "     'value': '-1.0'}],\n",
       "   'pl_orbtperlim': [{'id': '0ce474bd-c2de-4322-97f9-207c6a49b1de',\n",
       "     'value': '0.0'}],\n",
       "   'st_refname': [{'id': '72d6ef8d-2b62-45c9-8a5d-9d648dcb9078',\n",
       "     'value': '<a refstr=WOLSZCZAN_ET_AL__1992 href=https://ui.adsabs.harvard.edu/abs/1992Natur.355..145W/abstract target=ref> Wolszczan et al. 1992 </a>'}],\n",
       "   'st_age': [{'id': '45f4f727-5378-4e0b-a0f9-644107c5e727', 'value': '0.8'}],\n",
       "   'st_agelim': [{'id': '0f92109b-0fa9-4567-bb64-a4046ab89efc',\n",
       "     'value': '0.0'}],\n",
       "   'sy_refname': [{'id': '6306c900-0f0b-4f72-8f60-8518c6815efe',\n",
       "     'value': '<a refstr=KONACKI_AND_WOLSZCZAN_2003 href=https://ui.adsabs.harvard.edu/abs/2003ApJ...591L.147K/abstract target=ref> Konacki and Wolszczan 2003 </a>'}],\n",
       "   'rastr': [{'id': '97518be0-acbd-4d27-964b-e49aaaffe3f9',\n",
       "     'value': '13h00m03.58s'}],\n",
       "   'ra': [{'id': 'cf5584db-b7f3-4a7a-bf0b-eaf715c2228c',\n",
       "     'value': '195.0149029'}],\n",
       "   'decstr': [{'id': 'b2d38ef3-e612-4175-aca5-d138da63cb6b',\n",
       "     'value': '+12d40m56.5s'}],\n",
       "   'dec': [{'id': '14b96b57-a206-4c75-86f7-94f14fd95deb',\n",
       "     'value': '12.6823534'}],\n",
       "   'glat': [{'id': 'f6de684a-cee0-4144-a85e-d5e990427025',\n",
       "     'value': '75.413648'}],\n",
       "   'glon': [{'id': 'f769bc2a-7a05-43e1-aaff-0fa7828d58b2',\n",
       "     'value': '311.30969'}],\n",
       "   'elat': [{'id': '686fd223-d846-4f5a-ab09-8e8881894ec0',\n",
       "     'value': '17.575802'}],\n",
       "   'elon': [{'id': '64fc7f0e-df81-403d-8704-64c2685e67e7',\n",
       "     'value': '188.722087'}],\n",
       "   'sy_dist': [{'id': '28a9609c-ce26-4a20-a046-0cf3ec4b8040',\n",
       "     'value': '600.0'}],\n",
       "   'sy_disterr1': [{'id': 'a0b93e89-1468-4f3b-8408-8d65c55fefd8',\n",
       "     'value': '100.0'}],\n",
       "   'sy_disterr2': [{'id': '5bd298c9-f4b0-40ba-ad2a-6f4988a02479',\n",
       "     'value': '-100.0'}],\n",
       "   'rowupdate': [{'id': '109aca6c-921e-4ab9-96fe-0184133ae6f0',\n",
       "     'value': '2015-04-30'}],\n",
       "   'pl_pubdate': [{'id': '43868716-83a8-439a-a5aa-be271e04ea2a',\n",
       "     'value': '1992-01'}],\n",
       "   'releasedate': [{'id': 'd024ebec-cf0b-4dbb-93fb-e03fba113b88',\n",
       "     'value': '2015-04-30'}],\n",
       "   'objid': [{'id': 'd31c5d26-6e6c-4f5c-bad2-2604e48e0f1d|objid',\n",
       "     'value': '51196769'}]}}]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = db.run_query(f\"g.V().hasNot('username').limit(1)\")\n",
    "res"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "res = db.run_query(f\"g.V().hasNot('username').limit(1)\")\n",
    "res"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.7.0 ('exoplanets')",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.0"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "625a17269cb94aebb094cbcf5e0e8340f26b69d46569da60e8fc69439048adbf"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
