{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Practicing making gremlin queries\n",
    "\n",
    "From the [PRACTICAL GREMLIN: An Apache TinkerPop Tutorial](https://www.kelvinlawrence.net/book/PracticalGremlin.html) by **Kelvin R. Lawrence**\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys\n",
    "import numpy as np\n",
    "import pandas as pd\n",
    "import altair as alt\n",
    "sys.path.append('..')\n",
    "import helpers.dbquery as db\n",
    "import helpers.functions as f\n",
    "import yaml, ssl, asyncio\n",
    "import nb_black\n",
    "\n",
    "ssl._create_default_https_context = ssl._create_unverified_context\n",
    "asyncio.set_event_loop_policy(asyncio.WindowsSelectorEventLoopPolicy())\n",
    "import nest_asyncio\n",
    "# this is required for running in a Jupyter Notebook. \n",
    "nest_asyncio.apply()\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "# using some static variables\n",
    "popID = '4253777177342'\n",
    "username = 'BillmanLocal2'"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 3.1. Introducing Gremlin\n",
    "https://www.kelvinlawrence.net/book/PracticalGremlin.html#gremlinintro\n",
    "\n",
    "```\n",
    "g.V().hasLabel('airport').groupCount().by('country')\n",
    "g.V().has('code','AUS').out().out().out().has('code','AGR').path().by('code')\n",
    "g.V().has('airport','code','DFW').values()\n",
    "```"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>0</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>3794143165810</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6653752176151</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1227517311167</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6519578400148</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6471846259067</th>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0876465147511</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3369222775527</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6613533879046</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9883807940485</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9833564464287</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>0573461376016</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9484698246542</th>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4939834578389</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4222061939323</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7220165068620</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3323278109620</th>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3229062775596</th>\n",
       "      <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8124662340858</th>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8096582192116</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9285140459817</th>\n",
       "      <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4597279352126</th>\n",
       "      <td>1</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "               0\n",
       "3794143165810  3\n",
       "6653752176151  2\n",
       "1227517311167  2\n",
       "6519578400148  3\n",
       "6471846259067  1\n",
       "0876465147511  3\n",
       "3369222775527  3\n",
       "6613533879046  2\n",
       "9883807940485  2\n",
       "9833564464287  3\n",
       "0573461376016  3\n",
       "9484698246542  1\n",
       "4939834578389  3\n",
       "4222061939323  2\n",
       "7220165068620  2\n",
       "3323278109620  4\n",
       "3229062775596  2\n",
       "8124662340858  1\n",
       "8096582192116  3\n",
       "9285140459817  3\n",
       "4597279352126  1"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = db.run_query(f\"g.V().hasLabel('pop').groupCount().by('isInFaction')\")\n",
    "pd.DataFrame(res).T"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>labels</th>\n",
       "      <th>objects</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[[], [], []]</td>\n",
       "      <td>[BillmanLocal2, Kerve, BillmanLocal2]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[[], [], []]</td>\n",
       "      <td>[Gouhillleskin, Kerve, BillmanLocal2]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[[], [], []]</td>\n",
       "      <td>[Gouhillleskin, Garmaiquaranfe, Kerve]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[[], [], []]</td>\n",
       "      <td>[Gouhillleskin, Garmaiquaranfe, Fort]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[[], [], []]</td>\n",
       "      <td>[Conrangu, Kerve, BillmanLocal2]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>95</th>\n",
       "      <td>[[], [], []]</td>\n",
       "      <td>[Renna U, Earth, Fort]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>96</th>\n",
       "      <td>[[], [], []]</td>\n",
       "      <td>[Roysa Ku, Earth, Kerve]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>97</th>\n",
       "      <td>[[], [], []]</td>\n",
       "      <td>[Roysa Ku, Earth, Fort]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>98</th>\n",
       "      <td>[[], [], []]</td>\n",
       "      <td>[Roysa Beam, Earth, Kerve]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>99</th>\n",
       "      <td>[[], [], []]</td>\n",
       "      <td>[Roysa Beam, Earth, Fort]</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>100 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "          labels                                 objects\n",
       "0   [[], [], []]   [BillmanLocal2, Kerve, BillmanLocal2]\n",
       "1   [[], [], []]   [Gouhillleskin, Kerve, BillmanLocal2]\n",
       "2   [[], [], []]  [Gouhillleskin, Garmaiquaranfe, Kerve]\n",
       "3   [[], [], []]   [Gouhillleskin, Garmaiquaranfe, Fort]\n",
       "4   [[], [], []]        [Conrangu, Kerve, BillmanLocal2]\n",
       "..           ...                                     ...\n",
       "95  [[], [], []]                  [Renna U, Earth, Fort]\n",
       "96  [[], [], []]                [Roysa Ku, Earth, Kerve]\n",
       "97  [[], [], []]                 [Roysa Ku, Earth, Fort]\n",
       "98  [[], [], []]              [Roysa Beam, Earth, Kerve]\n",
       "99  [[], [], []]               [Roysa Beam, Earth, Fort]\n",
       "\n",
       "[100 rows x 2 columns]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = db.run_query(f\"g.V().has('username','{username}').out().out().path().by('name')\")\n",
    "pd.DataFrame(res)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Geibryan', '3794143165810', 1, 'billmanhlaptop', 'faction']"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = db.run_query(f\"g.V().has('faction','name','Geibryan').values()\")\n",
    "res\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['billmanhlaptop']"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = db.run_query(f\"g.V().has('faction','name','Geibryan').values('username')\")\n",
    "res\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'id': 'd31c5d26-6e6c-4f5c-bad2-2604e48e0f1d',\n",
       "  'label': 'planet',\n",
       "  'type': 'vertex',\n",
       "  'properties': {'pl_name': [{'id': '7a73567c-697c-4866-8076-6d80698aebba',\n",
       "     'value': 'PSR B1257+12 c'}],\n",
       "   'pl_name.1': [{'id': '8fae4d0f-38c8-4980-8fb4-9291dc60a820',\n",
       "     'value': 'PSR B1257+12 c'}],\n",
       "   'hostname': [{'id': 'a31e998d-28cc-4448-a437-5e76decf9c32',\n",
       "     'value': 'PSR B1257+12'}],\n",
       "   'pl_letter': [{'id': '0b94f6c4-cf25-4f39-8e1a-0f4dbd67f589', 'value': 'c'}],\n",
       "   'default_flag': [{'id': '9830a6d9-a3ec-4b96-a7ea-b03c48cb4754',\n",
       "     'value': '0'}],\n",
       "   'sy_snum': [{'id': '2d758c1e-c185-47ed-816f-1f8e6194399e', 'value': '1'}],\n",
       "   'sy_pnum': [{'id': 'd396eb59-1b36-4334-8e10-8d1ab3ef2657', 'value': '3'}],\n",
       "   'sy_mnum': [{'id': 'e157a267-bae3-4d14-9756-9817455f1859', 'value': '0'}],\n",
       "   'cb_flag': [{'id': '1d6b3a11-2d3a-4e54-b0df-3bc3027106c8', 'value': '0'}],\n",
       "   'discoverymethod': [{'id': 'fe66dfb3-1899-4e35-9cca-215a3f5bc2e8',\n",
       "     'value': 'Pulsar Timing'}],\n",
       "   'disc_year': [{'id': '07497472-4273-4edd-9228-4921ffaf18bb',\n",
       "     'value': '1992'}],\n",
       "   'disc_locale': [{'id': '673570db-b748-447e-ace7-3e64c0e7fc7c',\n",
       "     'value': 'Ground'}],\n",
       "   'disc_facility': [{'id': '64f9b542-99f6-4ede-ab28-adcc2faf085f',\n",
       "     'value': 'Arecibo Observatory'}],\n",
       "   'soltype': [{'id': 'ccc4d064-845b-4787-9565-69a57cdb9d82',\n",
       "     'value': 'Published Confirmed'}],\n",
       "   'pl_controv_flag': [{'id': '59e73027-3183-4163-9e46-2620aa70663f',\n",
       "     'value': '0'}],\n",
       "   'pl_refname': [{'id': '5773613e-4323-4e3e-902f-dd489de18e01',\n",
       "     'value': '<a refstr=WOLSZCZAN_ET_AL__1992 href=https://ui.adsabs.harvard.edu/abs/1992Natur.355..145W/abstract target=ref> Wolszczan et al. 1992 </a>'}],\n",
       "   'pl_orbper': [{'id': 'cef88e04-f0ce-45eb-8a97-85f07f51adb7',\n",
       "     'value': '66.563'}],\n",
       "   'pl_orbpererr1': [{'id': 'ebbf3a21-e85c-4b71-8c33-19c097a3bcc5',\n",
       "     'value': '0.009'}],\n",
       "   'pl_orbpererr2': [{'id': 'dbb9ee70-87f7-4b92-9baf-c60d166f30f9',\n",
       "     'value': '-0.009'}],\n",
       "   'pl_orbperlim': [{'id': '4bdd8f92-e515-4bd2-a400-8503d3b3ee30',\n",
       "     'value': '0.0'}],\n",
       "   'pl_orbsmax': [{'id': '4a6b8c00-3043-45bb-93cc-e6f38e106177',\n",
       "     'value': '0.36'}],\n",
       "   'pl_orbsmaxlim': [{'id': '0b2daa6b-deef-4462-bbdb-e09e7528402e',\n",
       "     'value': '0.0'}],\n",
       "   'pl_orbeccen': [{'id': 'b3996351-0c8f-4bb3-a515-262dad3e600a',\n",
       "     'value': '0.022'}],\n",
       "   'pl_orbeccenerr1': [{'id': '2a234132-ccfb-464b-8c4b-9a8e61cebc37',\n",
       "     'value': '0.007'}],\n",
       "   'pl_orbeccenerr2': [{'id': 'ffb31d21-19f2-4787-85d9-7a410271ff36',\n",
       "     'value': '-0.007'}],\n",
       "   'pl_orbeccenlim': [{'id': 'bea59f2f-a4bd-4843-a8be-5ed6ac2786c3',\n",
       "     'value': '0.0'}],\n",
       "   'ttv_flag': [{'id': '4286da02-6525-42d3-9dee-eb3ae1bf3d37', 'value': '0'}],\n",
       "   'pl_orbtper': [{'id': '5f5f1cd8-4c35-4c18-9434-5e673ef0b659',\n",
       "     'value': '2448105.3'}],\n",
       "   'pl_orbtpererr1': [{'id': 'fc447f2f-3d05-4c53-8330-4e492869f403',\n",
       "     'value': '1.0'}],\n",
       "   'pl_orbtpererr2': [{'id': '0973088d-3633-4bd4-b41c-e0397590fd00',\n",
       "     'value': '-1.0'}],\n",
       "   'pl_orbtperlim': [{'id': '0ce474bd-c2de-4322-97f9-207c6a49b1de',\n",
       "     'value': '0.0'}],\n",
       "   'st_refname': [{'id': '72d6ef8d-2b62-45c9-8a5d-9d648dcb9078',\n",
       "     'value': '<a refstr=WOLSZCZAN_ET_AL__1992 href=https://ui.adsabs.harvard.edu/abs/1992Natur.355..145W/abstract target=ref> Wolszczan et al. 1992 </a>'}],\n",
       "   'st_age': [{'id': '45f4f727-5378-4e0b-a0f9-644107c5e727', 'value': '0.8'}],\n",
       "   'st_agelim': [{'id': '0f92109b-0fa9-4567-bb64-a4046ab89efc',\n",
       "     'value': '0.0'}],\n",
       "   'sy_refname': [{'id': '6306c900-0f0b-4f72-8f60-8518c6815efe',\n",
       "     'value': '<a refstr=KONACKI_AND_WOLSZCZAN_2003 href=https://ui.adsabs.harvard.edu/abs/2003ApJ...591L.147K/abstract target=ref> Konacki and Wolszczan 2003 </a>'}],\n",
       "   'rastr': [{'id': '97518be0-acbd-4d27-964b-e49aaaffe3f9',\n",
       "     'value': '13h00m03.58s'}],\n",
       "   'ra': [{'id': 'cf5584db-b7f3-4a7a-bf0b-eaf715c2228c',\n",
       "     'value': '195.0149029'}],\n",
       "   'decstr': [{'id': 'b2d38ef3-e612-4175-aca5-d138da63cb6b',\n",
       "     'value': '+12d40m56.5s'}],\n",
       "   'dec': [{'id': '14b96b57-a206-4c75-86f7-94f14fd95deb',\n",
       "     'value': '12.6823534'}],\n",
       "   'glat': [{'id': 'f6de684a-cee0-4144-a85e-d5e990427025',\n",
       "     'value': '75.413648'}],\n",
       "   'glon': [{'id': 'f769bc2a-7a05-43e1-aaff-0fa7828d58b2',\n",
       "     'value': '311.30969'}],\n",
       "   'elat': [{'id': '686fd223-d846-4f5a-ab09-8e8881894ec0',\n",
       "     'value': '17.575802'}],\n",
       "   'elon': [{'id': '64fc7f0e-df81-403d-8704-64c2685e67e7',\n",
       "     'value': '188.722087'}],\n",
       "   'sy_dist': [{'id': '28a9609c-ce26-4a20-a046-0cf3ec4b8040',\n",
       "     'value': '600.0'}],\n",
       "   'sy_disterr1': [{'id': 'a0b93e89-1468-4f3b-8408-8d65c55fefd8',\n",
       "     'value': '100.0'}],\n",
       "   'sy_disterr2': [{'id': '5bd298c9-f4b0-40ba-ad2a-6f4988a02479',\n",
       "     'value': '-100.0'}],\n",
       "   'rowupdate': [{'id': '109aca6c-921e-4ab9-96fe-0184133ae6f0',\n",
       "     'value': '2015-04-30'}],\n",
       "   'pl_pubdate': [{'id': '43868716-83a8-439a-a5aa-be271e04ea2a',\n",
       "     'value': '1992-01'}],\n",
       "   'releasedate': [{'id': 'd024ebec-cf0b-4dbb-93fb-e03fba113b88',\n",
       "     'value': '2015-04-30'}],\n",
       "   'objid': [{'id': 'd31c5d26-6e6c-4f5c-bad2-2604e48e0f1d|objid',\n",
       "     'value': '51196769'}]}}]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = db.run_query(f\"g.V().hasNot('username').limit(1)\")\n",
    "res"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 3.2.3. Counting things"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[9]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = db.run_query(f\"g.V().hasLabel('account').count()\")\n",
    "res"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[661]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = db.run_query(f\"g.V().hasLabel('pop').outE('desires').count()\")\n",
    "res"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### 3.2.4. Counting groups of things"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'planet': 4421,\n",
       "  'system': 3248,\n",
       "  'example': 4,\n",
       "  'objective': 5,\n",
       "  'account': 9,\n",
       "  'star': 9,\n",
       "  'moon': 216,\n",
       "  'species': 7,\n",
       "  'pop': 49,\n",
       "  'faction': 21,\n",
       "  'form': 6,\n",
       "  'time': 1,\n",
       "  'action': 8}]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = db.run_query(f\"g.V().groupCount().by(label)\")\n",
    "res"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'isInSystem': 9022,\n",
       "  'isExample': 1,\n",
       "  'orbits': 270,\n",
       "  'belongsToUser': 9,\n",
       "  'isInFaction': 46,\n",
       "  'isOfSpecies': 49,\n",
       "  'enhabits': 45,\n",
       "  'desires': 661,\n",
       "  'requestedSystem': 4}]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = db.run_query(f\"g.E().groupCount().by(label)\")\n",
    "res"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'billmanhlaptop': 7,\n",
       "  'billmanh4': 7,\n",
       "  'BillmanLocal': 7,\n",
       "  'william.jeffrey.harding@gmail.com': 7,\n",
       "  'explorer': 7,\n",
       "  'BillmanLocal2': 7,\n",
       "  'Billmanserver': 7}]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = db.run_query(f\"g.V().hasLabel('pop').groupCount().by('username')\")\n",
    "res"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'class': ['gas'],\n",
       "  'name': ['Garmaiquaranfe'],\n",
       "  'objid': ['2622750356280'],\n",
       "  'mass': [125.4727],\n",
       "  'radius': [9.8151],\n",
       "  'orbitsDistance': [19],\n",
       "  'orbitsId': ['4845567259981'],\n",
       "  'orbitsName': ['Fort'],\n",
       "  'isSupportsLife': ['False'],\n",
       "  'isPopulated': ['False'],\n",
       "  'username': ['BillmanLocal2'],\n",
       "  'objtype': ['planet']}]"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = db.run_query(f\"g.V().hasLabel('planet').has('username','BillmanLocal2').limit(1).valuemap()\")\n",
    "res"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [
    {
     "ename": "GremlinServerError",
     "evalue": "500: \r\n\nActivityId : de1584e1-f549-4834-bd47-ad9d1f1f80ff\nExceptionType : ArgumentException\nExceptionMessage : An unknown error occurred while processing this request. If the issue persists, please contact Azure Support: http://aka.ms/azure-support\n\tHResult : 0x80070057\r\n",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mGremlinServerError\u001b[0m                        Traceback (most recent call last)",
      "\u001b[1;32m<ipython-input-30-4d8e48f9d5ad>\u001b[0m in \u001b[0;36m<module>\u001b[1;34m\u001b[0m\n\u001b[1;32m----> 1\u001b[1;33m \u001b[0mres\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mdb\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mrun_query\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;34mf\"g.V().hasLabel('pop').groupCount().by('username').select('billmanh4','billmanh4')\"\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m      2\u001b[0m \u001b[0mres\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32mc:\\Users\\william.harding\\Documents\\repos\\exoplanets\\notebooks\\helpers\\dbquery.py\u001b[0m in \u001b[0;36mrun_query\u001b[1;34m(query)\u001b[0m\n\u001b[0;32m     34\u001b[0m     \u001b[0mc\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mget_client\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m     35\u001b[0m     \u001b[0mcallback\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mc\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0msubmitAsync\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mquery\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m---> 36\u001b[1;33m     \u001b[0mres\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mcallback\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mresult\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mall\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mresult\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m     37\u001b[0m     \u001b[0mc\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mclose\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m     38\u001b[0m     \u001b[1;32mreturn\u001b[0m \u001b[0mres\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32mc:\\Users\\william.harding\\anaconda3\\envs\\exoplanets\\lib\\concurrent\\futures\\_base.py\u001b[0m in \u001b[0;36mresult\u001b[1;34m(self, timeout)\u001b[0m\n\u001b[0;32m    430\u001b[0m                 \u001b[1;32mraise\u001b[0m \u001b[0mCancelledError\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    431\u001b[0m             \u001b[1;32melif\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_state\u001b[0m \u001b[1;33m==\u001b[0m \u001b[0mFINISHED\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 432\u001b[1;33m                 \u001b[1;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m__get_result\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    433\u001b[0m             \u001b[1;32melse\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    434\u001b[0m                 \u001b[1;32mraise\u001b[0m \u001b[0mTimeoutError\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32mc:\\Users\\william.harding\\anaconda3\\envs\\exoplanets\\lib\\concurrent\\futures\\_base.py\u001b[0m in \u001b[0;36m__get_result\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    382\u001b[0m     \u001b[1;32mdef\u001b[0m \u001b[0m__get_result\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mself\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    383\u001b[0m         \u001b[1;32mif\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_exception\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 384\u001b[1;33m             \u001b[1;32mraise\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_exception\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    385\u001b[0m         \u001b[1;32melse\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    386\u001b[0m             \u001b[1;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_result\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32mc:\\Users\\william.harding\\anaconda3\\envs\\exoplanets\\lib\\site-packages\\gremlin_python\\driver\\resultset.py\u001b[0m in \u001b[0;36mcb\u001b[1;34m(f)\u001b[0m\n\u001b[0;32m     88\u001b[0m         \u001b[1;32mdef\u001b[0m \u001b[0mcb\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mf\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m     89\u001b[0m             \u001b[1;32mtry\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m---> 90\u001b[1;33m                 \u001b[0mf\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mresult\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m     91\u001b[0m             \u001b[1;32mexcept\u001b[0m \u001b[0mException\u001b[0m \u001b[1;32mas\u001b[0m \u001b[0me\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m     92\u001b[0m                 \u001b[0mfuture\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mset_exception\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0me\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32mc:\\Users\\william.harding\\anaconda3\\envs\\exoplanets\\lib\\concurrent\\futures\\_base.py\u001b[0m in \u001b[0;36mresult\u001b[1;34m(self, timeout)\u001b[0m\n\u001b[0;32m    423\u001b[0m                 \u001b[1;32mraise\u001b[0m \u001b[0mCancelledError\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    424\u001b[0m             \u001b[1;32melif\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_state\u001b[0m \u001b[1;33m==\u001b[0m \u001b[0mFINISHED\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 425\u001b[1;33m                 \u001b[1;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m__get_result\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    426\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    427\u001b[0m             \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_condition\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mwait\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mtimeout\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32mc:\\Users\\william.harding\\anaconda3\\envs\\exoplanets\\lib\\concurrent\\futures\\_base.py\u001b[0m in \u001b[0;36m__get_result\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m    382\u001b[0m     \u001b[1;32mdef\u001b[0m \u001b[0m__get_result\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mself\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    383\u001b[0m         \u001b[1;32mif\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_exception\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 384\u001b[1;33m             \u001b[1;32mraise\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_exception\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    385\u001b[0m         \u001b[1;32melse\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    386\u001b[0m             \u001b[1;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_result\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32mc:\\Users\\william.harding\\anaconda3\\envs\\exoplanets\\lib\\concurrent\\futures\\thread.py\u001b[0m in \u001b[0;36mrun\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m     55\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m     56\u001b[0m         \u001b[1;32mtry\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m---> 57\u001b[1;33m             \u001b[0mresult\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mfn\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m*\u001b[0m\u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0margs\u001b[0m\u001b[1;33m,\u001b[0m \u001b[1;33m**\u001b[0m\u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mkwargs\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m     58\u001b[0m         \u001b[1;32mexcept\u001b[0m \u001b[0mBaseException\u001b[0m \u001b[1;32mas\u001b[0m \u001b[0mexc\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m     59\u001b[0m             \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mfuture\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mset_exception\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mexc\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32mc:\\Users\\william.harding\\anaconda3\\envs\\exoplanets\\lib\\site-packages\\gremlin_python\\driver\\connection.py\u001b[0m in \u001b[0;36m_receive\u001b[1;34m(self)\u001b[0m\n\u001b[0;32m     81\u001b[0m             \u001b[1;32mwhile\u001b[0m \u001b[1;32mTrue\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m     82\u001b[0m                 \u001b[0mdata\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_transport\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mread\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m---> 83\u001b[1;33m                 \u001b[0mstatus_code\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_protocol\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mdata_received\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mdata\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_results\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m     84\u001b[0m                 \u001b[1;32mif\u001b[0m \u001b[0mstatus_code\u001b[0m \u001b[1;33m!=\u001b[0m \u001b[1;36m206\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m     85\u001b[0m                     \u001b[1;32mbreak\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32mc:\\Users\\william.harding\\anaconda3\\envs\\exoplanets\\lib\\site-packages\\gremlin_python\\driver\\protocol.py\u001b[0m in \u001b[0;36mdata_received\u001b[1;34m(self, message, results_dict)\u001b[0m\n\u001b[0;32m    116\u001b[0m             \u001b[0mdata\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0m_transport\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mread\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    117\u001b[0m             \u001b[1;31m# Allow for auth handshake with multiple steps\u001b[0m\u001b[1;33m\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 118\u001b[1;33m             \u001b[1;32mreturn\u001b[0m \u001b[0mself\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mdata_received\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mdata\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mresults_dict\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    119\u001b[0m         \u001b[1;32melif\u001b[0m \u001b[0mstatus_code\u001b[0m \u001b[1;33m==\u001b[0m \u001b[1;36m204\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    120\u001b[0m             \u001b[0mresult_set\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mstream\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mput_nowait\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m[\u001b[0m\u001b[1;33m]\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32mc:\\Users\\william.harding\\anaconda3\\envs\\exoplanets\\lib\\site-packages\\gremlin_python\\driver\\protocol.py\u001b[0m in \u001b[0;36mdata_received\u001b[1;34m(self, message, results_dict)\u001b[0m\n\u001b[0;32m    129\u001b[0m         \u001b[1;32melse\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    130\u001b[0m             \u001b[1;32mdel\u001b[0m \u001b[0mresults_dict\u001b[0m\u001b[1;33m[\u001b[0m\u001b[0mrequest_id\u001b[0m\u001b[1;33m]\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m--> 131\u001b[1;33m             \u001b[1;32mraise\u001b[0m \u001b[0mGremlinServerError\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mmessage\u001b[0m\u001b[1;33m[\u001b[0m\u001b[1;34m'status'\u001b[0m\u001b[1;33m]\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m    132\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m    133\u001b[0m     \u001b[1;32mdef\u001b[0m \u001b[0m_kerberos_received\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mself\u001b[0m\u001b[1;33m,\u001b[0m \u001b[0mmessage\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;31mGremlinServerError\u001b[0m: 500: \r\n\nActivityId : de1584e1-f549-4834-bd47-ad9d1f1f80ff\nExceptionType : ArgumentException\nExceptionMessage : An unknown error occurred while processing this request. If the issue persists, please contact Azure Support: http://aka.ms/azure-support\n\tHResult : 0x80070057\r\n"
     ]
    }
   ],
   "source": [
    "res = db.run_query(f\"g.V().hasLabel('pop').groupCount().by('username').select('billmanh4','billmanh4')\")\n",
    "res"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 3.3. Starting to walk the graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['system',\n",
       " 'Tsiywiykher',\n",
       " 'star',\n",
       " '',\n",
       " 'system',\n",
       " '',\n",
       " 'star',\n",
       " 'Zathoubruns',\n",
       " 'system',\n",
       " 'Consknell',\n",
       " 'star',\n",
       " 'Tees',\n",
       " 'system',\n",
       " 'Skikdzhahakqi',\n",
       " 'star',\n",
       " 'Roohaqchuns',\n",
       " 'system',\n",
       " 'Tiancnoanbhart',\n",
       " 'star',\n",
       " 'Bud',\n",
       " 'system',\n",
       " 'Svitra',\n",
       " 'star',\n",
       " 'Jelczgyisaur',\n",
       " 'system',\n",
       " 'Roysal',\n",
       " 'star',\n",
       " 'Sau',\n",
       " 'system',\n",
       " 'Kerve',\n",
       " 'star',\n",
       " 'Fort',\n",
       " 'system',\n",
       " 'Milweconwo',\n",
       " 'star',\n",
       " 'Hay']"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "res = db.run_query(f\"g.V().has('planet','isSupportsLife','True').out().values(label,'name')\")\n",
    "res"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'isInSystem': 9, 'orbits': 9}]"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "res = db.run_query(f\"g.V().has('planet','isSupportsLife','True').outE().groupCount().by(label)\")\n",
    "res"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Planets that support life orbit which objects"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['',\n",
       " 'Zathoubruns',\n",
       " 'Tees',\n",
       " 'Roohaqchuns',\n",
       " 'Bud',\n",
       " 'Jelczgyisaur',\n",
       " 'Sau',\n",
       " 'Fort',\n",
       " 'Hay']"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = db.run_query(f\"g.V().has('planet','isSupportsLife','True').out('orbits').values('name')\")\n",
    "res"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Which objects orbit planets that support life"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Inflansnul',\n",
       " 'Hiedric',\n",
       " 'Saghdeis',\n",
       " 'Saultvoortbutz',\n",
       " 'Zansktrowsab',\n",
       " 'Laytrichbrua',\n",
       " 'Kamp',\n",
       " 'Taysmahlsman',\n",
       " 'Brawheatksihaar',\n",
       " 'Geejaa',\n",
       " 'Ripdelf',\n",
       " 'Klungnealorsul',\n",
       " '',\n",
       " 'Zierswhigles',\n",
       " 'Pruduc',\n",
       " 'Paz',\n",
       " 'Palmlushnhoch',\n",
       " 'Kidrarstrezhus',\n",
       " 'Nhonaff',\n",
       " 'Suamanj',\n",
       " 'Brildorp',\n",
       " 'Bruckfimsklisobsloch',\n",
       " 'Hrweigoz',\n",
       " 'Vuewiongryz',\n",
       " 'Giers',\n",
       " 'Mtsenskku',\n",
       " 'Tsuodfreyluzsant',\n",
       " 'Cheikhhworthrickhlong',\n",
       " 'Fnalous',\n",
       " 'Corkbel',\n",
       " 'Lill',\n",
       " 'Cagnerdhansk',\n",
       " 'Warmnancwayq',\n",
       " 'Greshrodams',\n",
       " 'Ngumzimpitts',\n",
       " 'Kiahtinsklesz',\n",
       " 'Tufshimgiang',\n",
       " 'Bawsboentlis',\n",
       " 'Tlovluch',\n",
       " '',\n",
       " 'Keocquixguz',\n",
       " 'Corbryngling',\n",
       " 'Shelxaulkav',\n",
       " 'Heidgar',\n",
       " 'Jerhamsloo',\n",
       " 'Fastcil',\n",
       " 'Ukhdnis',\n",
       " 'Yingzliy',\n",
       " 'Mbal',\n",
       " 'Phakmys',\n",
       " 'Laotem',\n",
       " 'Pomplun',\n",
       " 'Huttntunjuif',\n",
       " 'Nielovskkyatell',\n",
       " 'Sles',\n",
       " 'Kurskoohlac',\n",
       " 'Hinzychzgierz',\n",
       " 'Poynaisix',\n",
       " 'Kweksrustsig',\n",
       " 'Kushkborz',\n",
       " 'Diosjang',\n",
       " 'Pietcienhyns',\n",
       " 'Firslaaschowc',\n",
       " 'Zhongpriygid',\n",
       " 'Tzincel',\n",
       " 'Tlaxburgh',\n",
       " 'Rocksmitc',\n",
       " 'Csi',\n",
       " 'Raalgningszen',\n",
       " 'Menzweesp',\n",
       " 'Dorcdutqeshmbnoyview',\n",
       " 'Heibloisquet',\n",
       " 'Hribstsindigkelkchon',\n",
       " 'Koffdea',\n",
       " 'Melsshahriu',\n",
       " 'Trahsnocknche',\n",
       " 'Vamhamn',\n",
       " 'Titweereang',\n",
       " 'Kwitkumb',\n",
       " 'Chalcfreefay',\n",
       " 'Westcdmondstsinhans',\n",
       " 'Tinsnorthhornc',\n",
       " 'Tarskkoot',\n",
       " 'Longnyts',\n",
       " '',\n",
       " 'Bnoyguancvny',\n",
       " 'Kuhquatbaallahn',\n",
       " 'Laangeylya',\n",
       " 'Amphmuk',\n",
       " 'Penbraupryswens',\n",
       " 'Kezkongsgnorpenn',\n",
       " 'Voatual',\n",
       " 'Miinuuk',\n",
       " 'Wautelnaalst',\n",
       " 'Affhnuleut',\n",
       " 'Kiomqiubryantdraa',\n",
       " 'Apschopfpeak',\n",
       " 'Heeschhnyychatjon',\n",
       " 'Zha',\n",
       " 'Kachdoncklus',\n",
       " 'Noandreirzhevqing',\n",
       " 'Psonbnyk',\n",
       " 'Gmingcro',\n",
       " 'Ros',\n",
       " 'Laonzewcakzmir',\n",
       " 'Neath',\n",
       " 'Rikleebong',\n",
       " 'Hardwayndviewhmun',\n",
       " 'Revselc',\n",
       " 'Gedguanz',\n",
       " 'Schroefahtal',\n",
       " 'Schobrand',\n",
       " 'Zahn',\n",
       " 'Mieskiy',\n",
       " 'Dajfighcheondmon',\n",
       " 'Coishtoonrykuu',\n",
       " 'Hresil',\n",
       " 'Malspru',\n",
       " 'Pruszcznolds',\n",
       " 'Hraknien',\n",
       " 'Pua',\n",
       " 'Crans',\n",
       " 'Crimirbep',\n",
       " 'Kretletskfers',\n",
       " 'Tikcnhonhu',\n",
       " 'Lefdniehres',\n",
       " 'Feidzyr',\n",
       " 'Meikdykbern',\n",
       " 'Dwijlewcaa',\n",
       " 'Wischgraphongch',\n",
       " 'Naurmaurtyan',\n",
       " 'Oelgliang',\n",
       " 'Vreuxkiev',\n",
       " 'Tsovskshiggraf',\n",
       " 'Frastlas',\n",
       " 'Fahrnnajneal',\n",
       " 'Pexgoldschyn',\n",
       " 'Thaygarr',\n",
       " 'Henfoum',\n",
       " 'Jidletskquin',\n",
       " 'Vaugcelsmold',\n",
       " 'Changsaid',\n",
       " 'Sleydeyskessk',\n",
       " 'Cacmitbrai',\n",
       " 'Hunri',\n",
       " 'Sanhesnio',\n",
       " 'Chaquaeslam',\n",
       " 'Tro',\n",
       " 'Balon',\n",
       " 'Vicas',\n",
       " 'Warnin',\n",
       " 'Civo',\n",
       " 'Lecanwi',\n",
       " 'Nypeta',\n",
       " 'Gon',\n",
       " 'Tilgengra',\n",
       " 'Teinsal',\n",
       " 'Hinportby',\n",
       " 'Carroy',\n",
       " 'Huagarnasren',\n",
       " 'Wesbi',\n",
       " 'Covarlar',\n",
       " 'Qa',\n",
       " 'Kas',\n",
       " 'Yeselbay',\n",
       " 'Herou',\n",
       " 'Liarou',\n",
       " 'Lou',\n",
       " 'Conrangu',\n",
       " 'Gouhillleskin',\n",
       " 'Bentra',\n",
       " 'Mostu',\n",
       " '',\n",
       " 'Dypestber',\n",
       " 'Gro',\n",
       " 'Bre',\n",
       " 'Oufermes',\n",
       " 'Tarren',\n",
       " 'Brekreisdes',\n",
       " 'Roy',\n",
       " 'Trobosonrat',\n",
       " 'Newrerezlyjiang',\n",
       " 'Piapurbia',\n",
       " 'Dro',\n",
       " 'Fe',\n",
       " 'Rangvo',\n",
       " 'Col',\n",
       " 'Rondota',\n",
       " 'Anunvia',\n",
       " 'Baslank',\n",
       " 'Naytil',\n",
       " 'Lifieldchi',\n",
       " 'Richley',\n",
       " 'Piavebil',\n",
       " 'Snolo',\n",
       " 'Garhil',\n",
       " 'Zoneuyo',\n",
       " 'May',\n",
       " 'Hui',\n",
       " 'Riefaan',\n",
       " 'Diahui',\n",
       " 'Kinbudes',\n",
       " 'Nin',\n",
       " 'Furam',\n",
       " 'Aymorbang',\n",
       " 'Gorsklambor',\n",
       " 'Newtor',\n",
       " 'Puerhaskayher',\n",
       " 'Ken',\n",
       " 'Doneast',\n",
       " 'Dorfmis',\n",
       " 'Layrasreku',\n",
       " 'Newinnorth',\n",
       " 'Yerei',\n",
       " 'Diayolaubilya',\n",
       " 'Richesboten']"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = db.run_query(f\"g.V().has('planet','isSupportsLife','False').in('orbits').values('name')\")\n",
    "res"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Which object that orbit clas G stars have planets that are habitable   "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Earth',\n",
       " 'Earth',\n",
       " 'Earth',\n",
       " 'Earth',\n",
       " 'Earth',\n",
       " 'Earth',\n",
       " 'Earth',\n",
       " 'Earth',\n",
       " 'Earth']"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = db.run_query(f\"g.V().has('star','class','G').in('orbits').has('isSupportsLife','True').values('name')\")\n",
    "res"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [],
   "source": [
    "res = db.run_query(f\"g.V().has('star','class','G').outE().inV().path()\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "returned is a list of paths, with the objects in them. Each item in the list is a list of size three"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'id': '7a9e3f2e-ce4c-4c8e-afef-43ee15557591',\n",
       "  'label': 'star',\n",
       "  'type': 'vertex',\n",
       "  'properties': {'class': [{'id': 'c2c2c059-8652-4f9c-a4c5-0e4cfcbe2e1d',\n",
       "     'value': 'G'}],\n",
       "   'radius': [{'id': '44896827-da04-4832-90a4-ca3ccba10f0f', 'value': 106}],\n",
       "   'name': [{'id': '56f788f9-c312-4f20-9b4a-cd4c4ec13688', 'value': ''}],\n",
       "   'objid': [{'id': '7a9e3f2e-ce4c-4c8e-afef-43ee15557591|objid',\n",
       "     'value': '7725805562058'}],\n",
       "   'username': [{'id': 'acc80266-dd1c-480c-a7dc-0e41bf498cec',\n",
       "     'value': 'billmanhlaptop'}],\n",
       "   'objtype': [{'id': '0d34bc38-df08-4b29-b97d-802340e46288',\n",
       "     'value': 'star'}]}},\n",
       " {'id': '937cdef6-1d7d-482c-b861-0b1f5a4e2433',\n",
       "  'label': 'isInSystem',\n",
       "  'type': 'edge',\n",
       "  'inVLabel': 'system',\n",
       "  'outVLabel': 'star',\n",
       "  'inV': 'bda86e90-9e05-4b66-8471-beab94f6c817',\n",
       "  'outV': '7a9e3f2e-ce4c-4c8e-afef-43ee15557591',\n",
       "  'properties': {'username': 'billmanhlaptop'}},\n",
       " {'id': 'bda86e90-9e05-4b66-8471-beab94f6c817',\n",
       "  'label': 'system',\n",
       "  'type': 'vertex',\n",
       "  'properties': {'name': [{'id': '401384a2-e241-485b-8ca2-af497f703eed',\n",
       "     'value': 'Tsiywiykher'}],\n",
       "   'objid': [{'id': 'bda86e90-9e05-4b66-8471-beab94f6c817|objid',\n",
       "     'value': '7452486453159'}],\n",
       "   'username': [{'id': '3ac30edc-8a92-4afb-8788-66c1a777a907',\n",
       "     'value': 'billmanhlaptop'}],\n",
       "   'objtype': [{'id': '8b980571-b006-4c67-ad4d-ac1eb8e698a2',\n",
       "     'value': 'system'}]}}]"
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res[0]['objects']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[3, 3, 3, 3, 3, 3, 3, 3, 3]"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "[len(i['objects']) for i in res]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "You can also filter on specific values to get a cleaner dataset. use `values('name','radius').fold()` to get a tiny list of items. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 41,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'labels': [['star'], ['link'], ['system']],\n",
       "  'objects': [['', 106], 'isInSystem', 'Tsiywiykher']},\n",
       " {'labels': [['star'], ['link'], ['system']],\n",
       "  'objects': [['Zathoubruns', 106], 'isInSystem', '']},\n",
       " {'labels': [['star'], ['link'], ['system']],\n",
       "  'objects': [['Tees', 106], 'isInSystem', 'Consknell']},\n",
       " {'labels': [['star'], ['link'], ['system']],\n",
       "  'objects': [['Roohaqchuns', 106], 'isInSystem', 'Skikdzhahakqi']},\n",
       " {'labels': [['star'], ['link'], ['system']],\n",
       "  'objects': [['Bud', 106], 'isInSystem', 'Tiancnoanbhart']},\n",
       " {'labels': [['star'], ['link'], ['system']],\n",
       "  'objects': [['Jelczgyisaur', 106], 'isInSystem', 'Svitra']},\n",
       " {'labels': [['star'], ['link'], ['system']],\n",
       "  'objects': [['Sau', 106], 'isInSystem', 'Roysal']},\n",
       " {'labels': [['star'], ['link'], ['system']],\n",
       "  'objects': [['Fort', 106], 'isInSystem', 'Kerve']},\n",
       " {'labels': [['star'], ['link'], ['system']],\n",
       "  'objects': [['Hay', 106], 'isInSystem', 'Milweconwo']}]"
      ]
     },
     "execution_count": 41,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = db.run_query(f\"g.V().has('star','class','G').as('star').outE().as('link').inV().as('system').path().by(values('name','radius').fold()).by(label).by('name')\")\n",
    "res"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## 3.3.5. Using as, select and project to refer to traversal steps"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'Star': {'id': '7a9e3f2e-ce4c-4c8e-afef-43ee15557591',\n",
       "   'label': 'star',\n",
       "   'type': 'vertex',\n",
       "   'properties': {'class': [{'id': 'c2c2c059-8652-4f9c-a4c5-0e4cfcbe2e1d',\n",
       "      'value': 'G'}],\n",
       "    'radius': [{'id': '44896827-da04-4832-90a4-ca3ccba10f0f', 'value': 106}],\n",
       "    'name': [{'id': '56f788f9-c312-4f20-9b4a-cd4c4ec13688', 'value': ''}],\n",
       "    'objid': [{'id': '7a9e3f2e-ce4c-4c8e-afef-43ee15557591|objid',\n",
       "      'value': '7725805562058'}],\n",
       "    'username': [{'id': 'acc80266-dd1c-480c-a7dc-0e41bf498cec',\n",
       "      'value': 'billmanhlaptop'}],\n",
       "    'objtype': [{'id': '0d34bc38-df08-4b29-b97d-802340e46288',\n",
       "      'value': 'star'}]}},\n",
       "  'Planet': {'id': '1d4a23cc-5751-4367-bd3f-990e4d3ff22e',\n",
       "   'label': 'planet',\n",
       "   'type': 'vertex',\n",
       "   'properties': {'isSupportsLife': [{'id': 'c6949f31-867f-4ec7-99dd-0b8da55996d9',\n",
       "      'value': 'True'}],\n",
       "    'class': [{'id': '2e74ea9f-bdd9-4598-ab6d-38b7e9781945',\n",
       "      'value': 'terrestrial'}],\n",
       "    'name': [{'id': 'f97c359e-0173-43dc-95f1-16eae249e5f9', 'value': 'Earth'}],\n",
       "    'objid': [{'id': '1d4a23cc-5751-4367-bd3f-990e4d3ff22e|objid',\n",
       "      'value': '5596978223811'}],\n",
       "    'mass': [{'id': 'dfaa7cbe-0414-4476-9b89-1bdca8a26e6f', 'value': 0.5715}],\n",
       "    'radius': [{'id': '53ac0e93-ec60-461f-9fed-1276718b7531',\n",
       "      'value': 0.8395}],\n",
       "    'orbitsDistance': [{'id': '70c53e34-5b36-4f9e-9d88-dd0ecd77fe02',\n",
       "      'value': 4}],\n",
       "    'orbitsId': [{'id': '17c8f91a-4d8f-4ca2-990c-56744c1bc9da',\n",
       "      'value': '7725805562058'}],\n",
       "    'orbitsName': [{'id': 'caf2235e-69a8-4a25-8658-8ecb554d0caa',\n",
       "      'value': ''}],\n",
       "    'isPopulated': [{'id': 'd4a18ac8-7086-4bc0-9025-676ca477c6e3',\n",
       "      'value': 'True'}],\n",
       "    'isHomeworld': [{'id': 'ef9badc2-190f-418a-8b4e-246845782d05',\n",
       "      'value': 'True'}],\n",
       "    'username': [{'id': 'fe03d2c8-c813-4c9e-942f-d039b838e907',\n",
       "      'value': 'billmanhlaptop'}],\n",
       "    'objtype': [{'id': '2b3e613f-4cdc-48c4-913d-35a1ee29b1db',\n",
       "      'value': 'planet'}]}}},\n",
       " {'Star': {'id': 'f378ac7b-ac56-4c50-9eda-c2cd5426a648',\n",
       "   'label': 'star',\n",
       "   'type': 'vertex',\n",
       "   'properties': {'class': [{'id': '259eeb99-4d01-4708-92b1-6701cff6a0af',\n",
       "      'value': 'G'}],\n",
       "    'radius': [{'id': '20ca998b-92da-4f78-ba1b-2b506ef43647', 'value': 106}],\n",
       "    'name': [{'id': 'bb1ecaf9-e763-45d3-ba9e-6b2637883234',\n",
       "      'value': 'Zathoubruns'}],\n",
       "    'objid': [{'id': 'f378ac7b-ac56-4c50-9eda-c2cd5426a648|objid',\n",
       "      'value': '4624324586241'}],\n",
       "    'username': [{'id': '1388c597-c71a-495d-9602-269dd9b6db93',\n",
       "      'value': 'userbill'}],\n",
       "    'objtype': [{'id': '9f455239-259f-4ce8-93d5-de479538f0d7',\n",
       "      'value': 'star'}]}},\n",
       "  'Planet': {'id': '6eb5025a-b5f8-473c-9ac6-4fa9801e8a51',\n",
       "   'label': 'planet',\n",
       "   'type': 'vertex',\n",
       "   'properties': {'isSupportsLife': [{'id': 'f8b26b1f-fa9d-4f59-982b-e22782be9513',\n",
       "      'value': 'True'}],\n",
       "    'class': [{'id': 'e582d55b-1750-4ea5-b6f4-d8d184914e6b',\n",
       "      'value': 'terrestrial'}],\n",
       "    'name': [{'id': '39d45f5b-c8cd-44f2-acd6-d65d3c3c954b', 'value': 'Earth'}],\n",
       "    'objid': [{'id': '6eb5025a-b5f8-473c-9ac6-4fa9801e8a51|objid',\n",
       "      'value': '1281249220790'}],\n",
       "    'mass': [{'id': '9a922bf3-4bbc-47c2-ab37-45ecff8722eb', 'value': 0.6776}],\n",
       "    'radius': [{'id': 'efd8a347-6fe7-4156-be5f-7e462a648754',\n",
       "      'value': 0.6061}],\n",
       "    'orbitsDistance': [{'id': '3180ed3c-1317-4e2d-8e88-07e613735b22',\n",
       "      'value': 1}],\n",
       "    'orbitsId': [{'id': '7a877f58-3d75-442f-bd41-6b9440501140',\n",
       "      'value': '4624324586241'}],\n",
       "    'orbitsName': [{'id': '6830df08-447a-4bef-9d9b-518db8a16475',\n",
       "      'value': 'Zathoubruns'}],\n",
       "    'isPopulated': [{'id': 'd07c20f9-0c99-4967-bdef-fc2da9017a26',\n",
       "      'value': 'True'}],\n",
       "    'isHomeworld': [{'id': '5c173843-9881-4b7b-be1a-66c4405d3683',\n",
       "      'value': 'True'}],\n",
       "    'username': [{'id': '722abacc-c2b2-41e4-a8e3-81cd327f4a82',\n",
       "      'value': 'userbill'}],\n",
       "    'objtype': [{'id': '3307562b-769f-4a80-ba4d-63e0a801f520',\n",
       "      'value': 'planet'}]}}},\n",
       " {'Star': {'id': 'a7fd7844-a357-4092-9074-a37f4b59fd0e',\n",
       "   'label': 'star',\n",
       "   'type': 'vertex',\n",
       "   'properties': {'class': [{'id': '17a60ac6-9f53-452a-9556-b4ffbf2f9454',\n",
       "      'value': 'G'}],\n",
       "    'radius': [{'id': 'df3f5ccd-b2bc-416e-bc19-a95a87e7f3af', 'value': 106}],\n",
       "    'name': [{'id': '121a6fd2-5679-468d-90ec-0ab2777dc5c7', 'value': 'Tees'}],\n",
       "    'objid': [{'id': 'a7fd7844-a357-4092-9074-a37f4b59fd0e|objid',\n",
       "      'value': '7502163201384'}],\n",
       "    'username': [{'id': 'fcfb5532-6921-4ee7-a205-d28be59e99b5',\n",
       "      'value': 'billmanh4'}],\n",
       "    'objtype': [{'id': 'f365cf54-f586-42a7-8658-18a2fb8a9bce',\n",
       "      'value': 'star'}]}},\n",
       "  'Planet': {'id': '13032efe-4d9b-43e5-8bd9-38b3d372c44b',\n",
       "   'label': 'planet',\n",
       "   'type': 'vertex',\n",
       "   'properties': {'isSupportsLife': [{'id': 'd633d25f-a7a9-4965-b48b-c6b9bace6050',\n",
       "      'value': 'True'}],\n",
       "    'class': [{'id': '28ee4bb6-ff45-4c74-af72-c41c4363674b',\n",
       "      'value': 'terrestrial'}],\n",
       "    'name': [{'id': '43734bf8-e368-456e-ba76-48e6c8900a39', 'value': 'Earth'}],\n",
       "    'objid': [{'id': '13032efe-4d9b-43e5-8bd9-38b3d372c44b|objid',\n",
       "      'value': '3535970015503'}],\n",
       "    'mass': [{'id': '72035767-8d9a-450b-931b-b0967b38bde5', 'value': 0.8087}],\n",
       "    'radius': [{'id': 'fc4b2ee9-a2c0-48e1-bf36-f0b470620e73',\n",
       "      'value': 0.6392}],\n",
       "    'orbitsDistance': [{'id': '7640b11c-3c8e-4909-aa41-c63d7a370e2e',\n",
       "      'value': 2}],\n",
       "    'orbitsId': [{'id': '7be2e660-c4a6-4947-962e-4de586b2d166',\n",
       "      'value': '7502163201384'}],\n",
       "    'orbitsName': [{'id': '6f293578-fa0e-40a2-9b54-01ca697cae48',\n",
       "      'value': 'Tees'}],\n",
       "    'isPopulated': [{'id': 'cc3efa31-f24c-481f-b49f-2d5f5117f097',\n",
       "      'value': 'True'}],\n",
       "    'isHomeworld': [{'id': 'f88e5785-5ec9-45ec-8a95-da8ed2ab3e9d',\n",
       "      'value': 'True'}],\n",
       "    'username': [{'id': 'da82b71f-24ac-4a5a-ba51-92453836bb48',\n",
       "      'value': 'billmanh4'}],\n",
       "    'objtype': [{'id': '1d480b3b-6a96-4846-98f4-e849a932901b',\n",
       "      'value': 'planet'}]}}},\n",
       " {'Star': {'id': '6462fc39-b610-43fe-8279-2cea2c9ca2f0',\n",
       "   'label': 'star',\n",
       "   'type': 'vertex',\n",
       "   'properties': {'class': [{'id': 'c04b38db-0f97-44e2-9ac0-291d7eaf2e13',\n",
       "      'value': 'G'}],\n",
       "    'radius': [{'id': 'fc022d37-9175-468f-83df-b94baff7e963', 'value': 106}],\n",
       "    'name': [{'id': 'de070ebd-1d85-4029-a3f1-66a18621ed83',\n",
       "      'value': 'Roohaqchuns'}],\n",
       "    'objid': [{'id': '6462fc39-b610-43fe-8279-2cea2c9ca2f0|objid',\n",
       "      'value': '2545015797009'}],\n",
       "    'username': [{'id': '2614b4bc-29e1-45b0-a987-d61fc8d0341a',\n",
       "      'value': 'Billmanh'}],\n",
       "    'objtype': [{'id': '35e0456f-df1c-4779-b72b-b3e55c2b716f',\n",
       "      'value': 'star'}]}},\n",
       "  'Planet': {'id': '0abc737f-06ce-43e7-965b-373e8a096dff',\n",
       "   'label': 'planet',\n",
       "   'type': 'vertex',\n",
       "   'properties': {'isSupportsLife': [{'id': '61563549-03f5-418b-8b48-5d2401047d29',\n",
       "      'value': 'True'}],\n",
       "    'class': [{'id': 'c794e821-7b08-491a-a7b9-0f04a45457e9',\n",
       "      'value': 'terrestrial'}],\n",
       "    'name': [{'id': 'f2cf988a-b953-492c-995a-d61f3cbc4512', 'value': 'Earth'}],\n",
       "    'objid': [{'id': '0abc737f-06ce-43e7-965b-373e8a096dff|objid',\n",
       "      'value': '2500643532261'}],\n",
       "    'mass': [{'id': '9e9566c1-b67f-4f7f-87f3-b39d367cbc91', 'value': 0.66}],\n",
       "    'radius': [{'id': 'd3fc9609-187c-4e1b-be3a-ca0045dd0de1', 'value': 0.92}],\n",
       "    'orbitsDistance': [{'id': '5b279672-dadf-40cf-bbff-71557e82610a',\n",
       "      'value': 2}],\n",
       "    'orbitsId': [{'id': '5c743958-33f8-4ba9-933f-d5a589d240a9',\n",
       "      'value': '2545015797009'}],\n",
       "    'orbitsName': [{'id': 'e5edf522-615d-4207-92f7-6decced517a3',\n",
       "      'value': 'Roohaqchuns'}],\n",
       "    'isPopulated': [{'id': 'be38f8ba-d5d4-4515-be01-beabda88e91f',\n",
       "      'value': 'True'}],\n",
       "    'isHomeworld': [{'id': 'e8f9659f-3af5-4426-9863-14218c4d24a8',\n",
       "      'value': 'True'}],\n",
       "    'username': [{'id': '187c98c1-d27b-4a00-bc1f-568b18681147',\n",
       "      'value': 'Billmanh'}],\n",
       "    'objtype': [{'id': '44fb0e12-ed9c-4305-8752-e868ad489124',\n",
       "      'value': 'planet'}]}}},\n",
       " {'Star': {'id': '9f24eee0-f06a-4bb1-855c-4e764e4bbb30',\n",
       "   'label': 'star',\n",
       "   'type': 'vertex',\n",
       "   'properties': {'class': [{'id': '04df939d-adca-4705-9e37-0c39fe3b1ae3',\n",
       "      'value': 'G'}],\n",
       "    'radius': [{'id': 'd17fe65e-d27c-47c3-8d11-7e5534e71cef', 'value': 106}],\n",
       "    'name': [{'id': '58646e50-bb45-4d66-82b3-db548cdbe9ae', 'value': 'Bud'}],\n",
       "    'objid': [{'id': '9f24eee0-f06a-4bb1-855c-4e764e4bbb30|objid',\n",
       "      'value': '6837045385784'}],\n",
       "    'username': [{'id': '7c1c9f78-eca3-4ff2-b4ea-e0bc0f1c338a',\n",
       "      'value': 'BillmanLocal'}],\n",
       "    'objtype': [{'id': '804e0922-5007-4df5-b736-666eeee7be26',\n",
       "      'value': 'star'}]}},\n",
       "  'Planet': {'id': 'c817cb0f-380f-4f32-ae9e-0bb5d6c70a26',\n",
       "   'label': 'planet',\n",
       "   'type': 'vertex',\n",
       "   'properties': {'isSupportsLife': [{'id': 'efb5bdbf-f208-418f-bc73-d0a71f11aae5',\n",
       "      'value': 'True'}],\n",
       "    'class': [{'id': '63df5a18-61e1-40b2-b1af-d187eea40fb3',\n",
       "      'value': 'terrestrial'}],\n",
       "    'name': [{'id': '75d5042e-8a4c-444f-a6a0-ad0b3b80cdd8', 'value': 'Earth'}],\n",
       "    'objid': [{'id': 'c817cb0f-380f-4f32-ae9e-0bb5d6c70a26|objid',\n",
       "      'value': '2711868081060'}],\n",
       "    'mass': [{'id': 'bd281c9a-789d-48a1-9a00-54379fa8f892', 'value': 0.7289}],\n",
       "    'radius': [{'id': '9957cb22-3371-4aa6-958a-1fe0ab7d9cd6',\n",
       "      'value': 1.1949}],\n",
       "    'orbitsDistance': [{'id': 'f4cf6c72-051b-4157-a550-a1a47f3b2e64',\n",
       "      'value': 1}],\n",
       "    'orbitsId': [{'id': 'e8ea4cd9-e52b-430d-8164-4d3f2486b710',\n",
       "      'value': '6837045385784'}],\n",
       "    'orbitsName': [{'id': 'e9c9b1da-9c41-4666-9b64-48543b668027',\n",
       "      'value': 'Bud'}],\n",
       "    'isPopulated': [{'id': 'feb2f09c-f759-4eb9-a750-2f970109cc1f',\n",
       "      'value': 'True'}],\n",
       "    'isHomeworld': [{'id': 'd0a68fb8-216c-4f4d-a065-5399a1506b77',\n",
       "      'value': 'True'}],\n",
       "    'username': [{'id': '686ff246-9415-441b-888a-57afb96e8923',\n",
       "      'value': 'BillmanLocal'}],\n",
       "    'objtype': [{'id': '1304bdd1-bbb1-4f18-aba9-11d5e43fe9df',\n",
       "      'value': 'planet'}]}}},\n",
       " {'Star': {'id': '86629b6d-c5f1-4b7d-9c90-158b4c6f23c2',\n",
       "   'label': 'star',\n",
       "   'type': 'vertex',\n",
       "   'properties': {'class': [{'id': '1e0fb166-23ea-40fc-a2e2-8b60edc346a8',\n",
       "      'value': 'G'}],\n",
       "    'radius': [{'id': 'ef147a69-726e-46eb-8b4f-76c2998b2c0f', 'value': 106}],\n",
       "    'name': [{'id': '3a4f1b87-1093-461d-8b14-d7da610d1749',\n",
       "      'value': 'Jelczgyisaur'}],\n",
       "    'objid': [{'id': '86629b6d-c5f1-4b7d-9c90-158b4c6f23c2|objid',\n",
       "      'value': '2558366890520'}],\n",
       "    'username': [{'id': 'd3586737-011f-4559-94f0-86a831486c83',\n",
       "      'value': 'william.jeffrey.harding@gmail.com'}],\n",
       "    'objtype': [{'id': 'f45183ae-fd86-454d-9e34-9bd0cd2ef4a3',\n",
       "      'value': 'star'}]}},\n",
       "  'Planet': {'id': 'f478c928-01c8-498b-b1cb-afc29e53308e',\n",
       "   'label': 'planet',\n",
       "   'type': 'vertex',\n",
       "   'properties': {'isSupportsLife': [{'id': 'ded06aab-48c5-45b8-9c3f-39c195cf4d5f',\n",
       "      'value': 'True'}],\n",
       "    'class': [{'id': 'cdc4e68f-d111-4a2e-8309-b196faefb742',\n",
       "      'value': 'terrestrial'}],\n",
       "    'name': [{'id': '498dfe43-1cdb-4afd-b41d-ee234b292373', 'value': 'Earth'}],\n",
       "    'objid': [{'id': 'f478c928-01c8-498b-b1cb-afc29e53308e|objid',\n",
       "      'value': '3725978767878'}],\n",
       "    'mass': [{'id': '3b46a9df-1b99-4bda-9fc7-d65acd7ff3fa', 'value': 0.4001}],\n",
       "    'radius': [{'id': '4b24623f-4278-48bc-93d9-e152c4d2e6bb',\n",
       "      'value': 1.0357}],\n",
       "    'orbitsDistance': [{'id': 'd6a570c4-8771-4f3a-8b82-56043db23844',\n",
       "      'value': 2}],\n",
       "    'orbitsId': [{'id': 'ad58ee8e-2f85-4371-a210-6b52bd9a814d',\n",
       "      'value': '2558366890520'}],\n",
       "    'orbitsName': [{'id': '7d9be915-5b46-4d76-8889-2480ee598870',\n",
       "      'value': 'Jelczgyisaur'}],\n",
       "    'isPopulated': [{'id': 'a21de64e-aefc-431a-a363-b62a990b5d59',\n",
       "      'value': 'True'}],\n",
       "    'isHomeworld': [{'id': '5af93c4e-96b9-4118-ad83-9db407951b93',\n",
       "      'value': 'True'}],\n",
       "    'username': [{'id': '01dfaa74-6e7d-4659-8f15-a14a3fbc9173',\n",
       "      'value': 'william.jeffrey.harding@gmail.com'}],\n",
       "    'objtype': [{'id': '618ecf25-3187-4d8f-9a19-eef31b106dfb',\n",
       "      'value': 'planet'}]}}},\n",
       " {'Star': {'id': '76333501-969d-442c-a3bf-baffb8e9826a',\n",
       "   'label': 'star',\n",
       "   'type': 'vertex',\n",
       "   'properties': {'class': [{'id': '4408047d-a870-47e9-b8fd-27d3334b8337',\n",
       "      'value': 'G'}],\n",
       "    'radius': [{'id': 'f9e061fc-7c38-47fa-b2d4-fccee10d7f2d', 'value': 106}],\n",
       "    'name': [{'id': '28efa734-aa2c-4808-9d34-e4375b5916b5', 'value': 'Sau'}],\n",
       "    'objid': [{'id': '76333501-969d-442c-a3bf-baffb8e9826a|objid',\n",
       "      'value': '5875551699273'}],\n",
       "    'username': [{'id': '70f546bd-67c9-4786-8219-bf11f1898dae',\n",
       "      'value': 'explorer'}],\n",
       "    'objtype': [{'id': '2c8b7159-c8e2-409c-862c-85b183be54ec',\n",
       "      'value': 'star'}]}},\n",
       "  'Planet': {'id': '7855c349-da19-4bf1-a627-fd29e66c2460',\n",
       "   'label': 'planet',\n",
       "   'type': 'vertex',\n",
       "   'properties': {'isSupportsLife': [{'id': '565a464e-8a6d-4e8b-ac86-c41f47de03cd',\n",
       "      'value': 'True'}],\n",
       "    'class': [{'id': '63981cac-cb03-4614-9df2-0c816c18e662',\n",
       "      'value': 'terrestrial'}],\n",
       "    'name': [{'id': 'fafdd3c5-b6fe-420e-9375-e882ef9e4277', 'value': 'Earth'}],\n",
       "    'objid': [{'id': '7855c349-da19-4bf1-a627-fd29e66c2460|objid',\n",
       "      'value': '2921294995657'}],\n",
       "    'mass': [{'id': '80b9a933-ac81-4ea9-9040-cb4dc869b04c', 'value': 0.3194}],\n",
       "    'radius': [{'id': '19652c2d-a70c-4091-94ec-01d4b46d7c55',\n",
       "      'value': 0.5441}],\n",
       "    'orbitsDistance': [{'id': '1cc4f211-5d8f-47b8-85e9-8059420f72b1',\n",
       "      'value': 1}],\n",
       "    'orbitsId': [{'id': 'ebbf2088-7ce9-4676-935a-5f93da1a0458',\n",
       "      'value': '5875551699273'}],\n",
       "    'orbitsName': [{'id': '456b8484-3be7-477f-a9d0-aa6627d961fb',\n",
       "      'value': 'Sau'}],\n",
       "    'isPopulated': [{'id': '146137db-5ddc-4bcf-82f9-bede7407d704',\n",
       "      'value': 'True'}],\n",
       "    'isHomeworld': [{'id': '2dc06c0e-35e9-4204-86ea-ac325b69d70e',\n",
       "      'value': 'True'}],\n",
       "    'username': [{'id': 'bc331a2b-8598-442c-bce3-e169161bf106',\n",
       "      'value': 'explorer'}],\n",
       "    'objtype': [{'id': 'fd5a3856-d9fe-40ce-a21f-cbda03b4e265',\n",
       "      'value': 'planet'}]}}},\n",
       " {'Star': {'id': '685236d2-59a7-4dce-8f62-c61b4efe77ac',\n",
       "   'label': 'star',\n",
       "   'type': 'vertex',\n",
       "   'properties': {'class': [{'id': 'd8dcb11e-e852-4a5d-ac16-de0c0216ef97',\n",
       "      'value': 'G'}],\n",
       "    'radius': [{'id': '24309309-a643-4636-b8fa-af611d78e380', 'value': 106}],\n",
       "    'name': [{'id': 'b2e1f721-e69e-4de1-95f4-4179151ef0b0', 'value': 'Fort'}],\n",
       "    'objid': [{'id': '685236d2-59a7-4dce-8f62-c61b4efe77ac|objid',\n",
       "      'value': '4845567259981'}],\n",
       "    'username': [{'id': '1fc9a6ac-0ded-4ec9-97a3-9f46fc2575a4',\n",
       "      'value': 'BillmanLocal2'}],\n",
       "    'objtype': [{'id': '6339a8c7-d00d-4415-8b25-074f3cfc7648',\n",
       "      'value': 'star'}]}},\n",
       "  'Planet': {'id': '127a6ed7-794c-44de-83cd-71b703fa2d22',\n",
       "   'label': 'planet',\n",
       "   'type': 'vertex',\n",
       "   'properties': {'isSupportsLife': [{'id': 'e7d7e3fb-cbaa-4f31-abb0-f76c77efde58',\n",
       "      'value': 'True'}],\n",
       "    'class': [{'id': '50f0b054-1066-4b44-9ed0-282ab4617ff3',\n",
       "      'value': 'terrestrial'}],\n",
       "    'name': [{'id': 'a1246da8-05dd-44df-8925-9d3718d31bfa', 'value': 'Earth'}],\n",
       "    'objid': [{'id': '127a6ed7-794c-44de-83cd-71b703fa2d22|objid',\n",
       "      'value': '3177950515048'}],\n",
       "    'mass': [{'id': 'b47bc5fd-afe9-4366-a22d-f85d752efb97', 'value': 0.9984}],\n",
       "    'radius': [{'id': '3881e110-b197-4dba-9d4d-078528605f4f',\n",
       "      'value': 0.7849}],\n",
       "    'orbitsDistance': [{'id': '2dccbac4-8d1c-4522-8fc1-0ec80e01f2a2',\n",
       "      'value': 0}],\n",
       "    'orbitsId': [{'id': 'c366fcf7-5231-4a7f-839a-dd9122360676',\n",
       "      'value': '4845567259981'}],\n",
       "    'orbitsName': [{'id': 'fd979158-ad0a-447f-9424-6013b7ba6aac',\n",
       "      'value': 'Fort'}],\n",
       "    'isPopulated': [{'id': '24443346-46b8-4e73-8550-75edefbffd1a',\n",
       "      'value': 'True'}],\n",
       "    'isHomeworld': [{'id': '8c9154a2-42f9-4908-a559-68b768539859',\n",
       "      'value': 'True'}],\n",
       "    'username': [{'id': 'f9d8b144-4709-450a-9259-519e0e885ab2',\n",
       "      'value': 'BillmanLocal2'}],\n",
       "    'objtype': [{'id': '232310db-bd30-4cc8-83f5-43201b0de86c',\n",
       "      'value': 'planet'}]}}},\n",
       " {'Star': {'id': 'abbe3878-3b26-4474-88f1-1c37de427614',\n",
       "   'label': 'star',\n",
       "   'type': 'vertex',\n",
       "   'properties': {'class': [{'id': '7c27ec65-c303-461a-9883-57d44aa4f2f8',\n",
       "      'value': 'G'}],\n",
       "    'radius': [{'id': 'e4b96e0f-be59-4967-a017-4b656094d343', 'value': 106}],\n",
       "    'name': [{'id': '26e04358-7509-497e-a044-6368cef58124', 'value': 'Hay'}],\n",
       "    'objid': [{'id': 'abbe3878-3b26-4474-88f1-1c37de427614|objid',\n",
       "      'value': '4038439448968'}],\n",
       "    'username': [{'id': '67ac3ad7-2704-46c0-a490-8f24feb8623d',\n",
       "      'value': 'Billmanserver'}],\n",
       "    'objtype': [{'id': '29aee13f-e8a3-488c-86ea-f197ef7eaa87',\n",
       "      'value': 'star'}]}},\n",
       "  'Planet': {'id': '1cfaf36f-4267-4550-83a7-745ab2ce20e6',\n",
       "   'label': 'planet',\n",
       "   'type': 'vertex',\n",
       "   'properties': {'isSupportsLife': [{'id': '42f72f7c-82d5-44fa-9199-b7ed64d782b7',\n",
       "      'value': 'True'}],\n",
       "    'class': [{'id': '6348d42b-4334-4d5e-aa35-c3e813035029',\n",
       "      'value': 'terrestrial'}],\n",
       "    'name': [{'id': 'a0e4ac41-0a5d-4db2-8686-d0bf4f334523', 'value': 'Earth'}],\n",
       "    'objid': [{'id': '1cfaf36f-4267-4550-83a7-745ab2ce20e6|objid',\n",
       "      'value': '6798305662239'}],\n",
       "    'mass': [{'id': '56337950-a5c5-4d86-b54b-83881acfb737', 'value': 0.6267}],\n",
       "    'radius': [{'id': '8134e69e-5dd6-4ff3-a95f-327e123f8f1d',\n",
       "      'value': 0.4344}],\n",
       "    'orbitsDistance': [{'id': 'd8b1a12f-cd49-444e-9fc6-ae9456cb569f',\n",
       "      'value': 1}],\n",
       "    'orbitsId': [{'id': '99e01cf2-fa22-4ae3-81b3-c8330fb8e1c4',\n",
       "      'value': '4038439448968'}],\n",
       "    'orbitsName': [{'id': '11e0bf74-88da-4dc7-92d4-d30d242b7bb7',\n",
       "      'value': 'Hay'}],\n",
       "    'isPopulated': [{'id': '1541bf16-7e85-42f7-8a49-b69837b62a50',\n",
       "      'value': 'True'}],\n",
       "    'isHomeworld': [{'id': 'b1eecfee-e6ea-4960-a706-cc83376acf08',\n",
       "      'value': 'True'}],\n",
       "    'username': [{'id': '59a28585-b209-418c-b3a5-bb13b1c98def',\n",
       "      'value': 'Billmanserver'}],\n",
       "    'objtype': [{'id': '184f25c5-77c7-479a-905f-db7d586637bc',\n",
       "      'value': 'planet'}]}}}]"
      ]
     },
     "execution_count": 45,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = db.run_query(f\"g.V().has('class','G').as('Star').in().has('isSupportsLife','True').as('Planet').select('Star','Planet')\")\n",
    "res"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.7.0 ('exoplanets')",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.0"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "625a17269cb94aebb094cbcf5e0e8340f26b69d46569da60e8fc69439048adbf"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
