{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys, os\n",
    "import pandas as pd\n",
    "import altair as alt\n",
    "sys.path.append('..')\n",
    "\n",
    "import  ssl, asyncio\n",
    "\n",
    "ssl._create_default_https_context = ssl._create_unverified_context\n",
    "asyncio.set_event_loop_policy(asyncio.WindowsSelectorEventLoopPolicy())\n",
    "import nest_asyncio\n",
    "# this is required for running in a Jupyter Notebook. \n",
    "\n",
    "nest_asyncio.apply()\n",
    "\n",
    "PII_cols = ['username','userguid','owner']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "executing local windows deployment\n"
     ]
    }
   ],
   "source": [
    "from app.connectors.cmdb_graph import CosmosdbClient\n",
    "c = CosmosdbClient()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[7993]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "c.run_query()\n",
    "c.res"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'name': 'Reseastdorf',\n",
       "  'objid': '4865573211898',\n",
       "  'username': 'billmanvr',\n",
       "  'objtype': 'system',\n",
       "  'id': '4865573211898'},\n",
       " {'name': 'Huiland',\n",
       "  'isHomeSystem': 'true',\n",
       "  'objid': '9471863598051',\n",
       "  'glat': -23.912,\n",
       "  'glon': 5.788,\n",
       "  'gelat': 1.841,\n",
       "  'username': 'hapanin',\n",
       "  'objtype': 'system',\n",
       "  'id': '9471863598051'},\n",
       " {'name': 'Tilardi',\n",
       "  'objid': '2137095339401',\n",
       "  'class': 'ordered',\n",
       "  'isHomeSystem': 'true',\n",
       "  'glat': -41.496,\n",
       "  'glon': -16.889,\n",
       "  'gelat': -1.748,\n",
       "  'username': 'manderson',\n",
       "  'objtype': 'system',\n",
       "  'id': '2137095339401'},\n",
       " {'name': 'Minheng',\n",
       "  'objid': '5608050412724',\n",
       "  'class': 'ordered',\n",
       "  'isHomeSystem': 'true',\n",
       "  'glat': -33.212,\n",
       "  'glon': 12.407,\n",
       "  'gelat': 1.086,\n",
       "  'username': 'Billmanserver',\n",
       "  'objtype': 'system',\n",
       "  'id': '5608050412724'},\n",
       " {'name': 'Kairon',\n",
       "  'objid': '1064696388243',\n",
       "  'class': 'ordered',\n",
       "  'isHomeSystem': 'true',\n",
       "  'glat': -19.498,\n",
       "  'glon': -7.057,\n",
       "  'gelat': 6.416,\n",
       "  'username': 'BillmanLocal2',\n",
       "  'objtype': 'system',\n",
       "  'id': '1064696388243'},\n",
       " {'name': 'Acdrapa',\n",
       "  'objid': '6092072583008',\n",
       "  'class': 'ordered',\n",
       "  'isHomeSystem': 'true',\n",
       "  'glat': 57.381,\n",
       "  'glon': -22.914,\n",
       "  'gelat': -2.413,\n",
       "  'username': 'william.jeffrey.harding@gmail.com',\n",
       "  'objtype': 'system',\n",
       "  'id': '6092072583008'},\n",
       " {'name': 'Gugrou',\n",
       "  'objid': '7774389897535',\n",
       "  'class': 'ordered',\n",
       "  'isHomeSystem': 'true',\n",
       "  'glat': 3.953,\n",
       "  'glon': -2.048,\n",
       "  'gelat': 3.562,\n",
       "  'username': 'BillmanLocal',\n",
       "  'objtype': 'system',\n",
       "  'id': '7774389897535'},\n",
       " {'name': 'Titla',\n",
       "  'objid': '0611424540168',\n",
       "  'class': 'ordered',\n",
       "  'isHomeSystem': 'true',\n",
       "  'glat': -11.267,\n",
       "  'glon': -22.218,\n",
       "  'gelat': -12.51,\n",
       "  'username': 'william.harding@avanade.com',\n",
       "  'objtype': 'system',\n",
       "  'id': '0611424540168'},\n",
       " {'name': 'Harkaipuer',\n",
       "  'objid': '3856600820715',\n",
       "  'class': 'ordered',\n",
       "  'isHomeSystem': 'true',\n",
       "  'glat': -1.614,\n",
       "  'glon': -47.321,\n",
       "  'gelat': 10.279,\n",
       "  'username': '',\n",
       "  'objtype': 'system',\n",
       "  'id': '3856600820715'},\n",
       " {'name': 'Hauvilam',\n",
       "  'objid': '8471122034886',\n",
       "  'class': 'ordered',\n",
       "  'isHomeSystem': 'true',\n",
       "  'glat': -7.833,\n",
       "  'glon': 22.262,\n",
       "  'gelat': 1.053,\n",
       "  'username': '8d5b667f-b225-4641-b499-73b77558ff86',\n",
       "  'objtype': 'system',\n",
       "  'id': '8471122034886'},\n",
       " {'name': 'Royhodia',\n",
       "  'objid': '5061736080527',\n",
       "  'class': 'ordered',\n",
       "  'isHomeSystem': 'true',\n",
       "  'glat': -13.788,\n",
       "  'glon': 23.623,\n",
       "  'gelat': 5.112,\n",
       "  'username': '8d5b667f-b225-4641-b499-73b77558ff86',\n",
       "  'objtype': 'system',\n",
       "  'id': '5061736080527'},\n",
       " {'name': 'Perforttau',\n",
       "  'objid': '9701049689007',\n",
       "  'class': 'ordered',\n",
       "  'isHomeSystem': 'true',\n",
       "  'glat': 22.79,\n",
       "  'glon': -36.402,\n",
       "  'gelat': -6.682,\n",
       "  'username': '8d5b667f-b225-4641-b499-73b77558ff86',\n",
       "  'objtype': 'system',\n",
       "  'id': '9701049689007'},\n",
       " {'name': 'Rofen',\n",
       "  'objid': '8997790147955',\n",
       "  'class': 'ordered',\n",
       "  'isHomeSystem': 'true',\n",
       "  'glat': 6.284,\n",
       "  'glon': -2.885,\n",
       "  'gelat': 1.261,\n",
       "  'username': '8d5b667f-b225-4641-b499-73b77558ff86',\n",
       "  'objtype': 'system',\n",
       "  'id': '8997790147955'},\n",
       " {'name': 'Porho',\n",
       "  'objid': '8496512671272',\n",
       "  'class': 'ordered',\n",
       "  'isHomeSystem': 'true',\n",
       "  'glat': 20.903,\n",
       "  'glon': -9.735,\n",
       "  'gelat': -15.482,\n",
       "  'username': '8d5b667f-b225-4641-b499-73b77558ff86',\n",
       "  'objtype': 'system',\n",
       "  'id': '8496512671272'},\n",
       " {'name': 'Huimaida',\n",
       "  'objid': '6846328189030',\n",
       "  'class': 'ordered',\n",
       "  'isHomeSystem': 'true',\n",
       "  'glat': -13.419,\n",
       "  'glon': 10.153,\n",
       "  'gelat': -6.582,\n",
       "  'username': '8d5b667f-b225-4641-b499-73b77558ff86',\n",
       "  'objtype': 'system',\n",
       "  'id': '6846328189030'},\n",
       " {'name': 'Tamilgaon',\n",
       "  'objid': '0257906584993',\n",
       "  'class': 'ordered',\n",
       "  'isHomeSystem': 'true',\n",
       "  'glat': 21.402,\n",
       "  'glon': 14.546,\n",
       "  'gelat': 0.649,\n",
       "  'username': '8d5b667f-b225-4641-b499-73b77558ff86',\n",
       "  'objtype': 'system',\n",
       "  'id': '0257906584993'},\n",
       " {'name': 'Vanpoheightsje',\n",
       "  'objid': '6688714389584',\n",
       "  'class': 'ordered',\n",
       "  'isHomeSystem': 'true',\n",
       "  'glat': -12.325,\n",
       "  'glon': 19.335,\n",
       "  'gelat': 3.363,\n",
       "  'username': '8d5b667f-b225-4641-b499-73b77558ff86',\n",
       "  'objtype': 'system',\n",
       "  'id': '6688714389584'},\n",
       " {'name': 'Santchalau',\n",
       "  'objid': '9286824887949',\n",
       "  'class': 'ordered',\n",
       "  'isHomeSystem': 'true',\n",
       "  'glat': -20.502,\n",
       "  'glon': 5.014,\n",
       "  'gelat': -0.492,\n",
       "  'username': '8d5b667f-b225-4641-b499-73b77558ff86',\n",
       "  'objtype': 'system',\n",
       "  'id': '9286824887949'},\n",
       " {'name': 'Konbay',\n",
       "  'objid': '6201143262578',\n",
       "  'class': 'ordered',\n",
       "  'isHomeSystem': 'true',\n",
       "  'glat': '12.161',\n",
       "  'glon': '-18.524',\n",
       "  'gelat': '0.457',\n",
       "  'userguid': 'ac5b8081-7ef9-4bce-baac-6d0ea7e1782c',\n",
       "  'objtype': 'system',\n",
       "  'id': '6201143262578'},\n",
       " {'name': 'Melhai',\n",
       "  'objid': '2664356987218',\n",
       "  'class': 'ordered',\n",
       "  'isHomeSystem': 'true',\n",
       "  'glat': -20.105,\n",
       "  'glon': -2.596,\n",
       "  'gelat': -4.071,\n",
       "  'userguid': '8d5b667f-b225-4641-b499-73b77558ff86',\n",
       "  'objtype': 'system',\n",
       "  'id': '2664356987218'}]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query=\"g.V().haslabel('system').has('name').valueMap('name','type','objid','glat','glon')\"\n",
    "c.run_query(query)\n",
    "data = c.clean_nodes(c.res)\n",
    "data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'last_updated': '2024-08-07T07:28:26',\n",
       "  'objid': '3025284578519',\n",
       "  'type': 'pre_beta_account',\n",
       "  'username': 'William Harding',\n",
       "  'userguid': '8d5b667f-b225-4641-b499-73b77558ff86',\n",
       "  'created': '2024-01-04T13:12:25',\n",
       "  'last_used': '2024-01-04T13:12:25',\n",
       "  'objtype': 'account',\n",
       "  'id': '3025284578519'}]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query=\"g.V().haslabel('account').has('userguid', '8d5b667f-b225-4641-b499-73b77558ff86').valuemap()\"\n",
    "c.run_query(query)\n",
    "data = c.clean_nodes(c.res)\n",
    "data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "query=\"g.V().haslabel('accont').has('userguid', '8d5b667f-b225-4641-b499-73b77558ff86')\"\n",
    "c.run_query(query)\n",
    "data = c.clean_nodes(c.res)\n",
    "data"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "exoplanets",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.16"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
