{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# How People Decide what they want to do\n",
    "Directed graph approach\n",
    "\n",
    "Generally people want to do a number of different things. For this I'm going to create a schema for this in a graph language that allows me to designate how much a `pop` desires to take a certain action. This will be used later when determining AI decisions. \n",
    "\n",
    "**Note** this notebook actualy builds the desires into the graph, overwriting existing ontology. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys\n",
    "import numpy as np\n",
    "import pandas as pd\n",
    "import altair as alt\n",
    "sys.path.append('..')\n",
    "import helpers.dbquery as db\n",
    "import helpers.functions as f\n",
    "import yaml, ssl, asyncio\n",
    "import nb_black\n",
    "\n",
    "ssl._create_default_https_context = ssl._create_unverified_context\n",
    "asyncio.set_event_loop_policy(asyncio.WindowsSelectorEventLoopPolicy())\n",
    "import nest_asyncio\n",
    "# this is required for running in a Jupyter Notebook. \n",
    "nest_asyncio.apply()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'conformity': 0.427,\n",
       " 'literacy': 0.647,\n",
       " 'aggression': 0.575,\n",
       " 'constitution': 0.554,\n",
       " 'objid': '9033676237817',\n",
       " 'faction_no': 1,\n",
       " 'name': 'Hyder Ranra',\n",
       " 'isInFaction': '2731939737958',\n",
       " 'industry': 0.5645,\n",
       " 'wealth': 0.6058,\n",
       " 'faction_loyalty': 0.4492,\n",
       " 'username': 'BillmanLocal2',\n",
       " 'objtype': 'pop',\n",
       " 'id': '9033676237817'}"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "local_user = \"BillmanLocal2\"\n",
    "res = db.run_query(f\"g.V().hasLabel('pop').has('username','{local_user}').valueMap()\")\n",
    "pops = [db.clean_node(n) for n in res]\n",
    "pops[0]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Each population wants to do everything to a degree, the amount of desire to do that thing is expressed by the edge weight. \n",
    "* Attack a population\n",
    "* Focus on improving literacy\n",
    "* Focus on improving industry"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Desires as Objects\n",
    "\n",
    "## Desire with targets.\n",
    "Both factions and pops can have desire. Action is guided by desire based on the `max(desire.weight)`.\n",
    "`desire` is an edge, the type of that desire is a property of that edge, and the edge weight is the amount of desire. The target (`node2`) is the recipient. \n",
    "\n",
    "Examples:\n",
    "* faction wants trade with faction\n",
    "* pop wants war with another pop\n",
    "* pop wants faction to go to war with faction\n",
    "\n",
    "## Desire without targets.\n",
    "\n",
    "Desires without targets must link to an objective. That objective can be it's own node.\n",
    "\n",
    "### This next cell will upload new desires from `desires.yaml`, which can be edited at any time. \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>type</th>\n",
       "      <th>weight</th>\n",
       "      <th>leadingAttribute</th>\n",
       "      <th>comment</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>objid</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>industry</td>\n",
       "      <td>0.5</td>\n",
       "      <td>wealth</td>\n",
       "      <td>build factories, skyscrapers, infrastructure</td>\n",
       "      <td>notebook</td>\n",
       "      <td>objective</td>\n",
       "      <td>2008795542230</td>\n",
       "      <td>2008795542230</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>expansion</td>\n",
       "      <td>0.5</td>\n",
       "      <td>industry</td>\n",
       "      <td>to increase population, eventually becoming a ...</td>\n",
       "      <td>notebook</td>\n",
       "      <td>objective</td>\n",
       "      <td>3832546566671</td>\n",
       "      <td>3832546566671</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>war</td>\n",
       "      <td>0.4</td>\n",
       "      <td>aggression</td>\n",
       "      <td>the general amount that the society wants to f...</td>\n",
       "      <td>notebook</td>\n",
       "      <td>objective</td>\n",
       "      <td>9111777612067</td>\n",
       "      <td>9111777612067</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>wealth</td>\n",
       "      <td>0.5</td>\n",
       "      <td>literacy</td>\n",
       "      <td>increasing luxury, entertainiment and amenities</td>\n",
       "      <td>notebook</td>\n",
       "      <td>objective</td>\n",
       "      <td>9171875985828</td>\n",
       "      <td>9171875985828</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>science</td>\n",
       "      <td>0.5</td>\n",
       "      <td>literacy</td>\n",
       "      <td>building schools, education systems, informati...</td>\n",
       "      <td>notebook</td>\n",
       "      <td>objective</td>\n",
       "      <td>7056154012146</td>\n",
       "      <td>7056154012146</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        type weight leadingAttribute  \\\n",
       "0   industry    0.5           wealth   \n",
       "1  expansion    0.5         industry   \n",
       "2        war    0.4       aggression   \n",
       "3     wealth    0.5         literacy   \n",
       "4    science    0.5         literacy   \n",
       "\n",
       "                                             comment  username    objtype  \\\n",
       "0       build factories, skyscrapers, infrastructure  notebook  objective   \n",
       "1  to increase population, eventually becoming a ...  notebook  objective   \n",
       "2  the general amount that the society wants to f...  notebook  objective   \n",
       "3    increasing luxury, entertainiment and amenities  notebook  objective   \n",
       "4  building schools, education systems, informati...  notebook  objective   \n",
       "\n",
       "           objid             id  \n",
       "0  2008795542230  2008795542230  \n",
       "1  3832546566671  3832546566671  \n",
       "2  9111777612067  9111777612067  \n",
       "3  9171875985828  9171875985828  \n",
       "4  7056154012146  7056154012146  "
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# # Drop the items, if they exist. \n",
    "# db.run_query(\"g.V().hasLabel('objective').has('username','notebook').drop()\")\n",
    "# objectives_yaml = yaml.safe_load(open(\"desires.yaml\"))['objectives']\n",
    "# data = {\"nodes\":objectives_yaml,'edges':[]}\n",
    "# # Then Create the nodes and add them to the DB\n",
    "# db.upload_data(data,verbose=False)\n",
    "# After creating the nodes, pulling them into the notebook for reference\n",
    "res = db.run_query(\"g.V().hasLabel('objective').valueMap()\")\n",
    "objectives = [db.clean_node(n) for n in res]\n",
    "pd.DataFrame(objectives)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# population wants to improve industry\n",
    "\n",
    "populations want to improve industry when:\n",
    "* they are not wealty\n",
    "* they are at war\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "<div id=\"altair-viz-c8ead189f4f2433fba329dcc869454b9\"></div>\n",
       "<script type=\"text/javascript\">\n",
       "  (function(spec, embedOpt){\n",
       "    let outputDiv = document.currentScript.previousElementSibling;\n",
       "    if (outputDiv.id !== \"altair-viz-c8ead189f4f2433fba329dcc869454b9\") {\n",
       "      outputDiv = document.getElementById(\"altair-viz-c8ead189f4f2433fba329dcc869454b9\");\n",
       "    }\n",
       "    const paths = {\n",
       "      \"vega\": \"https://cdn.jsdelivr.net/npm//vega@5?noext\",\n",
       "      \"vega-lib\": \"https://cdn.jsdelivr.net/npm//vega-lib?noext\",\n",
       "      \"vega-lite\": \"https://cdn.jsdelivr.net/npm//vega-lite@4.8.1?noext\",\n",
       "      \"vega-embed\": \"https://cdn.jsdelivr.net/npm//vega-embed@6?noext\",\n",
       "    };\n",
       "\n",
       "    function loadScript(lib) {\n",
       "      return new Promise(function(resolve, reject) {\n",
       "        var s = document.createElement('script');\n",
       "        s.src = paths[lib];\n",
       "        s.async = true;\n",
       "        s.onload = () => resolve(paths[lib]);\n",
       "        s.onerror = () => reject(`Error loading script: ${paths[lib]}`);\n",
       "        document.getElementsByTagName(\"head\")[0].appendChild(s);\n",
       "      });\n",
       "    }\n",
       "\n",
       "    function showError(err) {\n",
       "      outputDiv.innerHTML = `<div class=\"error\" style=\"color:red;\">${err}</div>`;\n",
       "      throw err;\n",
       "    }\n",
       "\n",
       "    function displayChart(vegaEmbed) {\n",
       "      vegaEmbed(outputDiv, spec, embedOpt)\n",
       "        .catch(err => showError(`Javascript Error: ${err.message}<br>This usually means there's a typo in your chart specification. See the javascript console for the full traceback.`));\n",
       "    }\n",
       "\n",
       "    if(typeof define === \"function\" && define.amd) {\n",
       "      requirejs.config({paths});\n",
       "      require([\"vega-embed\"], displayChart, err => showError(`Error loading script: ${err.message}`));\n",
       "    } else if (typeof vegaEmbed === \"function\") {\n",
       "      displayChart(vegaEmbed);\n",
       "    } else {\n",
       "      loadScript(\"vega\")\n",
       "        .then(() => loadScript(\"vega-lite\"))\n",
       "        .then(() => loadScript(\"vega-embed\"))\n",
       "        .catch(showError)\n",
       "        .then(() => displayChart(vegaEmbed));\n",
       "    }\n",
       "  })({\"config\": {\"view\": {\"continuousWidth\": 400, \"continuousHeight\": 300}}, \"data\": {\"name\": \"data-a6c5bed23bed9c1b07343e3be926cd51\"}, \"mark\": \"line\", \"encoding\": {\"x\": {\"type\": \"quantitative\", \"field\": \"base\"}, \"y\": {\"type\": \"quantitative\", \"field\": \"desire_base\"}}, \"title\": \"Desire relative to the base attribute\", \"$schema\": \"https://vega.github.io/schema/vega-lite/v4.8.1.json\", \"datasets\": {\"data-a6c5bed23bed9c1b07343e3be926cd51\": [{\"wealth\": 0.4975, \"base\": 0, \"desires_industry\": 0.332220367278798, \"desire_base\": -0.0}, {\"wealth\": 0.5585, \"base\": 1, \"desires_industry\": 0.35835739493102337, \"desire_base\": 0.5}, {\"wealth\": 0.5758, \"base\": 2, \"desires_industry\": 0.36540170072344214, \"desire_base\": 0.6666666666666667}, {\"wealth\": 0.6058, \"base\": 3, \"desires_industry\": 0.3772574417735708, \"desire_base\": 0.75}, {\"wealth\": 0.6208, \"base\": 4, \"desires_industry\": 0.3830207305034551, \"desire_base\": 0.8}, {\"wealth\": 0.6267, \"base\": 5, \"desires_industry\": 0.38525849880125407, \"desire_base\": 0.8333333333333334}, {\"wealth\": 0.628, \"base\": 6, \"desires_industry\": 0.3857493857493858, \"desire_base\": 0.8571428571428572}]}}, {\"mode\": \"vega-lite\"});\n",
       "</script>"
      ],
      "text/plain": [
       "alt.Chart(...)"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Marginal return on base attribute\n",
    "n = 2\n",
    "ind_df = pd.DataFrame(np.sort([float(p['wealth']) for p in pops]),columns=['wealth'])\n",
    "ind_df['base'] = range(len(ind_df))\n",
    "ind_df['desires_industry'] = ind_df['wealth'].apply(lambda x: ((x+1)**(1-n) - 1)/(1-n))\n",
    "ind_df['desire_base'] = ind_df['base'].apply(lambda x: ((x+1)**(1-n) - 1)/(1-n))\n",
    "alt.Chart(ind_df).mark_line().encode(x='base',y='desire_base').properties(title=\"Desire relative to the base attribute\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "<div id=\"altair-viz-905e1a9b4bca42049ab3a3ba13923a08\"></div>\n",
       "<script type=\"text/javascript\">\n",
       "  (function(spec, embedOpt){\n",
       "    let outputDiv = document.currentScript.previousElementSibling;\n",
       "    if (outputDiv.id !== \"altair-viz-905e1a9b4bca42049ab3a3ba13923a08\") {\n",
       "      outputDiv = document.getElementById(\"altair-viz-905e1a9b4bca42049ab3a3ba13923a08\");\n",
       "    }\n",
       "    const paths = {\n",
       "      \"vega\": \"https://cdn.jsdelivr.net/npm//vega@5?noext\",\n",
       "      \"vega-lib\": \"https://cdn.jsdelivr.net/npm//vega-lib?noext\",\n",
       "      \"vega-lite\": \"https://cdn.jsdelivr.net/npm//vega-lite@4.8.1?noext\",\n",
       "      \"vega-embed\": \"https://cdn.jsdelivr.net/npm//vega-embed@6?noext\",\n",
       "    };\n",
       "\n",
       "    function loadScript(lib) {\n",
       "      return new Promise(function(resolve, reject) {\n",
       "        var s = document.createElement('script');\n",
       "        s.src = paths[lib];\n",
       "        s.async = true;\n",
       "        s.onload = () => resolve(paths[lib]);\n",
       "        s.onerror = () => reject(`Error loading script: ${paths[lib]}`);\n",
       "        document.getElementsByTagName(\"head\")[0].appendChild(s);\n",
       "      });\n",
       "    }\n",
       "\n",
       "    function showError(err) {\n",
       "      outputDiv.innerHTML = `<div class=\"error\" style=\"color:red;\">${err}</div>`;\n",
       "      throw err;\n",
       "    }\n",
       "\n",
       "    function displayChart(vegaEmbed) {\n",
       "      vegaEmbed(outputDiv, spec, embedOpt)\n",
       "        .catch(err => showError(`Javascript Error: ${err.message}<br>This usually means there's a typo in your chart specification. See the javascript console for the full traceback.`));\n",
       "    }\n",
       "\n",
       "    if(typeof define === \"function\" && define.amd) {\n",
       "      requirejs.config({paths});\n",
       "      require([\"vega-embed\"], displayChart, err => showError(`Error loading script: ${err.message}`));\n",
       "    } else if (typeof vegaEmbed === \"function\") {\n",
       "      displayChart(vegaEmbed);\n",
       "    } else {\n",
       "      loadScript(\"vega\")\n",
       "        .then(() => loadScript(\"vega-lite\"))\n",
       "        .then(() => loadScript(\"vega-embed\"))\n",
       "        .catch(showError)\n",
       "        .then(() => displayChart(vegaEmbed));\n",
       "    }\n",
       "  })({\"config\": {\"view\": {\"continuousWidth\": 400, \"continuousHeight\": 300}}, \"data\": {\"name\": \"data-a6c5bed23bed9c1b07343e3be926cd51\"}, \"mark\": \"line\", \"encoding\": {\"x\": {\"type\": \"nominal\", \"field\": \"wealth\"}, \"y\": {\"type\": \"quantitative\", \"field\": \"desires_industry\"}}, \"title\": \"Desires wealth industry relative to industry\", \"$schema\": \"https://vega.github.io/schema/vega-lite/v4.8.1.json\", \"datasets\": {\"data-a6c5bed23bed9c1b07343e3be926cd51\": [{\"wealth\": 0.4975, \"base\": 0, \"desires_industry\": 0.332220367278798, \"desire_base\": -0.0}, {\"wealth\": 0.5585, \"base\": 1, \"desires_industry\": 0.35835739493102337, \"desire_base\": 0.5}, {\"wealth\": 0.5758, \"base\": 2, \"desires_industry\": 0.36540170072344214, \"desire_base\": 0.6666666666666667}, {\"wealth\": 0.6058, \"base\": 3, \"desires_industry\": 0.3772574417735708, \"desire_base\": 0.75}, {\"wealth\": 0.6208, \"base\": 4, \"desires_industry\": 0.3830207305034551, \"desire_base\": 0.8}, {\"wealth\": 0.6267, \"base\": 5, \"desires_industry\": 0.38525849880125407, \"desire_base\": 0.8333333333333334}, {\"wealth\": 0.628, \"base\": 6, \"desires_industry\": 0.3857493857493858, \"desire_base\": 0.8571428571428572}]}}, {\"mode\": \"vega-lite\"});\n",
       "</script>"
      ],
      "text/plain": [
       "alt.Chart(...)"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "alt.Chart(ind_df).mark_line().encode(x='wealth:N',y='desires_industry').properties(title=\"Desires wealth industry relative to industry\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## feeding that desire to the populations\n",
    "\n",
    "Per above, the initial desire to do a thing is dependant on the `leading attribute`. This makes it easy to adjust the population desires in the `desires.yaml`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'conformity': 0.427, 'literacy': 0.647, 'aggression': 0.575, 'constitution': 0.554, 'objid': '9033676237817', 'faction_no': 1, 'name': 'Hyder Ranra', 'isInFaction': '2731939737958', 'industry': 0.5645, 'wealth': 0.6058, 'faction_loyalty': 0.4492, 'username': 'BillmanLocal2', 'objtype': 'pop', 'id': '9033676237817'}\n",
      "{'type': 'industry', 'weight': '0.5', 'leadingAttribute': 'wealth', 'comment': 'build factories, skyscrapers, infrastructure', 'username': 'notebook', 'objtype': 'objective', 'objid': '2008795542230', 'id': '2008795542230'}\n"
     ]
    }
   ],
   "source": [
    "def get_desire(x):\n",
    "       return np.round(((float(x)+1)**(1-n) - 1)/(1-n),3)\n",
    "\n",
    "popno = 0\n",
    "objectiveno = 0\n",
    "\n",
    "print(pops[popno])\n",
    "print(objectives[objectiveno])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.377"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "get_desire(pops[popno][objectives[objectiveno]['leadingAttribute']])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Create a desire edge for each desire, for each population."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [],
   "source": [
    "edges = []\n",
    "for p in pops:\n",
    "    for o in objectives:\n",
    "        edge = {'label':'desires',\n",
    "                'node1':p['objid'],\n",
    "                'node2':o['objid'],\n",
    "                'desire':o['type'],\n",
    "                'weight':get_desire(p[o['leadingAttribute']])}\n",
    "        edges.append(edge)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'type': 'science',\n",
       " 'weight': '0.5',\n",
       " 'leadingAttribute': 'literacy',\n",
       " 'comment': 'building schools, education systems, information infrastructure',\n",
       " 'username': 'notebook',\n",
       " 'objtype': 'objective',\n",
       " 'objid': '7056154012146',\n",
       " 'id': '7056154012146'}"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "o"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>label</th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>desire</th>\n",
       "      <th>weight</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>desires</td>\n",
       "      <td>9033676237817</td>\n",
       "      <td>2008795542230</td>\n",
       "      <td>industry</td>\n",
       "      <td>0.377</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>desires</td>\n",
       "      <td>9033676237817</td>\n",
       "      <td>3832546566671</td>\n",
       "      <td>expansion</td>\n",
       "      <td>0.361</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>desires</td>\n",
       "      <td>9033676237817</td>\n",
       "      <td>9111777612067</td>\n",
       "      <td>war</td>\n",
       "      <td>0.365</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>desires</td>\n",
       "      <td>9033676237817</td>\n",
       "      <td>9171875985828</td>\n",
       "      <td>wealth</td>\n",
       "      <td>0.393</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>desires</td>\n",
       "      <td>9033676237817</td>\n",
       "      <td>7056154012146</td>\n",
       "      <td>science</td>\n",
       "      <td>0.393</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>desires</td>\n",
       "      <td>4278076177891</td>\n",
       "      <td>2008795542230</td>\n",
       "      <td>industry</td>\n",
       "      <td>0.385</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>desires</td>\n",
       "      <td>4278076177891</td>\n",
       "      <td>3832546566671</td>\n",
       "      <td>expansion</td>\n",
       "      <td>0.360</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>desires</td>\n",
       "      <td>4278076177891</td>\n",
       "      <td>9111777612067</td>\n",
       "      <td>war</td>\n",
       "      <td>0.310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>desires</td>\n",
       "      <td>4278076177891</td>\n",
       "      <td>9171875985828</td>\n",
       "      <td>wealth</td>\n",
       "      <td>0.408</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>desires</td>\n",
       "      <td>4278076177891</td>\n",
       "      <td>7056154012146</td>\n",
       "      <td>science</td>\n",
       "      <td>0.408</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>desires</td>\n",
       "      <td>4469411309555</td>\n",
       "      <td>2008795542230</td>\n",
       "      <td>industry</td>\n",
       "      <td>0.383</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>desires</td>\n",
       "      <td>4469411309555</td>\n",
       "      <td>3832546566671</td>\n",
       "      <td>expansion</td>\n",
       "      <td>0.326</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>desires</td>\n",
       "      <td>4469411309555</td>\n",
       "      <td>9111777612067</td>\n",
       "      <td>war</td>\n",
       "      <td>0.317</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>desires</td>\n",
       "      <td>4469411309555</td>\n",
       "      <td>9171875985828</td>\n",
       "      <td>wealth</td>\n",
       "      <td>0.431</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>desires</td>\n",
       "      <td>4469411309555</td>\n",
       "      <td>7056154012146</td>\n",
       "      <td>science</td>\n",
       "      <td>0.431</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>desires</td>\n",
       "      <td>3938789677933</td>\n",
       "      <td>2008795542230</td>\n",
       "      <td>industry</td>\n",
       "      <td>0.332</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>desires</td>\n",
       "      <td>3938789677933</td>\n",
       "      <td>3832546566671</td>\n",
       "      <td>expansion</td>\n",
       "      <td>0.244</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>desires</td>\n",
       "      <td>3938789677933</td>\n",
       "      <td>9111777612067</td>\n",
       "      <td>war</td>\n",
       "      <td>0.297</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>desires</td>\n",
       "      <td>3938789677933</td>\n",
       "      <td>9171875985828</td>\n",
       "      <td>wealth</td>\n",
       "      <td>0.402</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>desires</td>\n",
       "      <td>3938789677933</td>\n",
       "      <td>7056154012146</td>\n",
       "      <td>science</td>\n",
       "      <td>0.402</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>desires</td>\n",
       "      <td>2894671138843</td>\n",
       "      <td>2008795542230</td>\n",
       "      <td>industry</td>\n",
       "      <td>0.365</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>desires</td>\n",
       "      <td>2894671138843</td>\n",
       "      <td>3832546566671</td>\n",
       "      <td>expansion</td>\n",
       "      <td>0.248</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>desires</td>\n",
       "      <td>2894671138843</td>\n",
       "      <td>9111777612067</td>\n",
       "      <td>war</td>\n",
       "      <td>0.131</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>desires</td>\n",
       "      <td>2894671138843</td>\n",
       "      <td>9171875985828</td>\n",
       "      <td>wealth</td>\n",
       "      <td>0.451</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>desires</td>\n",
       "      <td>2894671138843</td>\n",
       "      <td>7056154012146</td>\n",
       "      <td>science</td>\n",
       "      <td>0.451</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>desires</td>\n",
       "      <td>5846343528467</td>\n",
       "      <td>2008795542230</td>\n",
       "      <td>industry</td>\n",
       "      <td>0.358</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>desires</td>\n",
       "      <td>5846343528467</td>\n",
       "      <td>3832546566671</td>\n",
       "      <td>expansion</td>\n",
       "      <td>0.315</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>desires</td>\n",
       "      <td>5846343528467</td>\n",
       "      <td>9111777612067</td>\n",
       "      <td>war</td>\n",
       "      <td>0.311</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>desires</td>\n",
       "      <td>5846343528467</td>\n",
       "      <td>9171875985828</td>\n",
       "      <td>wealth</td>\n",
       "      <td>0.397</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>desires</td>\n",
       "      <td>5846343528467</td>\n",
       "      <td>7056154012146</td>\n",
       "      <td>science</td>\n",
       "      <td>0.397</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>desires</td>\n",
       "      <td>5405805965731</td>\n",
       "      <td>2008795542230</td>\n",
       "      <td>industry</td>\n",
       "      <td>0.386</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>desires</td>\n",
       "      <td>5405805965731</td>\n",
       "      <td>3832546566671</td>\n",
       "      <td>expansion</td>\n",
       "      <td>0.378</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>desires</td>\n",
       "      <td>5405805965731</td>\n",
       "      <td>9111777612067</td>\n",
       "      <td>war</td>\n",
       "      <td>0.358</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>desires</td>\n",
       "      <td>5405805965731</td>\n",
       "      <td>9171875985828</td>\n",
       "      <td>wealth</td>\n",
       "      <td>0.393</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>desires</td>\n",
       "      <td>5405805965731</td>\n",
       "      <td>7056154012146</td>\n",
       "      <td>science</td>\n",
       "      <td>0.393</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      label          node1          node2     desire  weight\n",
       "0   desires  9033676237817  2008795542230   industry   0.377\n",
       "1   desires  9033676237817  3832546566671  expansion   0.361\n",
       "2   desires  9033676237817  9111777612067        war   0.365\n",
       "3   desires  9033676237817  9171875985828     wealth   0.393\n",
       "4   desires  9033676237817  7056154012146    science   0.393\n",
       "5   desires  4278076177891  2008795542230   industry   0.385\n",
       "6   desires  4278076177891  3832546566671  expansion   0.360\n",
       "7   desires  4278076177891  9111777612067        war   0.310\n",
       "8   desires  4278076177891  9171875985828     wealth   0.408\n",
       "9   desires  4278076177891  7056154012146    science   0.408\n",
       "10  desires  4469411309555  2008795542230   industry   0.383\n",
       "11  desires  4469411309555  3832546566671  expansion   0.326\n",
       "12  desires  4469411309555  9111777612067        war   0.317\n",
       "13  desires  4469411309555  9171875985828     wealth   0.431\n",
       "14  desires  4469411309555  7056154012146    science   0.431\n",
       "15  desires  3938789677933  2008795542230   industry   0.332\n",
       "16  desires  3938789677933  3832546566671  expansion   0.244\n",
       "17  desires  3938789677933  9111777612067        war   0.297\n",
       "18  desires  3938789677933  9171875985828     wealth   0.402\n",
       "19  desires  3938789677933  7056154012146    science   0.402\n",
       "20  desires  2894671138843  2008795542230   industry   0.365\n",
       "21  desires  2894671138843  3832546566671  expansion   0.248\n",
       "22  desires  2894671138843  9111777612067        war   0.131\n",
       "23  desires  2894671138843  9171875985828     wealth   0.451\n",
       "24  desires  2894671138843  7056154012146    science   0.451\n",
       "25  desires  5846343528467  2008795542230   industry   0.358\n",
       "26  desires  5846343528467  3832546566671  expansion   0.315\n",
       "27  desires  5846343528467  9111777612067        war   0.311\n",
       "28  desires  5846343528467  9171875985828     wealth   0.397\n",
       "29  desires  5846343528467  7056154012146    science   0.397\n",
       "30  desires  5405805965731  2008795542230   industry   0.386\n",
       "31  desires  5405805965731  3832546566671  expansion   0.378\n",
       "32  desires  5405805965731  9111777612067        war   0.358\n",
       "33  desires  5405805965731  9171875985828     wealth   0.393\n",
       "34  desires  5405805965731  7056154012146    science   0.393"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.DataFrame(edges)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\"g.V().has('objid','9033676237817').addE('desires').property('username','BillmanLocal2').property('weight',0.377).to(g.V().has('objid','2008795542230'))\""
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.create_edge(edges[0], local_user)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "I'm not actually going to upload the edge, as this function is in production"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [],
   "source": [
    "# db.upload_data({'nodes':[],'edges':edges},verbose=False)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Choosing based on the strongest desire\n",
    "\n",
    "Here is how you take one pop, and calculate what it desires. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>type</th>\n",
       "      <th>weight</th>\n",
       "      <th>leadingAttribute</th>\n",
       "      <th>comment</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>objid</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>industry</td>\n",
       "      <td>0.5</td>\n",
       "      <td>wealth</td>\n",
       "      <td>build factories, skyscrapers, infrastructure</td>\n",
       "      <td>notebook</td>\n",
       "      <td>objective</td>\n",
       "      <td>2008795542230</td>\n",
       "      <td>2008795542230</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>expansion</td>\n",
       "      <td>0.5</td>\n",
       "      <td>industry</td>\n",
       "      <td>to increase population, eventually becoming a ...</td>\n",
       "      <td>notebook</td>\n",
       "      <td>objective</td>\n",
       "      <td>3832546566671</td>\n",
       "      <td>3832546566671</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>war</td>\n",
       "      <td>0.4</td>\n",
       "      <td>aggression</td>\n",
       "      <td>the general amount that the society wants to f...</td>\n",
       "      <td>notebook</td>\n",
       "      <td>objective</td>\n",
       "      <td>9111777612067</td>\n",
       "      <td>9111777612067</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>wealth</td>\n",
       "      <td>0.5</td>\n",
       "      <td>literacy</td>\n",
       "      <td>increasing luxury, entertainiment and amenities</td>\n",
       "      <td>notebook</td>\n",
       "      <td>objective</td>\n",
       "      <td>9171875985828</td>\n",
       "      <td>9171875985828</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>science</td>\n",
       "      <td>0.5</td>\n",
       "      <td>literacy</td>\n",
       "      <td>building schools, education systems, informati...</td>\n",
       "      <td>notebook</td>\n",
       "      <td>objective</td>\n",
       "      <td>7056154012146</td>\n",
       "      <td>7056154012146</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        type weight leadingAttribute  \\\n",
       "0   industry    0.5           wealth   \n",
       "1  expansion    0.5         industry   \n",
       "2        war    0.4       aggression   \n",
       "3     wealth    0.5         literacy   \n",
       "4    science    0.5         literacy   \n",
       "\n",
       "                                             comment  username    objtype  \\\n",
       "0       build factories, skyscrapers, infrastructure  notebook  objective   \n",
       "1  to increase population, eventually becoming a ...  notebook  objective   \n",
       "2  the general amount that the society wants to f...  notebook  objective   \n",
       "3    increasing luxury, entertainiment and amenities  notebook  objective   \n",
       "4  building schools, education systems, informati...  notebook  objective   \n",
       "\n",
       "           objid             id  \n",
       "0  2008795542230  2008795542230  \n",
       "1  3832546566671  3832546566671  \n",
       "2  9111777612067  9111777612067  \n",
       "3  9171875985828  9171875985828  \n",
       "4  7056154012146  7056154012146  "
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def qtodf (query):\n",
    "    res = db.run_query(query)\n",
    "    nodes = [db.clean_node(n) for n in res]\n",
    "    return pd.DataFrame(nodes)\n",
    "\n",
    "query = \"g.V().hasLabel('objective').valueMap()\"\n",
    "qtodf(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>conformity</th>\n",
       "      <th>literacy</th>\n",
       "      <th>aggression</th>\n",
       "      <th>constitution</th>\n",
       "      <th>objid</th>\n",
       "      <th>faction_no</th>\n",
       "      <th>name</th>\n",
       "      <th>isInFaction</th>\n",
       "      <th>industry</th>\n",
       "      <th>wealth</th>\n",
       "      <th>faction_loyalty</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.408</td>\n",
       "      <td>0.797</td>\n",
       "      <td>0.727</td>\n",
       "      <td>0.220</td>\n",
       "      <td>1760394212974</td>\n",
       "      <td>0</td>\n",
       "      <td>Lano Ne</td>\n",
       "      <td>9823083597404</td>\n",
       "      <td>0.4735</td>\n",
       "      <td>0.6352</td>\n",
       "      <td>0.462</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>1760394212974</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0.235</td>\n",
       "      <td>0.621</td>\n",
       "      <td>0.313</td>\n",
       "      <td>0.399</td>\n",
       "      <td>8528199481524</td>\n",
       "      <td>1</td>\n",
       "      <td>Jupi Ra</td>\n",
       "      <td>8607803573370</td>\n",
       "      <td>0.3560</td>\n",
       "      <td>0.4885</td>\n",
       "      <td>0.608</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>8528199481524</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   conformity  literacy  aggression  constitution          objid  faction_no  \\\n",
       "0       0.408     0.797       0.727         0.220  1760394212974           0   \n",
       "1       0.235     0.621       0.313         0.399  8528199481524           1   \n",
       "\n",
       "      name    isInFaction  industry  wealth  faction_loyalty       username  \\\n",
       "0  Lano Ne  9823083597404    0.4735  0.6352            0.462  BillmanLocal2   \n",
       "1  Jupi Ra  8607803573370    0.3560  0.4885            0.608  BillmanLocal2   \n",
       "\n",
       "  objtype             id  \n",
       "0     pop  1760394212974  \n",
       "1     pop  8528199481524  "
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qtodf(f\"g.V().hasLabel('pop').has('username','{local_user}').limit(2).valueMap()\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Arbitrarily grabbing a pop id: `9033676237817`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "popid1 = \"1760394212974\"\n",
    "popid2 = \"8528199481524\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "ename": "KeyError",
     "evalue": "0",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mKeyError\u001b[0m                                  Traceback (most recent call last)",
      "\u001b[1;32mC:\\Users\\WILLIA~1.HAR\\AppData\\Local\\Temp/ipykernel_25796/436872043.py\u001b[0m in \u001b[0;36m<module>\u001b[1;34m\u001b[0m\n\u001b[1;32m----> 1\u001b[1;33m \u001b[0mqtodf\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;34mf\"g.V().has('objid','{popid1}').outE()\"\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m",
      "\u001b[1;32mC:\\Users\\WILLIA~1.HAR\\AppData\\Local\\Temp/ipykernel_25796/1511081853.py\u001b[0m in \u001b[0;36mqtodf\u001b[1;34m(query)\u001b[0m\n\u001b[0;32m      1\u001b[0m \u001b[1;32mdef\u001b[0m \u001b[0mqtodf\u001b[0m \u001b[1;33m(\u001b[0m\u001b[0mquery\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m      2\u001b[0m     \u001b[0mres\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mdb\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mrun_query\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mquery\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m----> 3\u001b[1;33m     \u001b[0mnodes\u001b[0m \u001b[1;33m=\u001b[0m \u001b[1;33m[\u001b[0m\u001b[0mdb\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mclean_node\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mn\u001b[0m\u001b[1;33m)\u001b[0m \u001b[1;32mfor\u001b[0m \u001b[0mn\u001b[0m \u001b[1;32min\u001b[0m \u001b[0mres\u001b[0m\u001b[1;33m]\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m      4\u001b[0m     \u001b[1;32mreturn\u001b[0m \u001b[0mpd\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mDataFrame\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mnodes\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m      5\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32mC:\\Users\\WILLIA~1.HAR\\AppData\\Local\\Temp/ipykernel_25796/1511081853.py\u001b[0m in \u001b[0;36m<listcomp>\u001b[1;34m(.0)\u001b[0m\n\u001b[0;32m      1\u001b[0m \u001b[1;32mdef\u001b[0m \u001b[0mqtodf\u001b[0m \u001b[1;33m(\u001b[0m\u001b[0mquery\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m      2\u001b[0m     \u001b[0mres\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mdb\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mrun_query\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mquery\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m----> 3\u001b[1;33m     \u001b[0mnodes\u001b[0m \u001b[1;33m=\u001b[0m \u001b[1;33m[\u001b[0m\u001b[0mdb\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mclean_node\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mn\u001b[0m\u001b[1;33m)\u001b[0m \u001b[1;32mfor\u001b[0m \u001b[0mn\u001b[0m \u001b[1;32min\u001b[0m \u001b[0mres\u001b[0m\u001b[1;33m]\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m      4\u001b[0m     \u001b[1;32mreturn\u001b[0m \u001b[0mpd\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mDataFrame\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mnodes\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m      5\u001b[0m \u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;32mc:\\Users\\william.harding\\Documents\\repos\\exoplanets\\notebooks\\helpers\\dbquery.py\u001b[0m in \u001b[0;36mclean_node\u001b[1;34m(x)\u001b[0m\n\u001b[0;32m     38\u001b[0m     \u001b[1;32mfor\u001b[0m \u001b[0mk\u001b[0m \u001b[1;32min\u001b[0m \u001b[0mlist\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mx\u001b[0m\u001b[1;33m.\u001b[0m\u001b[0mkeys\u001b[0m\u001b[1;33m(\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m)\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m     39\u001b[0m         \u001b[1;32mif\u001b[0m \u001b[0mlen\u001b[0m\u001b[1;33m(\u001b[0m\u001b[0mx\u001b[0m\u001b[1;33m[\u001b[0m\u001b[0mk\u001b[0m\u001b[1;33m]\u001b[0m\u001b[1;33m)\u001b[0m \u001b[1;33m==\u001b[0m \u001b[1;36m1\u001b[0m\u001b[1;33m:\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[1;32m---> 40\u001b[1;33m             \u001b[0mx\u001b[0m\u001b[1;33m[\u001b[0m\u001b[0mk\u001b[0m\u001b[1;33m]\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mx\u001b[0m\u001b[1;33m[\u001b[0m\u001b[0mk\u001b[0m\u001b[1;33m]\u001b[0m\u001b[1;33m[\u001b[0m\u001b[1;36m0\u001b[0m\u001b[1;33m]\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0m\u001b[0;32m     41\u001b[0m     \u001b[0mx\u001b[0m\u001b[1;33m[\u001b[0m\u001b[1;34m\"id\"\u001b[0m\u001b[1;33m]\u001b[0m \u001b[1;33m=\u001b[0m \u001b[0mx\u001b[0m\u001b[1;33m[\u001b[0m\u001b[1;34m\"objid\"\u001b[0m\u001b[1;33m]\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n\u001b[0;32m     42\u001b[0m     \u001b[1;32mreturn\u001b[0m \u001b[0mx\u001b[0m\u001b[1;33m\u001b[0m\u001b[0m\n",
      "\u001b[1;31mKeyError\u001b[0m: 0"
     ]
    }
   ],
   "source": [
    "qtodf(f\"g.V().has('objid','{popid1}').outE()\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>type</th>\n",
       "      <th>weight</th>\n",
       "      <th>leadingAttribute</th>\n",
       "      <th>comment</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>objid</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>expansion</td>\n",
       "      <td>0.5</td>\n",
       "      <td>industry</td>\n",
       "      <td>to increase population, eventually becoming a ...</td>\n",
       "      <td>notebook</td>\n",
       "      <td>objective</td>\n",
       "      <td>3832546566671</td>\n",
       "      <td>3832546566671</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>industry</td>\n",
       "      <td>0.5</td>\n",
       "      <td>wealth</td>\n",
       "      <td>build factories, skyscrapers, infrastructure</td>\n",
       "      <td>notebook</td>\n",
       "      <td>objective</td>\n",
       "      <td>2008795542230</td>\n",
       "      <td>2008795542230</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>science</td>\n",
       "      <td>0.5</td>\n",
       "      <td>literacy</td>\n",
       "      <td>building schools, education systems, informati...</td>\n",
       "      <td>notebook</td>\n",
       "      <td>objective</td>\n",
       "      <td>7056154012146</td>\n",
       "      <td>7056154012146</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>wealth</td>\n",
       "      <td>0.5</td>\n",
       "      <td>literacy</td>\n",
       "      <td>increasing luxury, entertainiment and amenities</td>\n",
       "      <td>notebook</td>\n",
       "      <td>objective</td>\n",
       "      <td>9171875985828</td>\n",
       "      <td>9171875985828</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>war</td>\n",
       "      <td>0.4</td>\n",
       "      <td>aggression</td>\n",
       "      <td>the general amount that the society wants to f...</td>\n",
       "      <td>notebook</td>\n",
       "      <td>objective</td>\n",
       "      <td>9111777612067</td>\n",
       "      <td>9111777612067</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        type weight leadingAttribute  \\\n",
       "0  expansion    0.5         industry   \n",
       "1   industry    0.5           wealth   \n",
       "2    science    0.5         literacy   \n",
       "3     wealth    0.5         literacy   \n",
       "4        war    0.4       aggression   \n",
       "\n",
       "                                             comment  username    objtype  \\\n",
       "0  to increase population, eventually becoming a ...  notebook  objective   \n",
       "1       build factories, skyscrapers, infrastructure  notebook  objective   \n",
       "2  building schools, education systems, informati...  notebook  objective   \n",
       "3    increasing luxury, entertainiment and amenities  notebook  objective   \n",
       "4  the general amount that the society wants to f...  notebook  objective   \n",
       "\n",
       "           objid             id  \n",
       "0  3832546566671  3832546566671  \n",
       "1  2008795542230  2008795542230  \n",
       "2  7056154012146  7056154012146  \n",
       "3  9171875985828  9171875985828  \n",
       "4  9111777612067  9111777612067  "
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "qtodf(f\"g.V().has('objid','{popid2}').out('desires').valueMap()\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\"g.V().has('objid','9033676237817').addE('desires').property('username','BillmanLocal2').property('weight',0.361).to(g.V().has('objid','3832546566671'))\""
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.create_edge(edges[1], local_user)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'label': 'desires',\n",
       " 'node1': '9033676237817',\n",
       " 'node2': '3832546566671',\n",
       " 'weight': 0.361}"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "edges[1]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "interpreter": {
   "hash": "963f8bc8d1837394f85b1a87cb03282203007ac74b0df2c49e442752684865e9"
  },
  "kernelspec": {
   "display_name": "Python 3.7.0 64-bit ('exoplanets': conda)",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.0"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
