{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# How People Decide what they want to do\n",
    "Directed graph approach\n",
    "\n",
    "Generally people want to do a number of different things. For this I'm going to create a schema for this in a graph language that allows me to designate how much a `pop` desires to take a certain action. This will be used later when determining AI decisions. \n",
    "Note that this does not reflect on the player's actions. These are the automated actions of people. For example: a people that desire war, and aren't loayl to a faction may rebel. \n",
    "\n",
    "**Note** this notebook actualy builds the desires into the graph, overwriting existing ontology. Nodes that do this are commented out.\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys\n",
    "import numpy as np\n",
    "import pandas as pd\n",
    "import altair as alt\n",
    "sys.path.append('..')\n",
    "import helpers.dbquery as db\n",
    "import helpers.functions as f\n",
    "import yaml, ssl, asyncio\n",
    "import nb_black\n",
    "\n",
    "ssl._create_default_https_context = ssl._create_unverified_context\n",
    "asyncio.set_event_loop_policy(asyncio.WindowsSelectorEventLoopPolicy())\n",
    "import nest_asyncio\n",
    "# this is required for running in a Jupyter Notebook. \n",
    "nest_asyncio.apply()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'conformity': 0.306,\n",
       " 'literacy': 0.925,\n",
       " 'aggression': 0.502,\n",
       " 'constitution': 0.401,\n",
       " 'objid': '5720114744401',\n",
       " 'faction_no': 2,\n",
       " 'name': 'Bachna Ca',\n",
       " 'isInFaction': '1987887122089',\n",
       " 'industry': 0.4515,\n",
       " 'wealth': 0.6882,\n",
       " 'faction_loyalty': 0.4665,\n",
       " 'username': 'BillmanLocal2',\n",
       " 'objtype': 'pop',\n",
       " 'id': '5720114744401'}"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "local_user = \"BillmanLocal2\"\n",
    "res = db.run_query(f\"g.V().hasLabel('pop').has('username','{local_user}').valueMap()\")\n",
    "pops = [db.clean_node(n) for n in res]\n",
    "pops[0]"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Each population wants to do everything to a degree, the amount of desire to do that thing is expressed by the edge weight. \n",
    "* Attack a population\n",
    "* Focus on improving literacy\n",
    "* Focus on improving industry"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Desires as Objects\n",
    "\n",
    "## Desire with targets.\n",
    "Both factions and pops can have desire. Action is guided by desire based on the `max(desire.weight)`.\n",
    "`desire` is an edge, the type of that desire is a property of that edge, and the edge weight is the amount of desire. The target (`node2`) is the recipient. \n",
    "\n",
    "Examples:\n",
    "* faction wants trade with faction\n",
    "* pop wants war with another pop\n",
    "* pop wants faction to go to war with faction\n",
    "\n",
    "## Desire without targets.\n",
    "\n",
    "Desires without targets must link to an objective. That objective can be it's own node.\n",
    "\n",
    "### This next cell will upload new desires from `desires.yaml`, which can be edited at any time. \n",
    "\n",
    "desires.yaml can be used to configure how people act as a default. This can be helpful in adjusting the default settings in your universe. \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>type</th>\n",
       "      <th>weight</th>\n",
       "      <th>leadingAttribute</th>\n",
       "      <th>comment</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>objid</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>industry</td>\n",
       "      <td>0.5</td>\n",
       "      <td>wealth</td>\n",
       "      <td>build factories, skyscrapers, infrastructure</td>\n",
       "      <td>notebook</td>\n",
       "      <td>objective</td>\n",
       "      <td>2008795542230</td>\n",
       "      <td>2008795542230</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>expansion</td>\n",
       "      <td>0.5</td>\n",
       "      <td>industry</td>\n",
       "      <td>to increase population, eventually becoming a ...</td>\n",
       "      <td>notebook</td>\n",
       "      <td>objective</td>\n",
       "      <td>3832546566671</td>\n",
       "      <td>3832546566671</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>war</td>\n",
       "      <td>0.4</td>\n",
       "      <td>aggression</td>\n",
       "      <td>the general amount that the society wants to f...</td>\n",
       "      <td>notebook</td>\n",
       "      <td>objective</td>\n",
       "      <td>9111777612067</td>\n",
       "      <td>9111777612067</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>wealth</td>\n",
       "      <td>0.5</td>\n",
       "      <td>literacy</td>\n",
       "      <td>increasing luxury, entertainiment and amenities</td>\n",
       "      <td>notebook</td>\n",
       "      <td>objective</td>\n",
       "      <td>9171875985828</td>\n",
       "      <td>9171875985828</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>science</td>\n",
       "      <td>0.5</td>\n",
       "      <td>literacy</td>\n",
       "      <td>building schools, education systems, informati...</td>\n",
       "      <td>notebook</td>\n",
       "      <td>objective</td>\n",
       "      <td>7056154012146</td>\n",
       "      <td>7056154012146</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        type weight leadingAttribute  \\\n",
       "0   industry    0.5           wealth   \n",
       "1  expansion    0.5         industry   \n",
       "2        war    0.4       aggression   \n",
       "3     wealth    0.5         literacy   \n",
       "4    science    0.5         literacy   \n",
       "\n",
       "                                             comment  username    objtype  \\\n",
       "0       build factories, skyscrapers, infrastructure  notebook  objective   \n",
       "1  to increase population, eventually becoming a ...  notebook  objective   \n",
       "2  the general amount that the society wants to f...  notebook  objective   \n",
       "3    increasing luxury, entertainiment and amenities  notebook  objective   \n",
       "4  building schools, education systems, informati...  notebook  objective   \n",
       "\n",
       "           objid             id  \n",
       "0  2008795542230  2008795542230  \n",
       "1  3832546566671  3832546566671  \n",
       "2  9111777612067  9111777612067  \n",
       "3  9171875985828  9171875985828  \n",
       "4  7056154012146  7056154012146  "
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# # Drop the items, if they exist. \n",
    "# db.run_query(\"g.V().hasLabel('objective').has('username','notebook').drop()\")\n",
    "# objectives_yaml = yaml.safe_load(open(\"desires.yaml\"))['objectives']\n",
    "# data = {\"nodes\":objectives_yaml,'edges':[]}\n",
    "# # Then Create the nodes and add them to the DB\n",
    "# db.upload_data(data,verbose=False)\n",
    "# After creating the nodes, pulling them into the notebook for reference\n",
    "# I won't re-create them here, unless I've updated the file. \n",
    "res = db.run_query(\"g.V().hasLabel('objective').valueMap()\")\n",
    "objectives = [db.clean_node(n) for n in res]\n",
    "pd.DataFrame(objectives)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# population wants to improve industry\n",
    "\n",
    "populations want to improve industry when:\n",
    "* they are not wealty\n",
    "* they are at war\n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "<div id=\"altair-viz-c9f6b6b82caa410d8aa75b3ecca94770\"></div>\n",
       "<script type=\"text/javascript\">\n",
       "  (function(spec, embedOpt){\n",
       "    let outputDiv = document.currentScript.previousElementSibling;\n",
       "    if (outputDiv.id !== \"altair-viz-c9f6b6b82caa410d8aa75b3ecca94770\") {\n",
       "      outputDiv = document.getElementById(\"altair-viz-c9f6b6b82caa410d8aa75b3ecca94770\");\n",
       "    }\n",
       "    const paths = {\n",
       "      \"vega\": \"https://cdn.jsdelivr.net/npm//vega@5?noext\",\n",
       "      \"vega-lib\": \"https://cdn.jsdelivr.net/npm//vega-lib?noext\",\n",
       "      \"vega-lite\": \"https://cdn.jsdelivr.net/npm//vega-lite@4.8.1?noext\",\n",
       "      \"vega-embed\": \"https://cdn.jsdelivr.net/npm//vega-embed@6?noext\",\n",
       "    };\n",
       "\n",
       "    function loadScript(lib) {\n",
       "      return new Promise(function(resolve, reject) {\n",
       "        var s = document.createElement('script');\n",
       "        s.src = paths[lib];\n",
       "        s.async = true;\n",
       "        s.onload = () => resolve(paths[lib]);\n",
       "        s.onerror = () => reject(`Error loading script: ${paths[lib]}`);\n",
       "        document.getElementsByTagName(\"head\")[0].appendChild(s);\n",
       "      });\n",
       "    }\n",
       "\n",
       "    function showError(err) {\n",
       "      outputDiv.innerHTML = `<div class=\"error\" style=\"color:red;\">${err}</div>`;\n",
       "      throw err;\n",
       "    }\n",
       "\n",
       "    function displayChart(vegaEmbed) {\n",
       "      vegaEmbed(outputDiv, spec, embedOpt)\n",
       "        .catch(err => showError(`Javascript Error: ${err.message}<br>This usually means there's a typo in your chart specification. See the javascript console for the full traceback.`));\n",
       "    }\n",
       "\n",
       "    if(typeof define === \"function\" && define.amd) {\n",
       "      requirejs.config({paths});\n",
       "      require([\"vega-embed\"], displayChart, err => showError(`Error loading script: ${err.message}`));\n",
       "    } else if (typeof vegaEmbed === \"function\") {\n",
       "      displayChart(vegaEmbed);\n",
       "    } else {\n",
       "      loadScript(\"vega\")\n",
       "        .then(() => loadScript(\"vega-lite\"))\n",
       "        .then(() => loadScript(\"vega-embed\"))\n",
       "        .catch(showError)\n",
       "        .then(() => displayChart(vegaEmbed));\n",
       "    }\n",
       "  })({\"config\": {\"view\": {\"continuousWidth\": 400, \"continuousHeight\": 300}}, \"data\": {\"name\": \"data-f566b3f80cf1d935435b4a6b05930773\"}, \"mark\": \"line\", \"encoding\": {\"x\": {\"type\": \"quantitative\", \"field\": \"base\"}, \"y\": {\"type\": \"quantitative\", \"field\": \"desire_base\"}}, \"title\": \"Desire relative to the base attribute\", \"$schema\": \"https://vega.github.io/schema/vega-lite/v4.8.1.json\", \"datasets\": {\"data-f566b3f80cf1d935435b4a6b05930773\": [{\"wealth\": 0.445, \"base\": 0, \"desires_industry\": 0.3079584775086506, \"desire_base\": -0.0}, {\"wealth\": 0.4628, \"base\": 1, \"desires_industry\": 0.3163795460760186, \"desire_base\": 0.5}, {\"wealth\": 0.546, \"base\": 2, \"desires_industry\": 0.3531694695989651, \"desire_base\": 0.6666666666666667}, {\"wealth\": 0.5988, \"base\": 3, \"desires_industry\": 0.37453089817363017, \"desire_base\": 0.75}, {\"wealth\": 0.659, \"base\": 4, \"desires_industry\": 0.39722724532851117, \"desire_base\": 0.8}, {\"wealth\": 0.6622, \"base\": 5, \"desires_industry\": 0.3983876789796654, \"desire_base\": 0.8333333333333334}, {\"wealth\": 0.6882, \"base\": 6, \"desires_industry\": 0.4076531216680489, \"desire_base\": 0.8571428571428572}]}}, {\"mode\": \"vega-lite\"});\n",
       "</script>"
      ],
      "text/plain": [
       "alt.Chart(...)"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Marginal return on base attribute\n",
    "n = 2\n",
    "ind_df = pd.DataFrame(np.sort([float(p['wealth']) for p in pops]),columns=['wealth'])\n",
    "ind_df['base'] = range(len(ind_df))\n",
    "ind_df['desires_industry'] = ind_df['wealth'].apply(lambda x: ((x+1)**(1-n) - 1)/(1-n))\n",
    "ind_df['desire_base'] = ind_df['base'].apply(lambda x: ((x+1)**(1-n) - 1)/(1-n))\n",
    "alt.Chart(ind_df).mark_line().encode(x='base',y='desire_base').properties(title=\"Desire relative to the base attribute\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "\n",
       "<div id=\"altair-viz-8a93860141d041edbac0731aa76342ba\"></div>\n",
       "<script type=\"text/javascript\">\n",
       "  (function(spec, embedOpt){\n",
       "    let outputDiv = document.currentScript.previousElementSibling;\n",
       "    if (outputDiv.id !== \"altair-viz-8a93860141d041edbac0731aa76342ba\") {\n",
       "      outputDiv = document.getElementById(\"altair-viz-8a93860141d041edbac0731aa76342ba\");\n",
       "    }\n",
       "    const paths = {\n",
       "      \"vega\": \"https://cdn.jsdelivr.net/npm//vega@5?noext\",\n",
       "      \"vega-lib\": \"https://cdn.jsdelivr.net/npm//vega-lib?noext\",\n",
       "      \"vega-lite\": \"https://cdn.jsdelivr.net/npm//vega-lite@4.8.1?noext\",\n",
       "      \"vega-embed\": \"https://cdn.jsdelivr.net/npm//vega-embed@6?noext\",\n",
       "    };\n",
       "\n",
       "    function loadScript(lib) {\n",
       "      return new Promise(function(resolve, reject) {\n",
       "        var s = document.createElement('script');\n",
       "        s.src = paths[lib];\n",
       "        s.async = true;\n",
       "        s.onload = () => resolve(paths[lib]);\n",
       "        s.onerror = () => reject(`Error loading script: ${paths[lib]}`);\n",
       "        document.getElementsByTagName(\"head\")[0].appendChild(s);\n",
       "      });\n",
       "    }\n",
       "\n",
       "    function showError(err) {\n",
       "      outputDiv.innerHTML = `<div class=\"error\" style=\"color:red;\">${err}</div>`;\n",
       "      throw err;\n",
       "    }\n",
       "\n",
       "    function displayChart(vegaEmbed) {\n",
       "      vegaEmbed(outputDiv, spec, embedOpt)\n",
       "        .catch(err => showError(`Javascript Error: ${err.message}<br>This usually means there's a typo in your chart specification. See the javascript console for the full traceback.`));\n",
       "    }\n",
       "\n",
       "    if(typeof define === \"function\" && define.amd) {\n",
       "      requirejs.config({paths});\n",
       "      require([\"vega-embed\"], displayChart, err => showError(`Error loading script: ${err.message}`));\n",
       "    } else if (typeof vegaEmbed === \"function\") {\n",
       "      displayChart(vegaEmbed);\n",
       "    } else {\n",
       "      loadScript(\"vega\")\n",
       "        .then(() => loadScript(\"vega-lite\"))\n",
       "        .then(() => loadScript(\"vega-embed\"))\n",
       "        .catch(showError)\n",
       "        .then(() => displayChart(vegaEmbed));\n",
       "    }\n",
       "  })({\"config\": {\"view\": {\"continuousWidth\": 400, \"continuousHeight\": 300}}, \"data\": {\"name\": \"data-f566b3f80cf1d935435b4a6b05930773\"}, \"mark\": \"line\", \"encoding\": {\"x\": {\"type\": \"nominal\", \"field\": \"wealth\"}, \"y\": {\"type\": \"quantitative\", \"field\": \"desires_industry\"}}, \"title\": \"Desires wealth industry relative to industry\", \"$schema\": \"https://vega.github.io/schema/vega-lite/v4.8.1.json\", \"datasets\": {\"data-f566b3f80cf1d935435b4a6b05930773\": [{\"wealth\": 0.445, \"base\": 0, \"desires_industry\": 0.3079584775086506, \"desire_base\": -0.0}, {\"wealth\": 0.4628, \"base\": 1, \"desires_industry\": 0.3163795460760186, \"desire_base\": 0.5}, {\"wealth\": 0.546, \"base\": 2, \"desires_industry\": 0.3531694695989651, \"desire_base\": 0.6666666666666667}, {\"wealth\": 0.5988, \"base\": 3, \"desires_industry\": 0.37453089817363017, \"desire_base\": 0.75}, {\"wealth\": 0.659, \"base\": 4, \"desires_industry\": 0.39722724532851117, \"desire_base\": 0.8}, {\"wealth\": 0.6622, \"base\": 5, \"desires_industry\": 0.3983876789796654, \"desire_base\": 0.8333333333333334}, {\"wealth\": 0.6882, \"base\": 6, \"desires_industry\": 0.4076531216680489, \"desire_base\": 0.8571428571428572}]}}, {\"mode\": \"vega-lite\"});\n",
       "</script>"
      ],
      "text/plain": [
       "alt.Chart(...)"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "alt.Chart(ind_df).mark_line().encode(x='wealth:N',y='desires_industry').properties(title=\"Desires wealth industry relative to industry\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## feeding that desire to the populations\n",
    "\n",
    "Per above, the initial desire to do a thing is dependant on the `leading attribute`. This makes it easy to adjust the population desires in the `desires.yaml`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'conformity': 0.306, 'literacy': 0.925, 'aggression': 0.502, 'constitution': 0.401, 'objid': '5720114744401', 'faction_no': 2, 'name': 'Bachna Ca', 'isInFaction': '1987887122089', 'industry': 0.4515, 'wealth': 0.6882, 'faction_loyalty': 0.4665, 'username': 'BillmanLocal2', 'objtype': 'pop', 'id': '5720114744401'}\n",
      "{'type': 'industry', 'weight': '0.5', 'leadingAttribute': 'wealth', 'comment': 'build factories, skyscrapers, infrastructure', 'username': 'notebook', 'objtype': 'objective', 'objid': '2008795542230', 'id': '2008795542230'}\n"
     ]
    }
   ],
   "source": [
    "def get_desire(x):\n",
    "       return np.round(((float(x)+1)**(1-n) - 1)/(1-n),3)\n",
    "\n",
    "popno = 0\n",
    "objectiveno = 0\n",
    "\n",
    "print(pops[popno])\n",
    "print(objectives[objectiveno])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.408"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "get_desire(pops[popno][objectives[objectiveno]['leadingAttribute']])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Create a desire edge for each desire, for each population."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [],
   "source": [
    "edges = []\n",
    "for p in pops:\n",
    "    for o in objectives:\n",
    "        edge = {'label':'desires',\n",
    "                'node1':p['objid'],\n",
    "                'node2':o['objid'],\n",
    "                'desire':o['type'],\n",
    "                'weight':get_desire(p[o['leadingAttribute']])}\n",
    "        edges.append(edge)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'type': 'science',\n",
       " 'weight': '0.5',\n",
       " 'leadingAttribute': 'literacy',\n",
       " 'comment': 'building schools, education systems, information infrastructure',\n",
       " 'username': 'notebook',\n",
       " 'objtype': 'objective',\n",
       " 'objid': '7056154012146',\n",
       " 'id': '7056154012146'}"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "o"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>label</th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>desire</th>\n",
       "      <th>weight</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>desires</td>\n",
       "      <td>5720114744401</td>\n",
       "      <td>2008795542230</td>\n",
       "      <td>industry</td>\n",
       "      <td>0.408</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>desires</td>\n",
       "      <td>5720114744401</td>\n",
       "      <td>3832546566671</td>\n",
       "      <td>expansion</td>\n",
       "      <td>0.311</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>desires</td>\n",
       "      <td>5720114744401</td>\n",
       "      <td>9111777612067</td>\n",
       "      <td>war</td>\n",
       "      <td>0.334</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>desires</td>\n",
       "      <td>5720114744401</td>\n",
       "      <td>9171875985828</td>\n",
       "      <td>wealth</td>\n",
       "      <td>0.481</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>desires</td>\n",
       "      <td>5720114744401</td>\n",
       "      <td>7056154012146</td>\n",
       "      <td>science</td>\n",
       "      <td>0.481</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>desires</td>\n",
       "      <td>1590902300324</td>\n",
       "      <td>2008795542230</td>\n",
       "      <td>industry</td>\n",
       "      <td>0.398</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>desires</td>\n",
       "      <td>1590902300324</td>\n",
       "      <td>3832546566671</td>\n",
       "      <td>expansion</td>\n",
       "      <td>0.281</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>desires</td>\n",
       "      <td>1590902300324</td>\n",
       "      <td>9111777612067</td>\n",
       "      <td>war</td>\n",
       "      <td>0.195</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>desires</td>\n",
       "      <td>1590902300324</td>\n",
       "      <td>9171875985828</td>\n",
       "      <td>wealth</td>\n",
       "      <td>0.483</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>desires</td>\n",
       "      <td>1590902300324</td>\n",
       "      <td>7056154012146</td>\n",
       "      <td>science</td>\n",
       "      <td>0.483</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>desires</td>\n",
       "      <td>8967307335063</td>\n",
       "      <td>2008795542230</td>\n",
       "      <td>industry</td>\n",
       "      <td>0.316</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>desires</td>\n",
       "      <td>8967307335063</td>\n",
       "      <td>3832546566671</td>\n",
       "      <td>expansion</td>\n",
       "      <td>0.278</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>desires</td>\n",
       "      <td>8967307335063</td>\n",
       "      <td>9111777612067</td>\n",
       "      <td>war</td>\n",
       "      <td>0.307</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>desires</td>\n",
       "      <td>8967307335063</td>\n",
       "      <td>9171875985828</td>\n",
       "      <td>wealth</td>\n",
       "      <td>0.351</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>desires</td>\n",
       "      <td>8967307335063</td>\n",
       "      <td>7056154012146</td>\n",
       "      <td>science</td>\n",
       "      <td>0.351</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>desires</td>\n",
       "      <td>0001454629677</td>\n",
       "      <td>2008795542230</td>\n",
       "      <td>industry</td>\n",
       "      <td>0.308</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>desires</td>\n",
       "      <td>0001454629677</td>\n",
       "      <td>3832546566671</td>\n",
       "      <td>expansion</td>\n",
       "      <td>0.226</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>desires</td>\n",
       "      <td>0001454629677</td>\n",
       "      <td>9111777612067</td>\n",
       "      <td>war</td>\n",
       "      <td>0.136</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>desires</td>\n",
       "      <td>0001454629677</td>\n",
       "      <td>9171875985828</td>\n",
       "      <td>wealth</td>\n",
       "      <td>0.374</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>desires</td>\n",
       "      <td>0001454629677</td>\n",
       "      <td>7056154012146</td>\n",
       "      <td>science</td>\n",
       "      <td>0.374</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>desires</td>\n",
       "      <td>6912708857252</td>\n",
       "      <td>2008795542230</td>\n",
       "      <td>industry</td>\n",
       "      <td>0.353</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>desires</td>\n",
       "      <td>6912708857252</td>\n",
       "      <td>3832546566671</td>\n",
       "      <td>expansion</td>\n",
       "      <td>0.265</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>desires</td>\n",
       "      <td>6912708857252</td>\n",
       "      <td>9111777612067</td>\n",
       "      <td>war</td>\n",
       "      <td>0.241</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>desires</td>\n",
       "      <td>6912708857252</td>\n",
       "      <td>9171875985828</td>\n",
       "      <td>wealth</td>\n",
       "      <td>0.423</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>desires</td>\n",
       "      <td>6912708857252</td>\n",
       "      <td>7056154012146</td>\n",
       "      <td>science</td>\n",
       "      <td>0.423</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>desires</td>\n",
       "      <td>4164769728476</td>\n",
       "      <td>2008795542230</td>\n",
       "      <td>industry</td>\n",
       "      <td>0.375</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>desires</td>\n",
       "      <td>4164769728476</td>\n",
       "      <td>3832546566671</td>\n",
       "      <td>expansion</td>\n",
       "      <td>0.364</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>desires</td>\n",
       "      <td>4164769728476</td>\n",
       "      <td>9111777612067</td>\n",
       "      <td>war</td>\n",
       "      <td>0.357</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>desires</td>\n",
       "      <td>4164769728476</td>\n",
       "      <td>9171875985828</td>\n",
       "      <td>wealth</td>\n",
       "      <td>0.384</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>desires</td>\n",
       "      <td>4164769728476</td>\n",
       "      <td>7056154012146</td>\n",
       "      <td>science</td>\n",
       "      <td>0.384</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>desires</td>\n",
       "      <td>6961917825017</td>\n",
       "      <td>2008795542230</td>\n",
       "      <td>industry</td>\n",
       "      <td>0.397</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>desires</td>\n",
       "      <td>6961917825017</td>\n",
       "      <td>3832546566671</td>\n",
       "      <td>expansion</td>\n",
       "      <td>0.409</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>desires</td>\n",
       "      <td>6961917825017</td>\n",
       "      <td>9111777612067</td>\n",
       "      <td>war</td>\n",
       "      <td>0.440</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>desires</td>\n",
       "      <td>6961917825017</td>\n",
       "      <td>9171875985828</td>\n",
       "      <td>wealth</td>\n",
       "      <td>0.385</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>desires</td>\n",
       "      <td>6961917825017</td>\n",
       "      <td>7056154012146</td>\n",
       "      <td>science</td>\n",
       "      <td>0.385</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      label          node1          node2     desire  weight\n",
       "0   desires  5720114744401  2008795542230   industry   0.408\n",
       "1   desires  5720114744401  3832546566671  expansion   0.311\n",
       "2   desires  5720114744401  9111777612067        war   0.334\n",
       "3   desires  5720114744401  9171875985828     wealth   0.481\n",
       "4   desires  5720114744401  7056154012146    science   0.481\n",
       "5   desires  1590902300324  2008795542230   industry   0.398\n",
       "6   desires  1590902300324  3832546566671  expansion   0.281\n",
       "7   desires  1590902300324  9111777612067        war   0.195\n",
       "8   desires  1590902300324  9171875985828     wealth   0.483\n",
       "9   desires  1590902300324  7056154012146    science   0.483\n",
       "10  desires  8967307335063  2008795542230   industry   0.316\n",
       "11  desires  8967307335063  3832546566671  expansion   0.278\n",
       "12  desires  8967307335063  9111777612067        war   0.307\n",
       "13  desires  8967307335063  9171875985828     wealth   0.351\n",
       "14  desires  8967307335063  7056154012146    science   0.351\n",
       "15  desires  0001454629677  2008795542230   industry   0.308\n",
       "16  desires  0001454629677  3832546566671  expansion   0.226\n",
       "17  desires  0001454629677  9111777612067        war   0.136\n",
       "18  desires  0001454629677  9171875985828     wealth   0.374\n",
       "19  desires  0001454629677  7056154012146    science   0.374\n",
       "20  desires  6912708857252  2008795542230   industry   0.353\n",
       "21  desires  6912708857252  3832546566671  expansion   0.265\n",
       "22  desires  6912708857252  9111777612067        war   0.241\n",
       "23  desires  6912708857252  9171875985828     wealth   0.423\n",
       "24  desires  6912708857252  7056154012146    science   0.423\n",
       "25  desires  4164769728476  2008795542230   industry   0.375\n",
       "26  desires  4164769728476  3832546566671  expansion   0.364\n",
       "27  desires  4164769728476  9111777612067        war   0.357\n",
       "28  desires  4164769728476  9171875985828     wealth   0.384\n",
       "29  desires  4164769728476  7056154012146    science   0.384\n",
       "30  desires  6961917825017  2008795542230   industry   0.397\n",
       "31  desires  6961917825017  3832546566671  expansion   0.409\n",
       "32  desires  6961917825017  9111777612067        war   0.440\n",
       "33  desires  6961917825017  9171875985828     wealth   0.385\n",
       "34  desires  6961917825017  7056154012146    science   0.385"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.DataFrame(edges)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\"g.V().has('objid','5720114744401').addE('desires').property('username','BillmanLocal2').property('desire','industry').property('weight',0.408).to(g.V().has('objid','2008795542230'))\""
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.create_edge(edges[0], local_user)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "I'm not actually going to upload the edge, as this function is in production"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [],
   "source": [
    "# db.upload_data({'nodes':[],'edges':edges},verbose=False)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Choosing based on the strongest desire\n",
    "\n",
    "Here is how you take one pop, and calculate what it desires. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>type</th>\n",
       "      <th>weight</th>\n",
       "      <th>leadingAttribute</th>\n",
       "      <th>comment</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>objid</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>industry</td>\n",
       "      <td>0.5</td>\n",
       "      <td>wealth</td>\n",
       "      <td>build factories, skyscrapers, infrastructure</td>\n",
       "      <td>notebook</td>\n",
       "      <td>objective</td>\n",
       "      <td>2008795542230</td>\n",
       "      <td>2008795542230</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>expansion</td>\n",
       "      <td>0.5</td>\n",
       "      <td>industry</td>\n",
       "      <td>to increase population, eventually becoming a ...</td>\n",
       "      <td>notebook</td>\n",
       "      <td>objective</td>\n",
       "      <td>3832546566671</td>\n",
       "      <td>3832546566671</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>war</td>\n",
       "      <td>0.4</td>\n",
       "      <td>aggression</td>\n",
       "      <td>the general amount that the society wants to f...</td>\n",
       "      <td>notebook</td>\n",
       "      <td>objective</td>\n",
       "      <td>9111777612067</td>\n",
       "      <td>9111777612067</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>wealth</td>\n",
       "      <td>0.5</td>\n",
       "      <td>literacy</td>\n",
       "      <td>increasing luxury, entertainiment and amenities</td>\n",
       "      <td>notebook</td>\n",
       "      <td>objective</td>\n",
       "      <td>9171875985828</td>\n",
       "      <td>9171875985828</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>science</td>\n",
       "      <td>0.5</td>\n",
       "      <td>literacy</td>\n",
       "      <td>building schools, education systems, informati...</td>\n",
       "      <td>notebook</td>\n",
       "      <td>objective</td>\n",
       "      <td>7056154012146</td>\n",
       "      <td>7056154012146</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        type weight leadingAttribute  \\\n",
       "0   industry    0.5           wealth   \n",
       "1  expansion    0.5         industry   \n",
       "2        war    0.4       aggression   \n",
       "3     wealth    0.5         literacy   \n",
       "4    science    0.5         literacy   \n",
       "\n",
       "                                             comment  username    objtype  \\\n",
       "0       build factories, skyscrapers, infrastructure  notebook  objective   \n",
       "1  to increase population, eventually becoming a ...  notebook  objective   \n",
       "2  the general amount that the society wants to f...  notebook  objective   \n",
       "3    increasing luxury, entertainiment and amenities  notebook  objective   \n",
       "4  building schools, education systems, informati...  notebook  objective   \n",
       "\n",
       "           objid             id  \n",
       "0  2008795542230  2008795542230  \n",
       "1  3832546566671  3832546566671  \n",
       "2  9111777612067  9111777612067  \n",
       "3  9171875985828  9171875985828  \n",
       "4  7056154012146  7056154012146  "
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query = \"g.V().hasLabel('objective').valueMap()\"\n",
    "db.qtodf(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>conformity</th>\n",
       "      <th>literacy</th>\n",
       "      <th>aggression</th>\n",
       "      <th>constitution</th>\n",
       "      <th>objid</th>\n",
       "      <th>faction_no</th>\n",
       "      <th>name</th>\n",
       "      <th>isInFaction</th>\n",
       "      <th>industry</th>\n",
       "      <th>wealth</th>\n",
       "      <th>faction_loyalty</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.306</td>\n",
       "      <td>0.925</td>\n",
       "      <td>0.502</td>\n",
       "      <td>0.401</td>\n",
       "      <td>5720114744401</td>\n",
       "      <td>2</td>\n",
       "      <td>Bachna Ca</td>\n",
       "      <td>1987887122089</td>\n",
       "      <td>0.4515</td>\n",
       "      <td>0.6882</td>\n",
       "      <td>0.4665</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>5720114744401</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0.442</td>\n",
       "      <td>0.933</td>\n",
       "      <td>0.242</td>\n",
       "      <td>0.541</td>\n",
       "      <td>1590902300324</td>\n",
       "      <td>1</td>\n",
       "      <td>Unty De</td>\n",
       "      <td>2476940103283</td>\n",
       "      <td>0.3915</td>\n",
       "      <td>0.6622</td>\n",
       "      <td>0.4605</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>1590902300324</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   conformity  literacy  aggression  constitution          objid  faction_no  \\\n",
       "0       0.306     0.925       0.502         0.401  5720114744401           2   \n",
       "1       0.442     0.933       0.242         0.541  1590902300324           1   \n",
       "\n",
       "        name    isInFaction  industry  wealth  faction_loyalty       username  \\\n",
       "0  Bachna Ca  1987887122089    0.4515  0.6882           0.4665  BillmanLocal2   \n",
       "1    Unty De  2476940103283    0.3915  0.6622           0.4605  BillmanLocal2   \n",
       "\n",
       "  objtype             id  \n",
       "0     pop  5720114744401  \n",
       "1     pop  1590902300324  "
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "db.qtodf(f\"g.V().hasLabel('pop').has('username','{local_user}').limit(2).valueMap()\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Arbitrarily grabbing a pop id: `9033676237817`"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "popid1 = \"5720114744401\"\n",
    "popid2 = \"1590902300324\""
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "I'll likely revisit this query, but it moves the project along for now. This returns the desire for each objective. This can be expanded as it grows. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'labels': [[], [], []], 'objects': ['Bachna Ca', 0.334, 'war']},\n",
       " {'labels': [[], [], []], 'objects': ['Bachna Ca', 0.481, 'wealth']},\n",
       " {'labels': [[], [], []], 'objects': ['Bachna Ca', 0.311, 'expansion']},\n",
       " {'labels': [[], [], []], 'objects': ['Bachna Ca', 0.408, 'industry']},\n",
       " {'labels': [[], [], []], 'objects': ['Bachna Ca', 0.481, 'science']}]"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = db.run_query(f\"g.V().has('objid','{popid1}').outE('desires').inV().hasLabel('objective').dedup().path().by('name').by('weight').by('type')\")\n",
    "res"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>pop</th>\n",
       "      <th>desire</th>\n",
       "      <th>objective</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Bachna Ca</td>\n",
       "      <td>0.481</td>\n",
       "      <td>wealth</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Bachna Ca</td>\n",
       "      <td>0.481</td>\n",
       "      <td>science</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Bachna Ca</td>\n",
       "      <td>0.408</td>\n",
       "      <td>industry</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Bachna Ca</td>\n",
       "      <td>0.334</td>\n",
       "      <td>war</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Bachna Ca</td>\n",
       "      <td>0.311</td>\n",
       "      <td>expansion</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "         pop  desire  objective\n",
       "0  Bachna Ca   0.481     wealth\n",
       "1  Bachna Ca   0.481    science\n",
       "2  Bachna Ca   0.408   industry\n",
       "3  Bachna Ca   0.334        war\n",
       "4  Bachna Ca   0.311  expansion"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.DataFrame([i['objects'] for i in res], columns=['pop','desire','objective']).sort_values('desire',ascending=False).reset_index(drop=True)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Automated functions can take a people's greatest desire and place actions on thier behalf. \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "interpreter": {
   "hash": "963f8bc8d1837394f85b1a87cb03282203007ac74b0df2c49e442752684865e9"
  },
  "kernelspec": {
   "display_name": "Python 3.7.0 64-bit ('exoplanets': conda)",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.0"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
