{
 "cells": [
  {
   "cell_type": "markdown",
   "source": [
    "# How People Decide what they want to do\r\n",
    "Directed graph approach\r\n",
    "\r\n",
    "Generally people want to do a number of different things. For this I'm going to create a schema for this in a graph language that allows me to designate how much a `pop` desires to take a certain action. This will be used later when determining AI decisions. \r\n",
    "\r\n",
    "**Note** this notebook actualy builds the desires into the graph, overwriting existing ontology. "
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "source": [
    "import sys\r\n",
    "import numpy as np\r\n",
    "import pandas as pd\r\n",
    "import altair as alt\r\n",
    "sys.path.append('..')\r\n",
    "import helpers.dbquery as db\r\n",
    "import helpers.functions as f\r\n",
    "import yaml, ssl, asyncio\r\n",
    "import nb_black\r\n",
    "\r\n",
    "ssl._create_default_https_context = ssl._create_unverified_context\r\n",
    "asyncio.set_event_loop_policy(asyncio.WindowsSelectorEventLoopPolicy())\r\n",
    "import nest_asyncio\r\n",
    "# this is required for running in a Jupyter Notebook. \r\n",
    "nest_asyncio.apply()"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "source": [
    "res = db.run_query(\"g.V().hasLabel('pop').has('username','userbill').valueMap()\")\r\n",
    "pops = [db.clean_node(n) for n in res]\r\n",
    "pops[0]"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "{'conformity': '0.197',\n",
       " 'literacy': '0.822',\n",
       " 'aggression': '0.384',\n",
       " 'constitution': '0.615',\n",
       " 'objid': '5771833830958',\n",
       " 'faction_no': '2',\n",
       " 'name': 'Heznius Ying',\n",
       " 'isInFaction': '7100167726406',\n",
       " 'industry': '0.4995',\n",
       " 'wealth': '0.66075',\n",
       " 'faction_loyalty': '0.49550000000000005',\n",
       " 'username': 'userbill',\n",
       " 'objtype': 'pop',\n",
       " 'id': '5771833830958'}"
      ]
     },
     "metadata": {},
     "execution_count": 4
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "markdown",
   "source": [
    "Each population wants to do everything to a degree, the amount of desire to do that thing is expressed by the edge weight. \r\n",
    "* Attack a population\r\n",
    "* Focus on improving literacy\r\n",
    "* Focus on improving industry"
   ],
   "metadata": {}
  },
  {
   "cell_type": "markdown",
   "source": [
    "# Desires as Objects\r\n",
    "\r\n",
    "## Desire with targets.\r\n",
    "Both factions and pops can have desire. Action is guided by desire based on the `max(desire.weight)`.\r\n",
    "`desire` is an edge, the type of that desire is a property of that edge, and the edge weight is the amount of desire. The target (`node2`) is the recipient. \r\n",
    "\r\n",
    "Examples:\r\n",
    "* faction wants trade with faction\r\n",
    "* pop wants war with another pop\r\n",
    "* pop wants faction to go to war with faction\r\n",
    "\r\n",
    "## Desire without targets.\r\n",
    "\r\n",
    "Desires without targets must link to an objective. That objective can be it's own node.\r\n"
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "source": [
    "# # Drop the items, if they exist. \r\n",
    "# db.run_query(\"g.V().hasLabel('objective').has('username','notebook').drop()\")\r\n",
    "# objectives_yaml = yaml.safe_load(open(\"desires.yaml\"))['objectives']\r\n",
    "# data = {\"nodes\":objectives_yaml,'edges':[]}\r\n",
    "# # Then Create the nodes and add them to the DB\r\n",
    "# db.upload_data(data,verbose=False)\r\n",
    "# After creating the nodes, pulling them into the notebook for reference\r\n",
    "res = db.run_query(\"g.V().hasLabel('objective').valueMap()\")\r\n",
    "objectives = [db.clean_node(n) for n in res]\r\n",
    "# objectives\r\n"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "markdown",
   "source": [
    "# population wants to improve industry\r\n",
    "\r\n",
    "populations want to improve industry when:\r\n",
    "* they are not wealty\r\n",
    "* they are at war\r\n",
    "\r\n",
    "\r\n"
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "source": [
    "# Marginal return on \r\n",
    "n = 2\r\n",
    "ind_df = pd.DataFrame(np.sort([float(p['wealth']) for p in pops]),columns=['wealth'])\r\n",
    "ind_df['base'] = range(len(ind_df))\r\n",
    "ind_df['desires_industry'] = ind_df['wealth'].apply(lambda x: ((x+1)**(1-n) - 1)/(1-n))\r\n",
    "ind_df['desire_base'] = ind_df['base'].apply(lambda x: ((x+1)**(1-n) - 1)/(1-n))\r\n",
    "alt.Chart(ind_df).mark_line().encode(x='base',y='desire_base').properties(title=\"Desire relative to the base attribute\")"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/html": [
       "\n",
       "<div id=\"altair-viz-87316c2abb434c51b2b16139bade6519\"></div>\n",
       "<script type=\"text/javascript\">\n",
       "  (function(spec, embedOpt){\n",
       "    let outputDiv = document.currentScript.previousElementSibling;\n",
       "    if (outputDiv.id !== \"altair-viz-87316c2abb434c51b2b16139bade6519\") {\n",
       "      outputDiv = document.getElementById(\"altair-viz-87316c2abb434c51b2b16139bade6519\");\n",
       "    }\n",
       "    const paths = {\n",
       "      \"vega\": \"https://cdn.jsdelivr.net/npm//vega@5?noext\",\n",
       "      \"vega-lib\": \"https://cdn.jsdelivr.net/npm//vega-lib?noext\",\n",
       "      \"vega-lite\": \"https://cdn.jsdelivr.net/npm//vega-lite@4.8.1?noext\",\n",
       "      \"vega-embed\": \"https://cdn.jsdelivr.net/npm//vega-embed@6?noext\",\n",
       "    };\n",
       "\n",
       "    function loadScript(lib) {\n",
       "      return new Promise(function(resolve, reject) {\n",
       "        var s = document.createElement('script');\n",
       "        s.src = paths[lib];\n",
       "        s.async = true;\n",
       "        s.onload = () => resolve(paths[lib]);\n",
       "        s.onerror = () => reject(`Error loading script: ${paths[lib]}`);\n",
       "        document.getElementsByTagName(\"head\")[0].appendChild(s);\n",
       "      });\n",
       "    }\n",
       "\n",
       "    function showError(err) {\n",
       "      outputDiv.innerHTML = `<div class=\"error\" style=\"color:red;\">${err}</div>`;\n",
       "      throw err;\n",
       "    }\n",
       "\n",
       "    function displayChart(vegaEmbed) {\n",
       "      vegaEmbed(outputDiv, spec, embedOpt)\n",
       "        .catch(err => showError(`Javascript Error: ${err.message}<br>This usually means there's a typo in your chart specification. See the javascript console for the full traceback.`));\n",
       "    }\n",
       "\n",
       "    if(typeof define === \"function\" && define.amd) {\n",
       "      requirejs.config({paths});\n",
       "      require([\"vega-embed\"], displayChart, err => showError(`Error loading script: ${err.message}`));\n",
       "    } else if (typeof vegaEmbed === \"function\") {\n",
       "      displayChart(vegaEmbed);\n",
       "    } else {\n",
       "      loadScript(\"vega\")\n",
       "        .then(() => loadScript(\"vega-lite\"))\n",
       "        .then(() => loadScript(\"vega-embed\"))\n",
       "        .catch(showError)\n",
       "        .then(() => displayChart(vegaEmbed));\n",
       "    }\n",
       "  })({\"config\": {\"view\": {\"continuousWidth\": 400, \"continuousHeight\": 300}}, \"data\": {\"name\": \"data-b59a6d6ef8db8bbc22d2c7f356dd956d\"}, \"mark\": \"line\", \"encoding\": {\"x\": {\"type\": \"quantitative\", \"field\": \"base\"}, \"y\": {\"type\": \"quantitative\", \"field\": \"desire_base\"}}, \"title\": \"Desire relative to the base attribute\", \"$schema\": \"https://vega.github.io/schema/vega-lite/v4.8.1.json\", \"datasets\": {\"data-b59a6d6ef8db8bbc22d2c7f356dd956d\": [{\"wealth\": 0.54475, \"base\": 0, \"desires_industry\": 0.3526460592328856, \"desire_base\": -0.0}, {\"wealth\": 0.58375, \"base\": 1, \"desires_industry\": 0.3685872138910813, \"desire_base\": 0.5}, {\"wealth\": 0.591, \"base\": 2, \"desires_industry\": 0.37146448774355745, \"desire_base\": 0.6666666666666667}, {\"wealth\": 0.63825, \"base\": 3, \"desires_industry\": 0.38959255302914697, \"desire_base\": 0.75}, {\"wealth\": 0.66075, \"base\": 4, \"desires_industry\": 0.39786241156104163, \"desire_base\": 0.8}, {\"wealth\": 0.66325, \"base\": 5, \"desires_industry\": 0.3987674733203067, \"desire_base\": 0.8333333333333334}, {\"wealth\": 0.6765, \"base\": 6, \"desires_industry\": 0.40351923650462274, \"desire_base\": 0.8571428571428572}]}}, {\"mode\": \"vega-lite\"});\n",
       "</script>"
      ],
      "text/plain": [
       "alt.Chart(...)"
      ]
     },
     "metadata": {},
     "execution_count": 6
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "source": [
    "alt.Chart(ind_df).mark_line().encode(x='wealth:N',y='desires_industry').properties(title=\"Desires wealth industry relative to industry\")"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/html": [
       "\n",
       "<div id=\"altair-viz-16f1e33e3a0b4857b264c79e1059b519\"></div>\n",
       "<script type=\"text/javascript\">\n",
       "  (function(spec, embedOpt){\n",
       "    let outputDiv = document.currentScript.previousElementSibling;\n",
       "    if (outputDiv.id !== \"altair-viz-16f1e33e3a0b4857b264c79e1059b519\") {\n",
       "      outputDiv = document.getElementById(\"altair-viz-16f1e33e3a0b4857b264c79e1059b519\");\n",
       "    }\n",
       "    const paths = {\n",
       "      \"vega\": \"https://cdn.jsdelivr.net/npm//vega@5?noext\",\n",
       "      \"vega-lib\": \"https://cdn.jsdelivr.net/npm//vega-lib?noext\",\n",
       "      \"vega-lite\": \"https://cdn.jsdelivr.net/npm//vega-lite@4.8.1?noext\",\n",
       "      \"vega-embed\": \"https://cdn.jsdelivr.net/npm//vega-embed@6?noext\",\n",
       "    };\n",
       "\n",
       "    function loadScript(lib) {\n",
       "      return new Promise(function(resolve, reject) {\n",
       "        var s = document.createElement('script');\n",
       "        s.src = paths[lib];\n",
       "        s.async = true;\n",
       "        s.onload = () => resolve(paths[lib]);\n",
       "        s.onerror = () => reject(`Error loading script: ${paths[lib]}`);\n",
       "        document.getElementsByTagName(\"head\")[0].appendChild(s);\n",
       "      });\n",
       "    }\n",
       "\n",
       "    function showError(err) {\n",
       "      outputDiv.innerHTML = `<div class=\"error\" style=\"color:red;\">${err}</div>`;\n",
       "      throw err;\n",
       "    }\n",
       "\n",
       "    function displayChart(vegaEmbed) {\n",
       "      vegaEmbed(outputDiv, spec, embedOpt)\n",
       "        .catch(err => showError(`Javascript Error: ${err.message}<br>This usually means there's a typo in your chart specification. See the javascript console for the full traceback.`));\n",
       "    }\n",
       "\n",
       "    if(typeof define === \"function\" && define.amd) {\n",
       "      requirejs.config({paths});\n",
       "      require([\"vega-embed\"], displayChart, err => showError(`Error loading script: ${err.message}`));\n",
       "    } else if (typeof vegaEmbed === \"function\") {\n",
       "      displayChart(vegaEmbed);\n",
       "    } else {\n",
       "      loadScript(\"vega\")\n",
       "        .then(() => loadScript(\"vega-lite\"))\n",
       "        .then(() => loadScript(\"vega-embed\"))\n",
       "        .catch(showError)\n",
       "        .then(() => displayChart(vegaEmbed));\n",
       "    }\n",
       "  })({\"config\": {\"view\": {\"continuousWidth\": 400, \"continuousHeight\": 300}}, \"data\": {\"name\": \"data-b59a6d6ef8db8bbc22d2c7f356dd956d\"}, \"mark\": \"line\", \"encoding\": {\"x\": {\"type\": \"nominal\", \"field\": \"wealth\"}, \"y\": {\"type\": \"quantitative\", \"field\": \"desires_industry\"}}, \"title\": \"Desires wealth industry relative to industry\", \"$schema\": \"https://vega.github.io/schema/vega-lite/v4.8.1.json\", \"datasets\": {\"data-b59a6d6ef8db8bbc22d2c7f356dd956d\": [{\"wealth\": 0.54475, \"base\": 0, \"desires_industry\": 0.3526460592328856, \"desire_base\": -0.0}, {\"wealth\": 0.58375, \"base\": 1, \"desires_industry\": 0.3685872138910813, \"desire_base\": 0.5}, {\"wealth\": 0.591, \"base\": 2, \"desires_industry\": 0.37146448774355745, \"desire_base\": 0.6666666666666667}, {\"wealth\": 0.63825, \"base\": 3, \"desires_industry\": 0.38959255302914697, \"desire_base\": 0.75}, {\"wealth\": 0.66075, \"base\": 4, \"desires_industry\": 0.39786241156104163, \"desire_base\": 0.8}, {\"wealth\": 0.66325, \"base\": 5, \"desires_industry\": 0.3987674733203067, \"desire_base\": 0.8333333333333334}, {\"wealth\": 0.6765, \"base\": 6, \"desires_industry\": 0.40351923650462274, \"desire_base\": 0.8571428571428572}]}}, {\"mode\": \"vega-lite\"});\n",
       "</script>"
      ],
      "text/plain": [
       "alt.Chart(...)"
      ]
     },
     "metadata": {},
     "execution_count": 7
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "markdown",
   "source": [
    "## feeding that desire to the populations\r\n"
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "source": [
    "objectives[0],pops[0]"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "({'type': 'industry',\n",
       "  'weight': '0.5',\n",
       "  'leadingAttribute': 'wealth',\n",
       "  'comment': 'build factories, skyscrapers, infrastructure',\n",
       "  'username': 'notebook',\n",
       "  'objtype': 'objective',\n",
       "  'objid': '0321508144812',\n",
       "  'id': '0321508144812'},\n",
       " {'conformity': '0.197',\n",
       "  'literacy': '0.822',\n",
       "  'aggression': '0.384',\n",
       "  'constitution': '0.615',\n",
       "  'objid': '5771833830958',\n",
       "  'faction_no': '2',\n",
       "  'name': 'Heznius Ying',\n",
       "  'isInFaction': '7100167726406',\n",
       "  'industry': '0.4995',\n",
       "  'wealth': '0.66075',\n",
       "  'faction_loyalty': '0.49550000000000005',\n",
       "  'username': 'userbill',\n",
       "  'objtype': 'pop',\n",
       "  'id': '5771833830958'})"
      ]
     },
     "metadata": {},
     "execution_count": 8
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "source": [
    "def get_desire(x):\r\n",
    "       return np.round(((float(x)+1)**(1-n) - 1)/(1-n),3)\r\n",
    "\r\n",
    "edges = []\r\n",
    "for p in pops:\r\n",
    "    for o in objectives:\r\n",
    "        edge = {'label':'desires',\r\n",
    "                'node1':p['objid'],\r\n",
    "                'node2':o['objid'],\r\n",
    "                'weight':get_desire(p[o['leadingAttribute']])}\r\n",
    "        edges.append(edge)"
   ],
   "outputs": [],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "source": [
    "pd.DataFrame(edges)"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>label</th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>weight</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>desires</td>\n",
       "      <td>5771833830958</td>\n",
       "      <td>0321508144812</td>\n",
       "      <td>0.398</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>desires</td>\n",
       "      <td>5771833830958</td>\n",
       "      <td>9021333780224</td>\n",
       "      <td>0.333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>desires</td>\n",
       "      <td>5771833830958</td>\n",
       "      <td>8268144304568</td>\n",
       "      <td>0.277</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>desires</td>\n",
       "      <td>5771833830958</td>\n",
       "      <td>4248820160134</td>\n",
       "      <td>0.451</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>desires</td>\n",
       "      <td>5771833830958</td>\n",
       "      <td>8681411407190</td>\n",
       "      <td>0.451</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>desires</td>\n",
       "      <td>4244612303621</td>\n",
       "      <td>0321508144812</td>\n",
       "      <td>0.369</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>desires</td>\n",
       "      <td>4244612303621</td>\n",
       "      <td>9021333780224</td>\n",
       "      <td>0.368</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>desires</td>\n",
       "      <td>4244612303621</td>\n",
       "      <td>8268144304568</td>\n",
       "      <td>0.338</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>desires</td>\n",
       "      <td>4244612303621</td>\n",
       "      <td>4248820160134</td>\n",
       "      <td>0.369</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>desires</td>\n",
       "      <td>4244612303621</td>\n",
       "      <td>8681411407190</td>\n",
       "      <td>0.369</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>desires</td>\n",
       "      <td>4952558209103</td>\n",
       "      <td>0321508144812</td>\n",
       "      <td>0.390</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>desires</td>\n",
       "      <td>4952558209103</td>\n",
       "      <td>9021333780224</td>\n",
       "      <td>0.259</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>desires</td>\n",
       "      <td>4952558209103</td>\n",
       "      <td>8268144304568</td>\n",
       "      <td>0.107</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>desires</td>\n",
       "      <td>4952558209103</td>\n",
       "      <td>4248820160134</td>\n",
       "      <td>0.481</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>desires</td>\n",
       "      <td>4952558209103</td>\n",
       "      <td>8681411407190</td>\n",
       "      <td>0.481</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>desires</td>\n",
       "      <td>7884267833385</td>\n",
       "      <td>0321508144812</td>\n",
       "      <td>0.399</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>desires</td>\n",
       "      <td>7884267833385</td>\n",
       "      <td>9021333780224</td>\n",
       "      <td>0.325</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>desires</td>\n",
       "      <td>7884267833385</td>\n",
       "      <td>8268144304568</td>\n",
       "      <td>0.351</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>desires</td>\n",
       "      <td>7884267833385</td>\n",
       "      <td>4248820160134</td>\n",
       "      <td>0.458</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>desires</td>\n",
       "      <td>7884267833385</td>\n",
       "      <td>8681411407190</td>\n",
       "      <td>0.458</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>desires</td>\n",
       "      <td>6302171064369</td>\n",
       "      <td>0321508144812</td>\n",
       "      <td>0.404</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>desires</td>\n",
       "      <td>6302171064369</td>\n",
       "      <td>9021333780224</td>\n",
       "      <td>0.371</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>desires</td>\n",
       "      <td>6302171064369</td>\n",
       "      <td>8268144304568</td>\n",
       "      <td>0.388</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>desires</td>\n",
       "      <td>6302171064369</td>\n",
       "      <td>4248820160134</td>\n",
       "      <td>0.432</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>desires</td>\n",
       "      <td>6302171064369</td>\n",
       "      <td>8681411407190</td>\n",
       "      <td>0.432</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>desires</td>\n",
       "      <td>3103900522647</td>\n",
       "      <td>0321508144812</td>\n",
       "      <td>0.371</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>desires</td>\n",
       "      <td>3103900522647</td>\n",
       "      <td>9021333780224</td>\n",
       "      <td>0.326</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>desires</td>\n",
       "      <td>3103900522647</td>\n",
       "      <td>8268144304568</td>\n",
       "      <td>0.291</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>desires</td>\n",
       "      <td>3103900522647</td>\n",
       "      <td>4248820160134</td>\n",
       "      <td>0.411</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>desires</td>\n",
       "      <td>3103900522647</td>\n",
       "      <td>8681411407190</td>\n",
       "      <td>0.411</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>desires</td>\n",
       "      <td>7482929105840</td>\n",
       "      <td>0321508144812</td>\n",
       "      <td>0.353</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>desires</td>\n",
       "      <td>7482929105840</td>\n",
       "      <td>9021333780224</td>\n",
       "      <td>0.337</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>desires</td>\n",
       "      <td>7482929105840</td>\n",
       "      <td>8268144304568</td>\n",
       "      <td>0.258</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>desires</td>\n",
       "      <td>7482929105840</td>\n",
       "      <td>4248820160134</td>\n",
       "      <td>0.367</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>desires</td>\n",
       "      <td>7482929105840</td>\n",
       "      <td>8681411407190</td>\n",
       "      <td>0.367</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "      label          node1          node2  weight\n",
       "0   desires  5771833830958  0321508144812   0.398\n",
       "1   desires  5771833830958  9021333780224   0.333\n",
       "2   desires  5771833830958  8268144304568   0.277\n",
       "3   desires  5771833830958  4248820160134   0.451\n",
       "4   desires  5771833830958  8681411407190   0.451\n",
       "5   desires  4244612303621  0321508144812   0.369\n",
       "6   desires  4244612303621  9021333780224   0.368\n",
       "7   desires  4244612303621  8268144304568   0.338\n",
       "8   desires  4244612303621  4248820160134   0.369\n",
       "9   desires  4244612303621  8681411407190   0.369\n",
       "10  desires  4952558209103  0321508144812   0.390\n",
       "11  desires  4952558209103  9021333780224   0.259\n",
       "12  desires  4952558209103  8268144304568   0.107\n",
       "13  desires  4952558209103  4248820160134   0.481\n",
       "14  desires  4952558209103  8681411407190   0.481\n",
       "15  desires  7884267833385  0321508144812   0.399\n",
       "16  desires  7884267833385  9021333780224   0.325\n",
       "17  desires  7884267833385  8268144304568   0.351\n",
       "18  desires  7884267833385  4248820160134   0.458\n",
       "19  desires  7884267833385  8681411407190   0.458\n",
       "20  desires  6302171064369  0321508144812   0.404\n",
       "21  desires  6302171064369  9021333780224   0.371\n",
       "22  desires  6302171064369  8268144304568   0.388\n",
       "23  desires  6302171064369  4248820160134   0.432\n",
       "24  desires  6302171064369  8681411407190   0.432\n",
       "25  desires  3103900522647  0321508144812   0.371\n",
       "26  desires  3103900522647  9021333780224   0.326\n",
       "27  desires  3103900522647  8268144304568   0.291\n",
       "28  desires  3103900522647  4248820160134   0.411\n",
       "29  desires  3103900522647  8681411407190   0.411\n",
       "30  desires  7482929105840  0321508144812   0.353\n",
       "31  desires  7482929105840  9021333780224   0.337\n",
       "32  desires  7482929105840  8268144304568   0.258\n",
       "33  desires  7482929105840  4248820160134   0.367\n",
       "34  desires  7482929105840  8681411407190   0.367"
      ]
     },
     "metadata": {},
     "execution_count": 10
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "source": [
    "db.create_edge(edges[0])"
   ],
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "\"g.V().has('objid','5771833830958').addE('desires').property('username','notebook').property('weight','0.398').to(g.V().has('objid','0321508144812'))\""
      ]
     },
     "metadata": {},
     "execution_count": 14
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "source": [
    "db.upload_data({'nodes':[],'edges':edges},verbose=False)"
   ],
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "g.V().has('objid','5771833830958').addE('desires').property('username','notebook').property('weight','0.398').to(g.V().has('objid','0321508144812'))\n",
      "g.V().has('objid','5771833830958').addE('desires').property('username','notebook').property('weight','0.333').to(g.V().has('objid','9021333780224'))\n",
      "g.V().has('objid','5771833830958').addE('desires').property('username','notebook').property('weight','0.277').to(g.V().has('objid','8268144304568'))\n",
      "g.V().has('objid','5771833830958').addE('desires').property('username','notebook').property('weight','0.451').to(g.V().has('objid','4248820160134'))\n",
      "g.V().has('objid','5771833830958').addE('desires').property('username','notebook').property('weight','0.451').to(g.V().has('objid','8681411407190'))\n",
      "g.V().has('objid','4244612303621').addE('desires').property('username','notebook').property('weight','0.369').to(g.V().has('objid','0321508144812'))\n",
      "g.V().has('objid','4244612303621').addE('desires').property('username','notebook').property('weight','0.368').to(g.V().has('objid','9021333780224'))\n",
      "g.V().has('objid','4244612303621').addE('desires').property('username','notebook').property('weight','0.338').to(g.V().has('objid','8268144304568'))\n",
      "g.V().has('objid','4244612303621').addE('desires').property('username','notebook').property('weight','0.369').to(g.V().has('objid','4248820160134'))\n",
      "g.V().has('objid','4244612303621').addE('desires').property('username','notebook').property('weight','0.369').to(g.V().has('objid','8681411407190'))\n",
      "g.V().has('objid','4952558209103').addE('desires').property('username','notebook').property('weight','0.39').to(g.V().has('objid','0321508144812'))\n",
      "g.V().has('objid','4952558209103').addE('desires').property('username','notebook').property('weight','0.259').to(g.V().has('objid','9021333780224'))\n",
      "g.V().has('objid','4952558209103').addE('desires').property('username','notebook').property('weight','0.107').to(g.V().has('objid','8268144304568'))\n",
      "g.V().has('objid','4952558209103').addE('desires').property('username','notebook').property('weight','0.481').to(g.V().has('objid','4248820160134'))\n",
      "g.V().has('objid','4952558209103').addE('desires').property('username','notebook').property('weight','0.481').to(g.V().has('objid','8681411407190'))\n",
      "g.V().has('objid','7884267833385').addE('desires').property('username','notebook').property('weight','0.399').to(g.V().has('objid','0321508144812'))\n",
      "g.V().has('objid','7884267833385').addE('desires').property('username','notebook').property('weight','0.325').to(g.V().has('objid','9021333780224'))\n",
      "g.V().has('objid','7884267833385').addE('desires').property('username','notebook').property('weight','0.351').to(g.V().has('objid','8268144304568'))\n",
      "g.V().has('objid','7884267833385').addE('desires').property('username','notebook').property('weight','0.458').to(g.V().has('objid','4248820160134'))\n",
      "g.V().has('objid','7884267833385').addE('desires').property('username','notebook').property('weight','0.458').to(g.V().has('objid','8681411407190'))\n",
      "g.V().has('objid','6302171064369').addE('desires').property('username','notebook').property('weight','0.404').to(g.V().has('objid','0321508144812'))\n",
      "g.V().has('objid','6302171064369').addE('desires').property('username','notebook').property('weight','0.371').to(g.V().has('objid','9021333780224'))\n",
      "g.V().has('objid','6302171064369').addE('desires').property('username','notebook').property('weight','0.388').to(g.V().has('objid','8268144304568'))\n",
      "g.V().has('objid','6302171064369').addE('desires').property('username','notebook').property('weight','0.432').to(g.V().has('objid','4248820160134'))\n",
      "g.V().has('objid','6302171064369').addE('desires').property('username','notebook').property('weight','0.432').to(g.V().has('objid','8681411407190'))\n",
      "g.V().has('objid','3103900522647').addE('desires').property('username','notebook').property('weight','0.371').to(g.V().has('objid','0321508144812'))\n",
      "g.V().has('objid','3103900522647').addE('desires').property('username','notebook').property('weight','0.326').to(g.V().has('objid','9021333780224'))\n"
     ]
    },
    {
     "output_type": "stream",
     "name": "stderr",
     "text": [
      "exception calling callback for <Future at 0x1b250f6e940 state=finished returned NoneType>\n",
      "Traceback (most recent call last):\n",
      "  File \"C:\\Users\\william.harding\\anaconda3\\envs\\exoplanets\\lib\\concurrent\\futures\\_base.py\", line 324, in _invoke_callbacks\n",
      "    callback(self)\n",
      "  File \"C:\\Users\\william.harding\\anaconda3\\envs\\exoplanets\\lib\\site-packages\\gremlin_python\\driver\\connection.py\", line 72, in cb\n",
      "    done = self._executor.submit(self._receive)\n",
      "  File \"C:\\Users\\william.harding\\anaconda3\\envs\\exoplanets\\lib\\concurrent\\futures\\thread.py\", line 151, in submit\n",
      "    raise RuntimeError('cannot schedule new futures after shutdown')\n",
      "RuntimeError: cannot schedule new futures after shutdown\n",
      "Unclosed client session\n",
      "client_session: <aiohttp.client.ClientSession object at 0x000001B250EE5860>\n"
     ]
    },
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "g.V().has('objid','3103900522647').addE('desires').property('username','notebook').property('weight','0.291').to(g.V().has('objid','8268144304568'))\n",
      "g.V().has('objid','3103900522647').addE('desires').property('username','notebook').property('weight','0.411').to(g.V().has('objid','4248820160134'))\n",
      "g.V().has('objid','3103900522647').addE('desires').property('username','notebook').property('weight','0.411').to(g.V().has('objid','8681411407190'))\n",
      "g.V().has('objid','7482929105840').addE('desires').property('username','notebook').property('weight','0.353').to(g.V().has('objid','0321508144812'))\n",
      "g.V().has('objid','7482929105840').addE('desires').property('username','notebook').property('weight','0.337').to(g.V().has('objid','9021333780224'))\n",
      "g.V().has('objid','7482929105840').addE('desires').property('username','notebook').property('weight','0.258').to(g.V().has('objid','8268144304568'))\n",
      "g.V().has('objid','7482929105840').addE('desires').property('username','notebook').property('weight','0.367').to(g.V().has('objid','4248820160134'))\n",
      "g.V().has('objid','7482929105840').addE('desires').property('username','notebook').property('weight','0.367').to(g.V().has('objid','8681411407190'))\n"
     ]
    }
   ],
   "metadata": {}
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "source": [],
   "outputs": [],
   "metadata": {}
  }
 ],
 "metadata": {
  "interpreter": {
   "hash": "963f8bc8d1837394f85b1a87cb03282203007ac74b0df2c49e442752684865e9"
  },
  "kernelspec": {
   "name": "python3",
   "display_name": "Python 3.7.0 64-bit ('exoplanets': conda)"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.0"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}