{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Population growth\n",
    "* Populations that die are deleted, so they don't grow.\n",
    "* However all pops that can grow will, regardless of wheter they are starving or not. \n",
    "* Starving will lower thier health, which will eventually make them unable to grow. \n",
    "\n",
    "Sarving and Death is taken care of elsewhere, so this notebook won't have that filter. \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "executing local windows deployment\n"
     ]
    }
   ],
   "source": [
    "import sys\n",
    "import numpy as np\n",
    "import pandas as pd\n",
    "\n",
    "# mapping to the modules that make the app\n",
    "sys.path.insert(0, \"..\")\n",
    "sys.path.insert(0, \"../..\")\n",
    "sys.path.insert(0, \"../../app\")\n",
    "sys.path.insert(0, \"../../functions/popgrowth/\")\n",
    "\n",
    "import yaml, ssl, asyncio, pickle, os, ast\n",
    "\n",
    "ssl._create_default_https_context = ssl._create_unverified_context\n",
    "asyncio.set_event_loop_policy(asyncio.WindowsSelectorEventLoopPolicy())\n",
    "\n",
    "import nest_asyncio\n",
    "# this is required for running in a Jupyter Notebook. \n",
    "nest_asyncio.apply()\n",
    "\n",
    "#importing the libraries from the app\n",
    "from app.connectors import cmdb_graph\n",
    "from app.objects import time\n",
    "from app.objects import population\n",
    "from helpers import test_queries\n",
    "\n",
    "c = cmdb_graph.CosmosdbClient()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Much of the Population growth is handled in scripts inside the Azure Function"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "params = yaml.safe_load(open(os.path.join(os.getenv(\"abspath\"),\"functions/popgrowth/settings.yml\")))\n",
    "syllables = pickle.load(open(os.path.join(os.getenv(\"abspath\"),\"app/creators/specs/syllables.p\"), \"rb\"))\n",
    "username = 'notebook'"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Time is updated by the `time` function. It is always running."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "< time at: 2023-07-29T20:57:31.426891+00:00 UTU:28311 >"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "t = time.Time(c)\n",
    "t.get_current_UTU()\n",
    "params['currentTime'] = t.params['currentTime']\n",
    "t"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'pop_health_requirement': 0.6,\n",
       " 'pop_consumes': 2,\n",
       " 'starve_damage': 0.05,\n",
       " 'changing_values': ['conformity',\n",
       "  'literacy',\n",
       "  'aggression',\n",
       "  'constitution',\n",
       "  'wealth',\n",
       "  'factionLoyalty'],\n",
       " 'currentTime': 28311}"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "params"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "For this notebook, setting the `pop_health_requirement` to an arbitrary value just to examine."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "params['pop_health_requirement'] = 0.4"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "# from tools import growth\n",
    "global_health_manager = population.Global_Pop_Manager(params,c)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "global_health_manager.get_pop_health()\n",
    "\n",
    "pops_df = pd.DataFrame([d['pop'] for d in global_health_manager.data])\n",
    "species_df = pd.DataFrame([d['species'] for d in global_health_manager.data])\n",
    "locations_df = pd.DataFrame([d['location'] for d in global_health_manager.data])\n",
    "factions_df = pd.DataFrame([d['faction'] for d in global_health_manager.data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "lenth of pops == 0 : False\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>health</th>\n",
       "      <th>isIdle</th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>conformity</th>\n",
       "      <th>literacy</th>\n",
       "      <th>aggression</th>\n",
       "      <th>constitution</th>\n",
       "      <th>isIn</th>\n",
       "      <th>industry</th>\n",
       "      <th>wealth</th>\n",
       "      <th>factionLoyalty</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.70</td>\n",
       "      <td>false</td>\n",
       "      <td>Obattla Magor</td>\n",
       "      <td>7467985401518</td>\n",
       "      <td>0.421</td>\n",
       "      <td>0.376</td>\n",
       "      <td>0.632</td>\n",
       "      <td>0.338</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.4850</td>\n",
       "      <td>0.4305</td>\n",
       "      <td>0.505</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>7467985401518</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Pe</td>\n",
       "      <td>5100638967625</td>\n",
       "      <td>0.325</td>\n",
       "      <td>0.352</td>\n",
       "      <td>0.606</td>\n",
       "      <td>0.450</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.5280</td>\n",
       "      <td>0.4400</td>\n",
       "      <td>0.459</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>5100638967625</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Van</td>\n",
       "      <td>1800951322768</td>\n",
       "      <td>0.446</td>\n",
       "      <td>0.390</td>\n",
       "      <td>0.549</td>\n",
       "      <td>0.573</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.5610</td>\n",
       "      <td>0.4755</td>\n",
       "      <td>0.423</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>1800951322768</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Rochi</td>\n",
       "      <td>0692394121482</td>\n",
       "      <td>0.452</td>\n",
       "      <td>0.395</td>\n",
       "      <td>0.514</td>\n",
       "      <td>0.546</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.5300</td>\n",
       "      <td>0.4625</td>\n",
       "      <td>0.354</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>0692394121482</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Hassia Sin</td>\n",
       "      <td>0248671359952</td>\n",
       "      <td>0.623</td>\n",
       "      <td>0.215</td>\n",
       "      <td>0.704</td>\n",
       "      <td>0.569</td>\n",
       "      <td>4146242421204</td>\n",
       "      <td>0.6365</td>\n",
       "      <td>0.4258</td>\n",
       "      <td>0.662</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>0248671359952</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>121</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Serzeampro Bilnoru</td>\n",
       "      <td>9142883900818</td>\n",
       "      <td>0.557</td>\n",
       "      <td>0.544</td>\n",
       "      <td>0.609</td>\n",
       "      <td>0.557</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.3500</td>\n",
       "      <td>0.3900</td>\n",
       "      <td>0.749</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>9142883900818</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>122</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ciki Yqa</td>\n",
       "      <td>2819449749992</td>\n",
       "      <td>0.298</td>\n",
       "      <td>0.586</td>\n",
       "      <td>0.489</td>\n",
       "      <td>0.468</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>0.2660</td>\n",
       "      <td>0.2940</td>\n",
       "      <td>0.316</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>2819449749992</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>123</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Serzeampro Wilfo</td>\n",
       "      <td>0872830607503</td>\n",
       "      <td>0.469</td>\n",
       "      <td>0.545</td>\n",
       "      <td>0.722</td>\n",
       "      <td>0.570</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.3940</td>\n",
       "      <td>0.2740</td>\n",
       "      <td>0.494</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>0872830607503</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>124</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Serzeampro Gradonnue</td>\n",
       "      <td>7834145976449</td>\n",
       "      <td>0.340</td>\n",
       "      <td>0.495</td>\n",
       "      <td>0.532</td>\n",
       "      <td>0.635</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.3450</td>\n",
       "      <td>0.3030</td>\n",
       "      <td>0.331</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>7834145976449</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>125</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ciki Fesha</td>\n",
       "      <td>0652360161340</td>\n",
       "      <td>0.524</td>\n",
       "      <td>0.726</td>\n",
       "      <td>0.452</td>\n",
       "      <td>0.635</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>0.2970</td>\n",
       "      <td>0.3150</td>\n",
       "      <td>0.521</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>0652360161340</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>126 rows × 15 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     health isIdle                  name          objid  conformity  literacy  \\\n",
       "0      0.70  false         Obattla Magor  7467985401518       0.421     0.376   \n",
       "1      0.70   true            Obattla Pe  5100638967625       0.325     0.352   \n",
       "2      0.70   true           Obattla Van  1800951322768       0.446     0.390   \n",
       "3      0.70   true         Obattla Rochi  0692394121482       0.452     0.395   \n",
       "4      0.70   true            Hassia Sin  0248671359952       0.623     0.215   \n",
       "..      ...    ...                   ...            ...         ...       ...   \n",
       "121    0.42   true    Serzeampro Bilnoru  9142883900818       0.557     0.544   \n",
       "122    0.42   true              Ciki Yqa  2819449749992       0.298     0.586   \n",
       "123    0.42   true      Serzeampro Wilfo  0872830607503       0.469     0.545   \n",
       "124    0.42   true  Serzeampro Gradonnue  7834145976449       0.340     0.495   \n",
       "125    0.42   true            Ciki Fesha  0652360161340       0.524     0.726   \n",
       "\n",
       "     aggression  constitution           isIn  industry  wealth  \\\n",
       "0         0.632         0.338  8822366435138    0.4850  0.4305   \n",
       "1         0.606         0.450  8822366435138    0.5280  0.4400   \n",
       "2         0.549         0.573  8822366435138    0.5610  0.4755   \n",
       "3         0.514         0.546  8822366435138    0.5300  0.4625   \n",
       "4         0.704         0.569  4146242421204    0.6365  0.4258   \n",
       "..          ...           ...            ...       ...     ...   \n",
       "121       0.609         0.557  4873232607770    0.3500  0.3900   \n",
       "122       0.489         0.468  0015468195520    0.2660  0.2940   \n",
       "123       0.722         0.570  4873232607770    0.3940  0.2740   \n",
       "124       0.532         0.635  4873232607770    0.3450  0.3030   \n",
       "125       0.452         0.635  0015468195520    0.2970  0.3150   \n",
       "\n",
       "     factionLoyalty       username objtype             id  \n",
       "0             0.505  BillmanLocal2     pop  7467985401518  \n",
       "1             0.459  BillmanLocal2     pop  5100638967625  \n",
       "2             0.423  BillmanLocal2     pop  1800951322768  \n",
       "3             0.354  BillmanLocal2     pop  0692394121482  \n",
       "4             0.662  BillmanLocal2     pop  0248671359952  \n",
       "..              ...            ...     ...            ...  \n",
       "121           0.749  Billmanserver     pop  9142883900818  \n",
       "122           0.316  Billmanserver     pop  2819449749992  \n",
       "123           0.494  Billmanserver     pop  0872830607503  \n",
       "124           0.331  Billmanserver     pop  7834145976449  \n",
       "125           0.521  Billmanserver     pop  0652360161340  \n",
       "\n",
       "[126 rows x 15 columns]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# pops_df,species_df,locations_df,factions_df = growth.get_pop_health(c,params)\n",
    "print(f\"lenth of pops == 0 : {len(pops_df)==0}\")\n",
    "pops_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>consumes</th>\n",
       "      <th>effuses</th>\n",
       "      <th>viral_resilience</th>\n",
       "      <th>habitat_resilience</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Koykudra</td>\n",
       "      <td>4291284873310</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>4291284873310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Koykudra</td>\n",
       "      <td>4291284873310</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>4291284873310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Koykudra</td>\n",
       "      <td>4291284873310</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>4291284873310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Koykudra</td>\n",
       "      <td>4291284873310</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>4291284873310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Koykudra</td>\n",
       "      <td>4291284873310</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>4291284873310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>121</th>\n",
       "      <td>Til</td>\n",
       "      <td>5478087080681</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>species</td>\n",
       "      <td>5478087080681</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>122</th>\n",
       "      <td>Til</td>\n",
       "      <td>5478087080681</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>species</td>\n",
       "      <td>5478087080681</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>123</th>\n",
       "      <td>Til</td>\n",
       "      <td>5478087080681</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>species</td>\n",
       "      <td>5478087080681</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>124</th>\n",
       "      <td>Til</td>\n",
       "      <td>5478087080681</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>species</td>\n",
       "      <td>5478087080681</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>125</th>\n",
       "      <td>Til</td>\n",
       "      <td>5478087080681</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>species</td>\n",
       "      <td>5478087080681</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>126 rows × 9 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "         name          objid   consumes                    effuses  \\\n",
       "0    Koykudra  4291284873310  [Organic]  [Organic waste, Plastics]   \n",
       "1    Koykudra  4291284873310  [Organic]  [Organic waste, Plastics]   \n",
       "2    Koykudra  4291284873310  [Organic]  [Organic waste, Plastics]   \n",
       "3    Koykudra  4291284873310  [Organic]  [Organic waste, Plastics]   \n",
       "4    Koykudra  4291284873310  [Organic]  [Organic waste, Plastics]   \n",
       "..        ...            ...        ...                        ...   \n",
       "121       Til  5478087080681  [Organic]  [Organic waste, Plastics]   \n",
       "122       Til  5478087080681  [Organic]  [Organic waste, Plastics]   \n",
       "123       Til  5478087080681  [Organic]  [Organic waste, Plastics]   \n",
       "124       Til  5478087080681  [Organic]  [Organic waste, Plastics]   \n",
       "125       Til  5478087080681  [Organic]  [Organic waste, Plastics]   \n",
       "\n",
       "     viral_resilience  habitat_resilience       username  objtype  \\\n",
       "0                 0.7                 0.2  BillmanLocal2  species   \n",
       "1                 0.7                 0.2  BillmanLocal2  species   \n",
       "2                 0.7                 0.2  BillmanLocal2  species   \n",
       "3                 0.7                 0.2  BillmanLocal2  species   \n",
       "4                 0.7                 0.2  BillmanLocal2  species   \n",
       "..                ...                 ...            ...      ...   \n",
       "121               0.7                 0.2  Billmanserver  species   \n",
       "122               0.7                 0.2  Billmanserver  species   \n",
       "123               0.7                 0.2  Billmanserver  species   \n",
       "124               0.7                 0.2  Billmanserver  species   \n",
       "125               0.7                 0.2  Billmanserver  species   \n",
       "\n",
       "                id  \n",
       "0    4291284873310  \n",
       "1    4291284873310  \n",
       "2    4291284873310  \n",
       "3    4291284873310  \n",
       "4    4291284873310  \n",
       "..             ...  \n",
       "121  5478087080681  \n",
       "122  5478087080681  \n",
       "123  5478087080681  \n",
       "124  5478087080681  \n",
       "125  5478087080681  \n",
       "\n",
       "[126 rows x 9 columns]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "species_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>class</th>\n",
       "      <th>objid</th>\n",
       "      <th>radius</th>\n",
       "      <th>mass</th>\n",
       "      <th>orbitsDistance</th>\n",
       "      <th>orbitsId</th>\n",
       "      <th>orbitsName</th>\n",
       "      <th>isSupportsLife</th>\n",
       "      <th>isPopulated</th>\n",
       "      <th>isHomeworld</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Dorf</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>2972908340606</td>\n",
       "      <td>0.884</td>\n",
       "      <td>0.882</td>\n",
       "      <td>1.057</td>\n",
       "      <td>9570931993836</td>\n",
       "      <td>Lisallos</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>2972908340606</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Dorf</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>2972908340606</td>\n",
       "      <td>0.884</td>\n",
       "      <td>0.882</td>\n",
       "      <td>1.057</td>\n",
       "      <td>9570931993836</td>\n",
       "      <td>Lisallos</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>2972908340606</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Dorf</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>2972908340606</td>\n",
       "      <td>0.884</td>\n",
       "      <td>0.882</td>\n",
       "      <td>1.057</td>\n",
       "      <td>9570931993836</td>\n",
       "      <td>Lisallos</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>2972908340606</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Dorf</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>2972908340606</td>\n",
       "      <td>0.884</td>\n",
       "      <td>0.882</td>\n",
       "      <td>1.057</td>\n",
       "      <td>9570931993836</td>\n",
       "      <td>Lisallos</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>2972908340606</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Dorf</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>2972908340606</td>\n",
       "      <td>0.884</td>\n",
       "      <td>0.882</td>\n",
       "      <td>1.057</td>\n",
       "      <td>9570931993836</td>\n",
       "      <td>Lisallos</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>2972908340606</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>121</th>\n",
       "      <td>Taipe</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>8490894854096</td>\n",
       "      <td>0.898</td>\n",
       "      <td>0.113</td>\n",
       "      <td>1.087</td>\n",
       "      <td>1849212388331</td>\n",
       "      <td>Lindraja</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>planet</td>\n",
       "      <td>8490894854096</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>122</th>\n",
       "      <td>Taipe</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>8490894854096</td>\n",
       "      <td>0.898</td>\n",
       "      <td>0.113</td>\n",
       "      <td>1.087</td>\n",
       "      <td>1849212388331</td>\n",
       "      <td>Lindraja</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>planet</td>\n",
       "      <td>8490894854096</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>123</th>\n",
       "      <td>Taipe</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>8490894854096</td>\n",
       "      <td>0.898</td>\n",
       "      <td>0.113</td>\n",
       "      <td>1.087</td>\n",
       "      <td>1849212388331</td>\n",
       "      <td>Lindraja</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>planet</td>\n",
       "      <td>8490894854096</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>124</th>\n",
       "      <td>Taipe</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>8490894854096</td>\n",
       "      <td>0.898</td>\n",
       "      <td>0.113</td>\n",
       "      <td>1.087</td>\n",
       "      <td>1849212388331</td>\n",
       "      <td>Lindraja</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>planet</td>\n",
       "      <td>8490894854096</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>125</th>\n",
       "      <td>Taipe</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>8490894854096</td>\n",
       "      <td>0.898</td>\n",
       "      <td>0.113</td>\n",
       "      <td>1.087</td>\n",
       "      <td>1849212388331</td>\n",
       "      <td>Lindraja</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>planet</td>\n",
       "      <td>8490894854096</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>126 rows × 14 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      name        class          objid  radius   mass  orbitsDistance  \\\n",
       "0     Dorf  terrestrial  2972908340606   0.884  0.882           1.057   \n",
       "1     Dorf  terrestrial  2972908340606   0.884  0.882           1.057   \n",
       "2     Dorf  terrestrial  2972908340606   0.884  0.882           1.057   \n",
       "3     Dorf  terrestrial  2972908340606   0.884  0.882           1.057   \n",
       "4     Dorf  terrestrial  2972908340606   0.884  0.882           1.057   \n",
       "..     ...          ...            ...     ...    ...             ...   \n",
       "121  Taipe  terrestrial  8490894854096   0.898  0.113           1.087   \n",
       "122  Taipe  terrestrial  8490894854096   0.898  0.113           1.087   \n",
       "123  Taipe  terrestrial  8490894854096   0.898  0.113           1.087   \n",
       "124  Taipe  terrestrial  8490894854096   0.898  0.113           1.087   \n",
       "125  Taipe  terrestrial  8490894854096   0.898  0.113           1.087   \n",
       "\n",
       "          orbitsId orbitsName isSupportsLife isPopulated isHomeworld  \\\n",
       "0    9570931993836   Lisallos           true        true        true   \n",
       "1    9570931993836   Lisallos           true        true        true   \n",
       "2    9570931993836   Lisallos           true        true        true   \n",
       "3    9570931993836   Lisallos           true        true        true   \n",
       "4    9570931993836   Lisallos           true        true        true   \n",
       "..             ...        ...            ...         ...         ...   \n",
       "121  1849212388331   Lindraja           true        true        true   \n",
       "122  1849212388331   Lindraja           true        true        true   \n",
       "123  1849212388331   Lindraja           true        true        true   \n",
       "124  1849212388331   Lindraja           true        true        true   \n",
       "125  1849212388331   Lindraja           true        true        true   \n",
       "\n",
       "          username objtype             id  \n",
       "0    BillmanLocal2  planet  2972908340606  \n",
       "1    BillmanLocal2  planet  2972908340606  \n",
       "2    BillmanLocal2  planet  2972908340606  \n",
       "3    BillmanLocal2  planet  2972908340606  \n",
       "4    BillmanLocal2  planet  2972908340606  \n",
       "..             ...     ...            ...  \n",
       "121  Billmanserver  planet  8490894854096  \n",
       "122  Billmanserver  planet  8490894854096  \n",
       "123  Billmanserver  planet  8490894854096  \n",
       "124  Billmanserver  planet  8490894854096  \n",
       "125  Billmanserver  planet  8490894854096  \n",
       "\n",
       "[126 rows x 14 columns]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "locations_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>pop_locations</th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>lat</th>\n",
       "      <th>long</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "      <th>pop_loactions</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[[0, 0], [-1, 1], [-2, 0], [0, 2], [-1, -1], [...</td>\n",
       "      <td>Obattla</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>-0.149</td>\n",
       "      <td>0.0</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>faction</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[[0, 0], [-1, 1], [-2, 0], [0, 2], [-1, -1], [...</td>\n",
       "      <td>Obattla</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>-0.149</td>\n",
       "      <td>0.0</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>faction</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[[0, 0], [-1, 1], [-2, 0], [0, 2], [-1, -1], [...</td>\n",
       "      <td>Obattla</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>-0.149</td>\n",
       "      <td>0.0</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>faction</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[[0, 0], [-1, 1], [-2, 0], [0, 2], [-1, -1], [...</td>\n",
       "      <td>Obattla</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>-0.149</td>\n",
       "      <td>0.0</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>faction</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[[0, 0], [-2, 2], [-1, -1], [2, 0], [-1, 3], [...</td>\n",
       "      <td>Hassia</td>\n",
       "      <td>4146242421204</td>\n",
       "      <td>0.149</td>\n",
       "      <td>0.0</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>faction</td>\n",
       "      <td>4146242421204</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>121</th>\n",
       "      <td>[[0, 0], [2, -2], [0, -2], [-2, -2], [0, 2], [...</td>\n",
       "      <td>Serzeampro</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.113</td>\n",
       "      <td>0.0</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>faction</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>122</th>\n",
       "      <td>[[0, 0], [0, -2], [-2, 2], [-2, -2], [2, 2], [...</td>\n",
       "      <td>Ciki</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>-0.113</td>\n",
       "      <td>0.0</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>faction</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>123</th>\n",
       "      <td>[[0, 0], [2, -2], [0, -2], [-2, -2], [0, 2], [...</td>\n",
       "      <td>Serzeampro</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.113</td>\n",
       "      <td>0.0</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>faction</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>124</th>\n",
       "      <td>[[0, 0], [2, -2], [0, -2], [-2, -2], [0, 2], [...</td>\n",
       "      <td>Serzeampro</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.113</td>\n",
       "      <td>0.0</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>faction</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>125</th>\n",
       "      <td>[[0, 0], [0, -2], [-2, 2], [-2, -2], [2, 2], [...</td>\n",
       "      <td>Ciki</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>-0.113</td>\n",
       "      <td>0.0</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>faction</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>126 rows × 9 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                         pop_locations        name  \\\n",
       "0    [[0, 0], [-1, 1], [-2, 0], [0, 2], [-1, -1], [...     Obattla   \n",
       "1    [[0, 0], [-1, 1], [-2, 0], [0, 2], [-1, -1], [...     Obattla   \n",
       "2    [[0, 0], [-1, 1], [-2, 0], [0, 2], [-1, -1], [...     Obattla   \n",
       "3    [[0, 0], [-1, 1], [-2, 0], [0, 2], [-1, -1], [...     Obattla   \n",
       "4    [[0, 0], [-2, 2], [-1, -1], [2, 0], [-1, 3], [...      Hassia   \n",
       "..                                                 ...         ...   \n",
       "121  [[0, 0], [2, -2], [0, -2], [-2, -2], [0, 2], [...  Serzeampro   \n",
       "122  [[0, 0], [0, -2], [-2, 2], [-2, -2], [2, 2], [...        Ciki   \n",
       "123  [[0, 0], [2, -2], [0, -2], [-2, -2], [0, 2], [...  Serzeampro   \n",
       "124  [[0, 0], [2, -2], [0, -2], [-2, -2], [0, 2], [...  Serzeampro   \n",
       "125  [[0, 0], [0, -2], [-2, 2], [-2, -2], [2, 2], [...        Ciki   \n",
       "\n",
       "             objid    lat  long       username  objtype             id  \\\n",
       "0    8822366435138 -0.149   0.0  BillmanLocal2  faction  8822366435138   \n",
       "1    8822366435138 -0.149   0.0  BillmanLocal2  faction  8822366435138   \n",
       "2    8822366435138 -0.149   0.0  BillmanLocal2  faction  8822366435138   \n",
       "3    8822366435138 -0.149   0.0  BillmanLocal2  faction  8822366435138   \n",
       "4    4146242421204  0.149   0.0  BillmanLocal2  faction  4146242421204   \n",
       "..             ...    ...   ...            ...      ...            ...   \n",
       "121  4873232607770  0.113   0.0  Billmanserver  faction  4873232607770   \n",
       "122  0015468195520 -0.113   0.0  Billmanserver  faction  0015468195520   \n",
       "123  4873232607770  0.113   0.0  Billmanserver  faction  4873232607770   \n",
       "124  4873232607770  0.113   0.0  Billmanserver  faction  4873232607770   \n",
       "125  0015468195520 -0.113   0.0  Billmanserver  faction  0015468195520   \n",
       "\n",
       "    pop_loactions  \n",
       "0             NaN  \n",
       "1             NaN  \n",
       "2             NaN  \n",
       "3             NaN  \n",
       "4             NaN  \n",
       "..            ...  \n",
       "121           NaN  \n",
       "122           NaN  \n",
       "123           NaN  \n",
       "124           NaN  \n",
       "125           NaN  \n",
       "\n",
       "[126 rows x 9 columns]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "factions_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>health</th>\n",
       "      <th>isIdle</th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>conformity</th>\n",
       "      <th>literacy</th>\n",
       "      <th>aggression</th>\n",
       "      <th>constitution</th>\n",
       "      <th>isIn</th>\n",
       "      <th>industry</th>\n",
       "      <th>wealth</th>\n",
       "      <th>factionLoyalty</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Pe</td>\n",
       "      <td>5100638967625</td>\n",
       "      <td>0.325</td>\n",
       "      <td>0.352</td>\n",
       "      <td>0.606</td>\n",
       "      <td>0.450</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.5280</td>\n",
       "      <td>0.4400</td>\n",
       "      <td>0.459</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>5100638967625</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Van</td>\n",
       "      <td>1800951322768</td>\n",
       "      <td>0.446</td>\n",
       "      <td>0.390</td>\n",
       "      <td>0.549</td>\n",
       "      <td>0.573</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.5610</td>\n",
       "      <td>0.4755</td>\n",
       "      <td>0.423</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>1800951322768</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Rochi</td>\n",
       "      <td>0692394121482</td>\n",
       "      <td>0.452</td>\n",
       "      <td>0.395</td>\n",
       "      <td>0.514</td>\n",
       "      <td>0.546</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.5300</td>\n",
       "      <td>0.4625</td>\n",
       "      <td>0.354</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>0692394121482</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Hassia Sin</td>\n",
       "      <td>0248671359952</td>\n",
       "      <td>0.623</td>\n",
       "      <td>0.215</td>\n",
       "      <td>0.704</td>\n",
       "      <td>0.569</td>\n",
       "      <td>4146242421204</td>\n",
       "      <td>0.6365</td>\n",
       "      <td>0.4258</td>\n",
       "      <td>0.662</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>0248671359952</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Artes</td>\n",
       "      <td>9819392335838</td>\n",
       "      <td>0.488</td>\n",
       "      <td>0.383</td>\n",
       "      <td>0.572</td>\n",
       "      <td>0.570</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.5710</td>\n",
       "      <td>0.4770</td>\n",
       "      <td>0.497</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>9819392335838</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Peu</td>\n",
       "      <td>5350816288225</td>\n",
       "      <td>0.249</td>\n",
       "      <td>0.308</td>\n",
       "      <td>0.557</td>\n",
       "      <td>0.421</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.3170</td>\n",
       "      <td>0.2850</td>\n",
       "      <td>0.519</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>5350816288225</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Petown</td>\n",
       "      <td>6577007174425</td>\n",
       "      <td>0.245</td>\n",
       "      <td>0.402</td>\n",
       "      <td>0.539</td>\n",
       "      <td>0.505</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.3170</td>\n",
       "      <td>0.2000</td>\n",
       "      <td>0.483</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>6577007174425</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Siacarrat</td>\n",
       "      <td>3446159101358</td>\n",
       "      <td>0.554</td>\n",
       "      <td>0.593</td>\n",
       "      <td>0.387</td>\n",
       "      <td>0.469</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.4280</td>\n",
       "      <td>0.5105</td>\n",
       "      <td>0.677</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>3446159101358</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Wo</td>\n",
       "      <td>9552341693154</td>\n",
       "      <td>0.494</td>\n",
       "      <td>0.615</td>\n",
       "      <td>0.354</td>\n",
       "      <td>0.410</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.3820</td>\n",
       "      <td>0.4985</td>\n",
       "      <td>0.485</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>9552341693154</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Aytu</td>\n",
       "      <td>4772723923474</td>\n",
       "      <td>0.581</td>\n",
       "      <td>0.637</td>\n",
       "      <td>0.452</td>\n",
       "      <td>0.406</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.4290</td>\n",
       "      <td>0.5330</td>\n",
       "      <td>0.546</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>4772723923474</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Lismontpastil</td>\n",
       "      <td>4150839486690</td>\n",
       "      <td>0.576</td>\n",
       "      <td>0.508</td>\n",
       "      <td>0.380</td>\n",
       "      <td>0.648</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.5140</td>\n",
       "      <td>0.5110</td>\n",
       "      <td>0.692</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>4150839486690</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Zopon Lischarha</td>\n",
       "      <td>2152501246930</td>\n",
       "      <td>0.554</td>\n",
       "      <td>0.508</td>\n",
       "      <td>0.614</td>\n",
       "      <td>0.356</td>\n",
       "      <td>9376731217333</td>\n",
       "      <td>0.4850</td>\n",
       "      <td>0.4965</td>\n",
       "      <td>0.646</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>2152501246930</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>0.70</td>\n",
       "      <td>false</td>\n",
       "      <td>Tilcasport Tla</td>\n",
       "      <td>3298484338584</td>\n",
       "      <td>0.780</td>\n",
       "      <td>0.751</td>\n",
       "      <td>0.252</td>\n",
       "      <td>0.195</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.2235</td>\n",
       "      <td>0.4872</td>\n",
       "      <td>0.788</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>3298484338584</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Boupatciace</td>\n",
       "      <td>4742850136180</td>\n",
       "      <td>0.692</td>\n",
       "      <td>0.822</td>\n",
       "      <td>0.374</td>\n",
       "      <td>0.187</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.2555</td>\n",
       "      <td>0.4888</td>\n",
       "      <td>0.855</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>4742850136180</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>0.75</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Niaar</td>\n",
       "      <td>7036253430140</td>\n",
       "      <td>0.584</td>\n",
       "      <td>0.692</td>\n",
       "      <td>0.252</td>\n",
       "      <td>0.248</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.2500</td>\n",
       "      <td>0.4210</td>\n",
       "      <td>0.521</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>7036253430140</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>0.75</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Tankyque</td>\n",
       "      <td>8226274126289</td>\n",
       "      <td>0.705</td>\n",
       "      <td>0.703</td>\n",
       "      <td>0.319</td>\n",
       "      <td>0.272</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.2955</td>\n",
       "      <td>0.4492</td>\n",
       "      <td>0.605</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>8226274126289</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>0.75</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Tos</td>\n",
       "      <td>1437057417022</td>\n",
       "      <td>0.752</td>\n",
       "      <td>0.622</td>\n",
       "      <td>0.327</td>\n",
       "      <td>0.251</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.2890</td>\n",
       "      <td>0.4055</td>\n",
       "      <td>0.715</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>1437057417022</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Enwil</td>\n",
       "      <td>3440955961419</td>\n",
       "      <td>0.683</td>\n",
       "      <td>0.615</td>\n",
       "      <td>0.373</td>\n",
       "      <td>0.228</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.3005</td>\n",
       "      <td>0.4578</td>\n",
       "      <td>0.802</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>3440955961419</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Artesciu</td>\n",
       "      <td>5431490965694</td>\n",
       "      <td>0.429</td>\n",
       "      <td>0.436</td>\n",
       "      <td>0.557</td>\n",
       "      <td>0.656</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.3430</td>\n",
       "      <td>0.3130</td>\n",
       "      <td>0.522</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>5431490965694</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Aytukou</td>\n",
       "      <td>8522831554241</td>\n",
       "      <td>0.490</td>\n",
       "      <td>0.595</td>\n",
       "      <td>0.452</td>\n",
       "      <td>0.420</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.2570</td>\n",
       "      <td>0.3320</td>\n",
       "      <td>0.490</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>8522831554241</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Zopon Lischarhage</td>\n",
       "      <td>2935089853375</td>\n",
       "      <td>0.558</td>\n",
       "      <td>0.451</td>\n",
       "      <td>0.541</td>\n",
       "      <td>0.261</td>\n",
       "      <td>9376731217333</td>\n",
       "      <td>0.2910</td>\n",
       "      <td>0.2180</td>\n",
       "      <td>0.563</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>2935089853375</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Tlacen</td>\n",
       "      <td>9570919893877</td>\n",
       "      <td>0.715</td>\n",
       "      <td>0.711</td>\n",
       "      <td>0.197</td>\n",
       "      <td>0.199</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.1340</td>\n",
       "      <td>0.3290</td>\n",
       "      <td>0.810</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>9570919893877</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Pemac</td>\n",
       "      <td>2299636896903</td>\n",
       "      <td>0.396</td>\n",
       "      <td>0.339</td>\n",
       "      <td>0.658</td>\n",
       "      <td>0.416</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.3170</td>\n",
       "      <td>0.3300</td>\n",
       "      <td>0.477</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>2299636896903</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Woque</td>\n",
       "      <td>0002436592279</td>\n",
       "      <td>0.425</td>\n",
       "      <td>0.638</td>\n",
       "      <td>0.337</td>\n",
       "      <td>0.505</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.2290</td>\n",
       "      <td>0.2160</td>\n",
       "      <td>0.491</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>0002436592279</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Zopon Lischarhaah</td>\n",
       "      <td>0236166271938</td>\n",
       "      <td>0.593</td>\n",
       "      <td>0.446</td>\n",
       "      <td>0.559</td>\n",
       "      <td>0.257</td>\n",
       "      <td>9376731217333</td>\n",
       "      <td>0.2910</td>\n",
       "      <td>0.2070</td>\n",
       "      <td>0.631</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>0236166271938</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Toscruz</td>\n",
       "      <td>1345947410478</td>\n",
       "      <td>0.665</td>\n",
       "      <td>0.556</td>\n",
       "      <td>0.370</td>\n",
       "      <td>0.287</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.1730</td>\n",
       "      <td>0.2690</td>\n",
       "      <td>0.754</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>1345947410478</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>52</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Pebai</td>\n",
       "      <td>9209226114605</td>\n",
       "      <td>0.341</td>\n",
       "      <td>0.422</td>\n",
       "      <td>0.589</td>\n",
       "      <td>0.355</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.3170</td>\n",
       "      <td>0.2590</td>\n",
       "      <td>0.458</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>9209226114605</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>55</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Siacarratdia</td>\n",
       "      <td>6941269568884</td>\n",
       "      <td>0.521</td>\n",
       "      <td>0.525</td>\n",
       "      <td>0.398</td>\n",
       "      <td>0.545</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.2570</td>\n",
       "      <td>0.3520</td>\n",
       "      <td>0.771</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>6941269568884</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>58</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Aytudro</td>\n",
       "      <td>5841609833234</td>\n",
       "      <td>0.558</td>\n",
       "      <td>0.631</td>\n",
       "      <td>0.392</td>\n",
       "      <td>0.426</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.2570</td>\n",
       "      <td>0.2530</td>\n",
       "      <td>0.585</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>5841609833234</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>68</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Rochihen</td>\n",
       "      <td>3954554316101</td>\n",
       "      <td>0.404</td>\n",
       "      <td>0.361</td>\n",
       "      <td>0.524</td>\n",
       "      <td>0.569</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.3180</td>\n",
       "      <td>0.2870</td>\n",
       "      <td>0.351</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>3954554316101</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>74</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Siatiapecac</td>\n",
       "      <td>6434625393637</td>\n",
       "      <td>0.883</td>\n",
       "      <td>0.815</td>\n",
       "      <td>0.260</td>\n",
       "      <td>0.200</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.1370</td>\n",
       "      <td>0.1320</td>\n",
       "      <td>0.747</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>6434625393637</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>79</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Wohill</td>\n",
       "      <td>9507225996006</td>\n",
       "      <td>0.422</td>\n",
       "      <td>0.584</td>\n",
       "      <td>0.355</td>\n",
       "      <td>0.351</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.2290</td>\n",
       "      <td>0.2530</td>\n",
       "      <td>0.439</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>9507225996006</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>82</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Lismontpastilhills</td>\n",
       "      <td>6689339860449</td>\n",
       "      <td>0.669</td>\n",
       "      <td>0.588</td>\n",
       "      <td>0.331</td>\n",
       "      <td>0.702</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.3080</td>\n",
       "      <td>0.2700</td>\n",
       "      <td>0.704</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>6689339860449</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>83</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Quabanmarwarpro</td>\n",
       "      <td>2640969887821</td>\n",
       "      <td>0.382</td>\n",
       "      <td>0.516</td>\n",
       "      <td>0.457</td>\n",
       "      <td>0.548</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.2850</td>\n",
       "      <td>0.2570</td>\n",
       "      <td>0.584</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>2640969887821</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>85</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Tlaha</td>\n",
       "      <td>4178287800929</td>\n",
       "      <td>0.712</td>\n",
       "      <td>0.718</td>\n",
       "      <td>0.280</td>\n",
       "      <td>0.239</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.1340</td>\n",
       "      <td>0.3050</td>\n",
       "      <td>0.876</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>4178287800929</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>86</th>\n",
       "      <td>0.45</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Niaarbha</td>\n",
       "      <td>7287424927330</td>\n",
       "      <td>0.507</td>\n",
       "      <td>0.624</td>\n",
       "      <td>0.269</td>\n",
       "      <td>0.185</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.1500</td>\n",
       "      <td>0.2350</td>\n",
       "      <td>0.618</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>7287424927330</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>92</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Siacarratgaon</td>\n",
       "      <td>6634245095477</td>\n",
       "      <td>0.481</td>\n",
       "      <td>0.589</td>\n",
       "      <td>0.302</td>\n",
       "      <td>0.461</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.2570</td>\n",
       "      <td>0.2430</td>\n",
       "      <td>0.690</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>6634245095477</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>101</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Ciki Dadcas</td>\n",
       "      <td>9068536152668</td>\n",
       "      <td>0.436</td>\n",
       "      <td>0.457</td>\n",
       "      <td>0.526</td>\n",
       "      <td>0.354</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>0.4400</td>\n",
       "      <td>0.4485</td>\n",
       "      <td>0.462</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>9068536152668</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>103</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Serzeampro Wil</td>\n",
       "      <td>1772981049949</td>\n",
       "      <td>0.424</td>\n",
       "      <td>0.469</td>\n",
       "      <td>0.647</td>\n",
       "      <td>0.668</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.6575</td>\n",
       "      <td>0.5632</td>\n",
       "      <td>0.394</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>1772981049949</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>104</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Ciki Basma</td>\n",
       "      <td>1247897538416</td>\n",
       "      <td>0.510</td>\n",
       "      <td>0.532</td>\n",
       "      <td>0.390</td>\n",
       "      <td>0.478</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>0.4340</td>\n",
       "      <td>0.4830</td>\n",
       "      <td>0.602</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>1247897538416</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>105</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Serzeampro Gradon</td>\n",
       "      <td>8096543483724</td>\n",
       "      <td>0.432</td>\n",
       "      <td>0.502</td>\n",
       "      <td>0.546</td>\n",
       "      <td>0.604</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.5750</td>\n",
       "      <td>0.5385</td>\n",
       "      <td>0.375</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>8096543483724</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>106</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Ciki Fe</td>\n",
       "      <td>8876287369940</td>\n",
       "      <td>0.456</td>\n",
       "      <td>0.725</td>\n",
       "      <td>0.428</td>\n",
       "      <td>0.562</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>0.4950</td>\n",
       "      <td>0.6100</td>\n",
       "      <td>0.529</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>8876287369940</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>109</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Hassia Sinkoy</td>\n",
       "      <td>1756526331281</td>\n",
       "      <td>0.556</td>\n",
       "      <td>0.150</td>\n",
       "      <td>0.683</td>\n",
       "      <td>0.619</td>\n",
       "      <td>4146242421204</td>\n",
       "      <td>0.3820</td>\n",
       "      <td>0.3300</td>\n",
       "      <td>0.631</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>1756526331281</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>111</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Wosun</td>\n",
       "      <td>9629904984175</td>\n",
       "      <td>0.400</td>\n",
       "      <td>0.521</td>\n",
       "      <td>0.351</td>\n",
       "      <td>0.345</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.2290</td>\n",
       "      <td>0.2960</td>\n",
       "      <td>0.583</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>9629904984175</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>113</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Aytuil</td>\n",
       "      <td>4741322021092</td>\n",
       "      <td>0.631</td>\n",
       "      <td>0.550</td>\n",
       "      <td>0.381</td>\n",
       "      <td>0.362</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.2570</td>\n",
       "      <td>0.4190</td>\n",
       "      <td>0.629</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>4741322021092</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>116</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Siatiapecper</td>\n",
       "      <td>3563017224702</td>\n",
       "      <td>0.913</td>\n",
       "      <td>0.841</td>\n",
       "      <td>0.162</td>\n",
       "      <td>0.254</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.1370</td>\n",
       "      <td>0.2940</td>\n",
       "      <td>0.891</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>3563017224702</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>120</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Enwilburg</td>\n",
       "      <td>1908164461185</td>\n",
       "      <td>0.782</td>\n",
       "      <td>0.531</td>\n",
       "      <td>0.327</td>\n",
       "      <td>0.177</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.1800</td>\n",
       "      <td>0.2080</td>\n",
       "      <td>0.751</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>1908164461185</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>121</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Serzeampro Bilnoru</td>\n",
       "      <td>9142883900818</td>\n",
       "      <td>0.557</td>\n",
       "      <td>0.544</td>\n",
       "      <td>0.609</td>\n",
       "      <td>0.557</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.3500</td>\n",
       "      <td>0.3900</td>\n",
       "      <td>0.749</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>9142883900818</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>124</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Serzeampro Gradonnue</td>\n",
       "      <td>7834145976449</td>\n",
       "      <td>0.340</td>\n",
       "      <td>0.495</td>\n",
       "      <td>0.532</td>\n",
       "      <td>0.635</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.3450</td>\n",
       "      <td>0.3030</td>\n",
       "      <td>0.331</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>7834145976449</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>125</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ciki Fesha</td>\n",
       "      <td>0652360161340</td>\n",
       "      <td>0.524</td>\n",
       "      <td>0.726</td>\n",
       "      <td>0.452</td>\n",
       "      <td>0.635</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>0.2970</td>\n",
       "      <td>0.3150</td>\n",
       "      <td>0.521</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>0652360161340</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     health isIdle                        name          objid  conformity  \\\n",
       "1      0.70   true                  Obattla Pe  5100638967625       0.325   \n",
       "2      0.70   true                 Obattla Van  1800951322768       0.446   \n",
       "3      0.70   true               Obattla Rochi  0692394121482       0.452   \n",
       "4      0.70   true                  Hassia Sin  0248671359952       0.623   \n",
       "5      0.70   true               Obattla Artes  9819392335838       0.488   \n",
       "8      0.42   true                 Obattla Peu  5350816288225       0.249   \n",
       "12     0.42   true              Obattla Petown  6577007174425       0.245   \n",
       "16     0.70   true           Ganjtil Siacarrat  3446159101358       0.554   \n",
       "17     0.70   true                  Ganjtil Wo  9552341693154       0.494   \n",
       "19     0.70   true                Ganjtil Aytu  4772723923474       0.581   \n",
       "20     0.70   true       Ganjtil Lismontpastil  4150839486690       0.576   \n",
       "22     0.70   true             Zopon Lischarha  2152501246930       0.554   \n",
       "23     0.70  false              Tilcasport Tla  3298484338584       0.780   \n",
       "24     0.70   true      Tilcasport Boupatciace  4742850136180       0.692   \n",
       "26     0.75   true            Tilcasport Niaar  7036253430140       0.584   \n",
       "27     0.75   true         Tilcasport Tankyque  8226274126289       0.705   \n",
       "28     0.75   true              Tilcasport Tos  1437057417022       0.752   \n",
       "29     0.70   true            Tilcasport Enwil  3440955961419       0.683   \n",
       "32     0.42   true            Obattla Artesciu  5431490965694       0.429   \n",
       "33     0.42   true             Ganjtil Aytukou  8522831554241       0.490   \n",
       "34     0.42   true           Zopon Lischarhage  2935089853375       0.558   \n",
       "35     0.42   true           Tilcasport Tlacen  9570919893877       0.715   \n",
       "39     0.42   true               Obattla Pemac  2299636896903       0.396   \n",
       "44     0.42   true               Ganjtil Woque  0002436592279       0.425   \n",
       "47     0.42   true           Zopon Lischarhaah  0236166271938       0.593   \n",
       "50     0.42   true          Tilcasport Toscruz  1345947410478       0.665   \n",
       "52     0.42   true               Obattla Pebai  9209226114605       0.341   \n",
       "55     0.42   true        Ganjtil Siacarratdia  6941269568884       0.521   \n",
       "58     0.42   true             Ganjtil Aytudro  5841609833234       0.558   \n",
       "68     0.42   true            Obattla Rochihen  3954554316101       0.404   \n",
       "74     0.42   true      Tilcasport Siatiapecac  6434625393637       0.883   \n",
       "79     0.42   true              Ganjtil Wohill  9507225996006       0.422   \n",
       "82     0.42   true  Ganjtil Lismontpastilhills  6689339860449       0.669   \n",
       "83     0.42   true     Ganjtil Quabanmarwarpro  2640969887821       0.382   \n",
       "85     0.42   true            Tilcasport Tlaha  4178287800929       0.712   \n",
       "86     0.45   true         Tilcasport Niaarbha  7287424927330       0.507   \n",
       "92     0.42   true       Ganjtil Siacarratgaon  6634245095477       0.481   \n",
       "101    0.70   true                 Ciki Dadcas  9068536152668       0.436   \n",
       "103    0.70   true              Serzeampro Wil  1772981049949       0.424   \n",
       "104    0.70   true                  Ciki Basma  1247897538416       0.510   \n",
       "105    0.70   true           Serzeampro Gradon  8096543483724       0.432   \n",
       "106    0.70   true                     Ciki Fe  8876287369940       0.456   \n",
       "109    0.42   true               Hassia Sinkoy  1756526331281       0.556   \n",
       "111    0.42   true               Ganjtil Wosun  9629904984175       0.400   \n",
       "113    0.42   true              Ganjtil Aytuil  4741322021092       0.631   \n",
       "116    0.42   true     Tilcasport Siatiapecper  3563017224702       0.913   \n",
       "120    0.42   true        Tilcasport Enwilburg  1908164461185       0.782   \n",
       "121    0.42   true          Serzeampro Bilnoru  9142883900818       0.557   \n",
       "124    0.42   true        Serzeampro Gradonnue  7834145976449       0.340   \n",
       "125    0.42   true                  Ciki Fesha  0652360161340       0.524   \n",
       "\n",
       "     literacy  aggression  constitution           isIn  industry  wealth  \\\n",
       "1       0.352       0.606         0.450  8822366435138    0.5280  0.4400   \n",
       "2       0.390       0.549         0.573  8822366435138    0.5610  0.4755   \n",
       "3       0.395       0.514         0.546  8822366435138    0.5300  0.4625   \n",
       "4       0.215       0.704         0.569  4146242421204    0.6365  0.4258   \n",
       "5       0.383       0.572         0.570  8822366435138    0.5710  0.4770   \n",
       "8       0.308       0.557         0.421  8822366435138    0.3170  0.2850   \n",
       "12      0.402       0.539         0.505  8822366435138    0.3170  0.2000   \n",
       "16      0.593       0.387         0.469  4115897493342    0.4280  0.5105   \n",
       "17      0.615       0.354         0.410  4115897493342    0.3820  0.4985   \n",
       "19      0.637       0.452         0.406  4115897493342    0.4290  0.5330   \n",
       "20      0.508       0.380         0.648  4115897493342    0.5140  0.5110   \n",
       "22      0.508       0.614         0.356  9376731217333    0.4850  0.4965   \n",
       "23      0.751       0.252         0.195  4232678858631    0.2235  0.4872   \n",
       "24      0.822       0.374         0.187  4232678858631    0.2555  0.4888   \n",
       "26      0.692       0.252         0.248  4232678858631    0.2500  0.4210   \n",
       "27      0.703       0.319         0.272  4232678858631    0.2955  0.4492   \n",
       "28      0.622       0.327         0.251  4232678858631    0.2890  0.4055   \n",
       "29      0.615       0.373         0.228  4232678858631    0.3005  0.4578   \n",
       "32      0.436       0.557         0.656  8822366435138    0.3430  0.3130   \n",
       "33      0.595       0.452         0.420  4115897493342    0.2570  0.3320   \n",
       "34      0.451       0.541         0.261  9376731217333    0.2910  0.2180   \n",
       "35      0.711       0.197         0.199  4232678858631    0.1340  0.3290   \n",
       "39      0.339       0.658         0.416  8822366435138    0.3170  0.3300   \n",
       "44      0.638       0.337         0.505  4115897493342    0.2290  0.2160   \n",
       "47      0.446       0.559         0.257  9376731217333    0.2910  0.2070   \n",
       "50      0.556       0.370         0.287  4232678858631    0.1730  0.2690   \n",
       "52      0.422       0.589         0.355  8822366435138    0.3170  0.2590   \n",
       "55      0.525       0.398         0.545  4115897493342    0.2570  0.3520   \n",
       "58      0.631       0.392         0.426  4115897493342    0.2570  0.2530   \n",
       "68      0.361       0.524         0.569  8822366435138    0.3180  0.2870   \n",
       "74      0.815       0.260         0.200  4232678858631    0.1370  0.1320   \n",
       "79      0.584       0.355         0.351  4115897493342    0.2290  0.2530   \n",
       "82      0.588       0.331         0.702  4115897493342    0.3080  0.2700   \n",
       "83      0.516       0.457         0.548  4115897493342    0.2850  0.2570   \n",
       "85      0.718       0.280         0.239  4232678858631    0.1340  0.3050   \n",
       "86      0.624       0.269         0.185  4232678858631    0.1500  0.2350   \n",
       "92      0.589       0.302         0.461  4115897493342    0.2570  0.2430   \n",
       "101     0.457       0.526         0.354  0015468195520    0.4400  0.4485   \n",
       "103     0.469       0.647         0.668  4873232607770    0.6575  0.5632   \n",
       "104     0.532       0.390         0.478  0015468195520    0.4340  0.4830   \n",
       "105     0.502       0.546         0.604  4873232607770    0.5750  0.5385   \n",
       "106     0.725       0.428         0.562  0015468195520    0.4950  0.6100   \n",
       "109     0.150       0.683         0.619  4146242421204    0.3820  0.3300   \n",
       "111     0.521       0.351         0.345  4115897493342    0.2290  0.2960   \n",
       "113     0.550       0.381         0.362  4115897493342    0.2570  0.4190   \n",
       "116     0.841       0.162         0.254  4232678858631    0.1370  0.2940   \n",
       "120     0.531       0.327         0.177  4232678858631    0.1800  0.2080   \n",
       "121     0.544       0.609         0.557  4873232607770    0.3500  0.3900   \n",
       "124     0.495       0.532         0.635  4873232607770    0.3450  0.3030   \n",
       "125     0.726       0.452         0.635  0015468195520    0.2970  0.3150   \n",
       "\n",
       "     factionLoyalty                           username objtype             id  \n",
       "1             0.459                      BillmanLocal2     pop  5100638967625  \n",
       "2             0.423                      BillmanLocal2     pop  1800951322768  \n",
       "3             0.354                      BillmanLocal2     pop  0692394121482  \n",
       "4             0.662                      BillmanLocal2     pop  0248671359952  \n",
       "5             0.497                      BillmanLocal2     pop  9819392335838  \n",
       "8             0.519                      BillmanLocal2     pop  5350816288225  \n",
       "12            0.483                      BillmanLocal2     pop  6577007174425  \n",
       "16            0.677                          manderson     pop  3446159101358  \n",
       "17            0.485                          manderson     pop  9552341693154  \n",
       "19            0.546                          manderson     pop  4772723923474  \n",
       "20            0.692                          manderson     pop  4150839486690  \n",
       "22            0.646                          manderson     pop  2152501246930  \n",
       "23            0.788  william.jeffrey.harding@gmail.com     pop  3298484338584  \n",
       "24            0.855  william.jeffrey.harding@gmail.com     pop  4742850136180  \n",
       "26            0.521  william.jeffrey.harding@gmail.com     pop  7036253430140  \n",
       "27            0.605  william.jeffrey.harding@gmail.com     pop  8226274126289  \n",
       "28            0.715  william.jeffrey.harding@gmail.com     pop  1437057417022  \n",
       "29            0.802  william.jeffrey.harding@gmail.com     pop  3440955961419  \n",
       "32            0.522                      BillmanLocal2     pop  5431490965694  \n",
       "33            0.490                          manderson     pop  8522831554241  \n",
       "34            0.563                          manderson     pop  2935089853375  \n",
       "35            0.810  william.jeffrey.harding@gmail.com     pop  9570919893877  \n",
       "39            0.477                      BillmanLocal2     pop  2299636896903  \n",
       "44            0.491                          manderson     pop  0002436592279  \n",
       "47            0.631                          manderson     pop  0236166271938  \n",
       "50            0.754  william.jeffrey.harding@gmail.com     pop  1345947410478  \n",
       "52            0.458                      BillmanLocal2     pop  9209226114605  \n",
       "55            0.771                          manderson     pop  6941269568884  \n",
       "58            0.585                          manderson     pop  5841609833234  \n",
       "68            0.351                      BillmanLocal2     pop  3954554316101  \n",
       "74            0.747  william.jeffrey.harding@gmail.com     pop  6434625393637  \n",
       "79            0.439                          manderson     pop  9507225996006  \n",
       "82            0.704                          manderson     pop  6689339860449  \n",
       "83            0.584                          manderson     pop  2640969887821  \n",
       "85            0.876  william.jeffrey.harding@gmail.com     pop  4178287800929  \n",
       "86            0.618  william.jeffrey.harding@gmail.com     pop  7287424927330  \n",
       "92            0.690                          manderson     pop  6634245095477  \n",
       "101           0.462                      Billmanserver     pop  9068536152668  \n",
       "103           0.394                      Billmanserver     pop  1772981049949  \n",
       "104           0.602                      Billmanserver     pop  1247897538416  \n",
       "105           0.375                      Billmanserver     pop  8096543483724  \n",
       "106           0.529                      Billmanserver     pop  8876287369940  \n",
       "109           0.631                      BillmanLocal2     pop  1756526331281  \n",
       "111           0.583                          manderson     pop  9629904984175  \n",
       "113           0.629                          manderson     pop  4741322021092  \n",
       "116           0.891  william.jeffrey.harding@gmail.com     pop  3563017224702  \n",
       "120           0.751  william.jeffrey.harding@gmail.com     pop  1908164461185  \n",
       "121           0.749                      Billmanserver     pop  9142883900818  \n",
       "124           0.331                      Billmanserver     pop  7834145976449  \n",
       "125           0.521                      Billmanserver     pop  0652360161340  "
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pops_df['roll'] = pops_df['objid'].apply(lambda x: np.random.random())\n",
    "pops_df['grow'] = pops_df[['wealth','health']].T.mean() >= pops_df['roll']\n",
    "\n",
    "reproducing_pops = pops_df[pops_df['grow']].drop(['roll','grow'],axis=1)\n",
    "reproducing_pops"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "50 of 126 will grow\n"
     ]
    }
   ],
   "source": [
    "print(f\"{len(reproducing_pops)} of {len(pops_df)} will grow\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Going to create species objects for the populations that will reproduce"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<species: None; 4291284873310; Koykudra>,\n",
       " <species: None; 7324266402745; Si>,\n",
       " <species: None; 1245644824657; Towner>,\n",
       " <species: None; 5478087080681; Til>]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "species = [population.species.Species(species_df.drop_duplicates().T.to_dict()[i]) for i in  species_df.drop_duplicates().T.to_dict().keys()]\n",
    "species"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'4291284873310': <species: None; 4291284873310; Koykudra>,\n",
       " '7324266402745': <species: None; 7324266402745; Si>,\n",
       " '1245644824657': <species: None; 1245644824657; Towner>,\n",
       " '5478087080681': <species: None; 5478087080681; Til>}"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "for i in species:\n",
    "    global_health_manager.species_dict[i.objid]=i\n",
    "global_health_manager.species_dict"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "for i in reproducing_pops.index.to_list():\n",
    "    s = global_health_manager.species_dict[species_df.loc[i].to_dict()['objid']]\n",
    "\n",
    "    p = reproducing_pops.loc[i].to_dict()\n",
    "    #adding the current pop as a defautl to the species.\n",
    "    s.config['defaults'] = p\n",
    "    f = factions_df.loc[i].to_dict()\n",
    "    l = locations_df.loc[i].to_dict()\n",
    "    child = population.Pop(s)\n",
    "    \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<pop: pop; None; unnamed>"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "child = population.Pop(s)\n",
    "child"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0.42"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "child.health"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "for i in reproducing_pops.index.to_list():\n",
    "    p = reproducing_pops.loc[i].to_dict()\n",
    "    f = factions_df.loc[i].to_dict()\n",
    "    s = species_df.loc[i].to_dict()\n",
    "    l = locations_df.loc[i].to_dict()\n",
    "    child = growth.grow_pop(p,species,params,syllables)    \n",
    "    pop_locations = growth.assign_pop_to_faction(f)    \n",
    "    c.patch_property(f['objid'], 'pop_locations', str(pop_locations))\n",
    "    nodes.append(child)\n",
    "    event = growth.population_growth_event(p, location,child, params)\n",
    "    nodes.append(event)\n",
    "    edges.append({\"node1\": child[\"objid\"], \"node2\": p[\"objid\"], \"label\": \"childOf\"})\n",
    "    edges.append({\"node1\": child[\"objid\"], \"node2\": child[\"isIn\"], \"label\": \"isIn\"})\n",
    "    edges.append({\"node1\": child[\"objid\"], \"node2\": species[\"objid\"], \"label\": \"isOf\"})\n",
    "    edges.append({\"node1\": child[\"objid\"], \"node2\": location[\"objid\"], \"label\": \"inhabits\"})\n",
    "    event_edges.append(c.create_custom_edge(event,location,'happenedAt'))\n",
    "    event_edges.append(c.create_custom_edge(p,event,'caused'))\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "ename": "NameError",
     "evalue": "name 'f' is not defined",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mNameError\u001b[0m                                 Traceback (most recent call last)",
      "Cell \u001b[1;32mIn[21], line 1\u001b[0m\n\u001b[1;32m----> 1\u001b[0m f\n",
      "\u001b[1;31mNameError\u001b[0m: name 'f' is not defined"
     ]
    }
   ],
   "source": [
    "f"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[[0, 0],\n",
       " [0, -2],\n",
       " [-2, 2],\n",
       " [-2, -2],\n",
       " [2, 2],\n",
       " [-1, 1],\n",
       " [0, 2],\n",
       " [-2, 0],\n",
       " [1, -1],\n",
       " [1, 3],\n",
       " [-1, 3]]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pop_locations = growth.assign_pop_to_faction(f) \n",
    "pop_locations\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [],
   "source": [
    "c.patch_property(f['objid'], 'pop_locations', str(pop_locations))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'pop_locations': ['[[0, 0], [0, -2], [-2, 2], [-2, -2], [2, 2], [-1, 1], [0, 2], [-2, 0], [1, -1], [1, 3], [-1, 3]]'],\n",
       "  'name': ['Ciki'],\n",
       "  'objid': ['0015468195520'],\n",
       "  'lat': [-0.113],\n",
       "  'long': [0.0],\n",
       "  'username': ['Billmanserver'],\n",
       "  'objtype': ['faction']}]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "c.run_query(f\"\"\"\n",
    "g.V().has('objid','{f['objid']}').valueMap()\n",
    "\"\"\")    \n",
    "\n",
    "c.res"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'health': 0.7,\n",
       " 'isIdle': 'true',\n",
       " 'name': 'Ciki Fe',\n",
       " 'objid': '8876287369940',\n",
       " 'conformity': 0.456,\n",
       " 'literacy': 0.725,\n",
       " 'aggression': 0.428,\n",
       " 'constitution': 0.562,\n",
       " 'isIn': '0015468195520',\n",
       " 'industry': 0.495,\n",
       " 'wealth': 0.61,\n",
       " 'factionLoyalty': 0.529,\n",
       " 'username': 'Billmanserver',\n",
       " 'objtype': 'pop',\n",
       " 'id': '8876287369940'}"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "p"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'health': 0.42,\n",
       " 'isIdle': 'true',\n",
       " 'name': 'Ciki Fehas',\n",
       " 'objid': '7005589919552',\n",
       " 'conformity': 0.524,\n",
       " 'literacy': 0.79,\n",
       " 'aggression': 0.489,\n",
       " 'constitution': 0.548,\n",
       " 'isIn': '0015468195520',\n",
       " 'industry': 0.297,\n",
       " 'wealth': 0.418,\n",
       " 'factionLoyalty': 0.504,\n",
       " 'username': 'Billmanserver',\n",
       " 'objtype': 'pop',\n",
       " 'id': '7005589919552',\n",
       " 'label': 'pop'}"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "growth.grow_pop(p,species,params,syllables)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>health</th>\n",
       "      <th>isIdle</th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>conformity</th>\n",
       "      <th>literacy</th>\n",
       "      <th>aggression</th>\n",
       "      <th>constitution</th>\n",
       "      <th>isIn</th>\n",
       "      <th>industry</th>\n",
       "      <th>wealth</th>\n",
       "      <th>factionLoyalty</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "      <th>label</th>\n",
       "      <th>text</th>\n",
       "      <th>visibleTo</th>\n",
       "      <th>time</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Magorpro</td>\n",
       "      <td>0913584747812</td>\n",
       "      <td>0.520</td>\n",
       "      <td>0.304</td>\n",
       "      <td>0.595</td>\n",
       "      <td>0.260</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.291</td>\n",
       "      <td>0.328</td>\n",
       "      <td>0.471</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>0913584747812</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>7184852353123</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Obattla Magor) inhabiting Dorf...</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Peby</td>\n",
       "      <td>0630745128207</td>\n",
       "      <td>0.401</td>\n",
       "      <td>0.323</td>\n",
       "      <td>0.666</td>\n",
       "      <td>0.380</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.317</td>\n",
       "      <td>0.291</td>\n",
       "      <td>0.384</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>0630745128207</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>2196391002317</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Obattla Pe) inhabiting Dorf ha...</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Vangar</td>\n",
       "      <td>5675131856567</td>\n",
       "      <td>0.511</td>\n",
       "      <td>0.404</td>\n",
       "      <td>0.519</td>\n",
       "      <td>0.473</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.337</td>\n",
       "      <td>0.349</td>\n",
       "      <td>0.383</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>5675131856567</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>7356076059018</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Obattla Van) inhabiting Dorf h...</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Hassia Sinmu</td>\n",
       "      <td>3307181878378</td>\n",
       "      <td>0.553</td>\n",
       "      <td>0.175</td>\n",
       "      <td>0.605</td>\n",
       "      <td>0.633</td>\n",
       "      <td>4146242421204</td>\n",
       "      <td>0.382</td>\n",
       "      <td>0.201</td>\n",
       "      <td>0.620</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>3307181878378</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>2276175445082</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Hassia Sin) inhabiting Dorf ha...</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Arteswil</td>\n",
       "      <td>8738754631576</td>\n",
       "      <td>0.535</td>\n",
       "      <td>0.391</td>\n",
       "      <td>0.591</td>\n",
       "      <td>0.642</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.343</td>\n",
       "      <td>0.378</td>\n",
       "      <td>0.553</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>8738754631576</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>5497131605023</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Obattla Artes) inhabiting Dorf...</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Sersprings</td>\n",
       "      <td>3727965196255</td>\n",
       "      <td>0.274</td>\n",
       "      <td>0.438</td>\n",
       "      <td>0.628</td>\n",
       "      <td>0.522</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.347</td>\n",
       "      <td>0.208</td>\n",
       "      <td>0.455</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>3727965196255</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>0690887141373</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Obattla Ser) inhabiting Dorf h...</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Siacarratgor</td>\n",
       "      <td>2152499680520</td>\n",
       "      <td>0.609</td>\n",
       "      <td>0.610</td>\n",
       "      <td>0.436</td>\n",
       "      <td>0.547</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.257</td>\n",
       "      <td>0.384</td>\n",
       "      <td>0.709</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>2152499680520</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>4840616715473</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Ganjtil Siacarrat) inhabiting ...</td>\n",
       "      <td>manderson</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Wogi</td>\n",
       "      <td>6064514068524</td>\n",
       "      <td>0.512</td>\n",
       "      <td>0.613</td>\n",
       "      <td>0.305</td>\n",
       "      <td>0.324</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.229</td>\n",
       "      <td>0.264</td>\n",
       "      <td>0.473</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>6064514068524</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>4703077847671</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Ganjtil Wo) inhabiting Luraszi...</td>\n",
       "      <td>manderson</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Zopon Haydorfkerbergpen</td>\n",
       "      <td>3216423906414</td>\n",
       "      <td>0.300</td>\n",
       "      <td>0.335</td>\n",
       "      <td>0.581</td>\n",
       "      <td>0.308</td>\n",
       "      <td>9376731217333</td>\n",
       "      <td>0.269</td>\n",
       "      <td>0.335</td>\n",
       "      <td>0.579</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>3216423906414</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>0775878869326</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Zopon Haydorfkerberg) inhabiti...</td>\n",
       "      <td>manderson</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Aytuu</td>\n",
       "      <td>4814336118524</td>\n",
       "      <td>0.620</td>\n",
       "      <td>0.624</td>\n",
       "      <td>0.438</td>\n",
       "      <td>0.379</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.257</td>\n",
       "      <td>0.334</td>\n",
       "      <td>0.536</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>4814336118524</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>7345988827345</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Ganjtil Aytu) inhabiting Luras...</td>\n",
       "      <td>manderson</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Quabanmarwarre</td>\n",
       "      <td>3175874154129</td>\n",
       "      <td>0.510</td>\n",
       "      <td>0.560</td>\n",
       "      <td>0.570</td>\n",
       "      <td>0.595</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.285</td>\n",
       "      <td>0.254</td>\n",
       "      <td>0.461</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>3175874154129</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>6378902062013</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Ganjtil Quabanmarwar) inhabiti...</td>\n",
       "      <td>manderson</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Zopon Lischarhapest</td>\n",
       "      <td>6827404859809</td>\n",
       "      <td>0.520</td>\n",
       "      <td>0.582</td>\n",
       "      <td>0.525</td>\n",
       "      <td>0.387</td>\n",
       "      <td>9376731217333</td>\n",
       "      <td>0.291</td>\n",
       "      <td>0.299</td>\n",
       "      <td>0.554</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>6827404859809</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>8513510577003</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Zopon Lischarha) inhabiting Lu...</td>\n",
       "      <td>manderson</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Boupatciacerich</td>\n",
       "      <td>6986617453979</td>\n",
       "      <td>0.737</td>\n",
       "      <td>0.747</td>\n",
       "      <td>0.382</td>\n",
       "      <td>0.104</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.153</td>\n",
       "      <td>0.374</td>\n",
       "      <td>0.931</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>6986617453979</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>5260747328170</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Tilcasport Boupatciace) inhabi...</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Siatiapeckes</td>\n",
       "      <td>8646845240336</td>\n",
       "      <td>0.861</td>\n",
       "      <td>0.897</td>\n",
       "      <td>0.133</td>\n",
       "      <td>0.214</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.137</td>\n",
       "      <td>0.175</td>\n",
       "      <td>0.826</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>8646845240336</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>7782388659825</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Tilcasport Siatiapec) inhabiti...</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>0.45</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Niaarsin</td>\n",
       "      <td>1820268905401</td>\n",
       "      <td>0.503</td>\n",
       "      <td>0.780</td>\n",
       "      <td>0.286</td>\n",
       "      <td>0.314</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.150</td>\n",
       "      <td>0.232</td>\n",
       "      <td>0.485</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>1820268905401</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>3200486583332</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Tilcasport Niaar) inhabiting P...</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Enwilby</td>\n",
       "      <td>5408205765317</td>\n",
       "      <td>0.726</td>\n",
       "      <td>0.588</td>\n",
       "      <td>0.292</td>\n",
       "      <td>0.244</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.180</td>\n",
       "      <td>0.202</td>\n",
       "      <td>0.762</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>5408205765317</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>4526569155793</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Tilcasport Enwil) inhabiting P...</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Serzeampro Wilye</td>\n",
       "      <td>4271185084463</td>\n",
       "      <td>0.354</td>\n",
       "      <td>0.472</td>\n",
       "      <td>0.553</td>\n",
       "      <td>0.762</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.394</td>\n",
       "      <td>0.269</td>\n",
       "      <td>0.350</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>4271185084463</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>2919916850958</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Serzeampro Wil) inhabiting Tai...</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ciki Basmadia</td>\n",
       "      <td>4667958701560</td>\n",
       "      <td>0.511</td>\n",
       "      <td>0.449</td>\n",
       "      <td>0.451</td>\n",
       "      <td>0.500</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>0.260</td>\n",
       "      <td>0.381</td>\n",
       "      <td>0.649</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>4667958701560</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>4183534367737</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Ciki Basma) inhabiting Taipe h...</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Serzeampro Gradonnor</td>\n",
       "      <td>2901583468148</td>\n",
       "      <td>0.502</td>\n",
       "      <td>0.498</td>\n",
       "      <td>0.608</td>\n",
       "      <td>0.629</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.345</td>\n",
       "      <td>0.350</td>\n",
       "      <td>0.327</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>2901583468148</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>4606339513308</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Serzeampro Gradon) inhabiting ...</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ciki Fepe</td>\n",
       "      <td>6707630942353</td>\n",
       "      <td>0.407</td>\n",
       "      <td>0.665</td>\n",
       "      <td>0.519</td>\n",
       "      <td>0.565</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>0.297</td>\n",
       "      <td>0.430</td>\n",
       "      <td>0.473</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>6707630942353</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>6276059687128</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Ciki Fe) inhabiting Taipe has ...</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    health isIdle                        name          objid  conformity  \\\n",
       "0     0.42   true            Obattla Magorpro  0913584747812       0.520   \n",
       "1      NaN    NaN           population growth  7184852353123         NaN   \n",
       "2     0.42   true                Obattla Peby  0630745128207       0.401   \n",
       "3      NaN    NaN           population growth  2196391002317         NaN   \n",
       "4     0.42   true              Obattla Vangar  5675131856567       0.511   \n",
       "5      NaN    NaN           population growth  7356076059018         NaN   \n",
       "6     0.42   true                Hassia Sinmu  3307181878378       0.553   \n",
       "7      NaN    NaN           population growth  2276175445082         NaN   \n",
       "8     0.42   true            Obattla Arteswil  8738754631576       0.535   \n",
       "9      NaN    NaN           population growth  5497131605023         NaN   \n",
       "10    0.42   true          Obattla Sersprings  3727965196255       0.274   \n",
       "11     NaN    NaN           population growth  0690887141373         NaN   \n",
       "12    0.42   true        Ganjtil Siacarratgor  2152499680520       0.609   \n",
       "13     NaN    NaN           population growth  4840616715473         NaN   \n",
       "14    0.42   true                Ganjtil Wogi  6064514068524       0.512   \n",
       "15     NaN    NaN           population growth  4703077847671         NaN   \n",
       "16    0.42   true     Zopon Haydorfkerbergpen  3216423906414       0.300   \n",
       "17     NaN    NaN           population growth  0775878869326         NaN   \n",
       "18    0.42   true               Ganjtil Aytuu  4814336118524       0.620   \n",
       "19     NaN    NaN           population growth  7345988827345         NaN   \n",
       "20    0.42   true      Ganjtil Quabanmarwarre  3175874154129       0.510   \n",
       "21     NaN    NaN           population growth  6378902062013         NaN   \n",
       "22    0.42   true         Zopon Lischarhapest  6827404859809       0.520   \n",
       "23     NaN    NaN           population growth  8513510577003         NaN   \n",
       "24    0.42   true  Tilcasport Boupatciacerich  6986617453979       0.737   \n",
       "25     NaN    NaN           population growth  5260747328170         NaN   \n",
       "26    0.42   true     Tilcasport Siatiapeckes  8646845240336       0.861   \n",
       "27     NaN    NaN           population growth  7782388659825         NaN   \n",
       "28    0.45   true         Tilcasport Niaarsin  1820268905401       0.503   \n",
       "29     NaN    NaN           population growth  3200486583332         NaN   \n",
       "30    0.42   true          Tilcasport Enwilby  5408205765317       0.726   \n",
       "31     NaN    NaN           population growth  4526569155793         NaN   \n",
       "32    0.42   true            Serzeampro Wilye  4271185084463       0.354   \n",
       "33     NaN    NaN           population growth  2919916850958         NaN   \n",
       "34    0.42   true               Ciki Basmadia  4667958701560       0.511   \n",
       "35     NaN    NaN           population growth  4183534367737         NaN   \n",
       "36    0.42   true        Serzeampro Gradonnor  2901583468148       0.502   \n",
       "37     NaN    NaN           population growth  4606339513308         NaN   \n",
       "38    0.42   true                   Ciki Fepe  6707630942353       0.407   \n",
       "39     NaN    NaN           population growth  6276059687128         NaN   \n",
       "\n",
       "    literacy  aggression  constitution           isIn  industry  wealth  \\\n",
       "0      0.304       0.595         0.260  8822366435138     0.291   0.328   \n",
       "1        NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "2      0.323       0.666         0.380  8822366435138     0.317   0.291   \n",
       "3        NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "4      0.404       0.519         0.473  8822366435138     0.337   0.349   \n",
       "5        NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "6      0.175       0.605         0.633  4146242421204     0.382   0.201   \n",
       "7        NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "8      0.391       0.591         0.642  8822366435138     0.343   0.378   \n",
       "9        NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "10     0.438       0.628         0.522  8822366435138     0.347   0.208   \n",
       "11       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "12     0.610       0.436         0.547  4115897493342     0.257   0.384   \n",
       "13       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "14     0.613       0.305         0.324  4115897493342     0.229   0.264   \n",
       "15       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "16     0.335       0.581         0.308  9376731217333     0.269   0.335   \n",
       "17       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "18     0.624       0.438         0.379  4115897493342     0.257   0.334   \n",
       "19       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "20     0.560       0.570         0.595  4115897493342     0.285   0.254   \n",
       "21       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "22     0.582       0.525         0.387  9376731217333     0.291   0.299   \n",
       "23       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "24     0.747       0.382         0.104  4232678858631     0.153   0.374   \n",
       "25       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "26     0.897       0.133         0.214  4232678858631     0.137   0.175   \n",
       "27       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "28     0.780       0.286         0.314  4232678858631     0.150   0.232   \n",
       "29       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "30     0.588       0.292         0.244  4232678858631     0.180   0.202   \n",
       "31       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "32     0.472       0.553         0.762  4873232607770     0.394   0.269   \n",
       "33       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "34     0.449       0.451         0.500  0015468195520     0.260   0.381   \n",
       "35       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "36     0.498       0.608         0.629  4873232607770     0.345   0.350   \n",
       "37       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "38     0.665       0.519         0.565  0015468195520     0.297   0.430   \n",
       "39       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "\n",
       "    factionLoyalty                           username objtype             id  \\\n",
       "0            0.471                      BillmanLocal2     pop  0913584747812   \n",
       "1              NaN                              event     NaN            NaN   \n",
       "2            0.384                      BillmanLocal2     pop  0630745128207   \n",
       "3              NaN                              event     NaN            NaN   \n",
       "4            0.383                      BillmanLocal2     pop  5675131856567   \n",
       "5              NaN                              event     NaN            NaN   \n",
       "6            0.620                      BillmanLocal2     pop  3307181878378   \n",
       "7              NaN                              event     NaN            NaN   \n",
       "8            0.553                      BillmanLocal2     pop  8738754631576   \n",
       "9              NaN                              event     NaN            NaN   \n",
       "10           0.455                      BillmanLocal2     pop  3727965196255   \n",
       "11             NaN                              event     NaN            NaN   \n",
       "12           0.709                          manderson     pop  2152499680520   \n",
       "13             NaN                              event     NaN            NaN   \n",
       "14           0.473                          manderson     pop  6064514068524   \n",
       "15             NaN                              event     NaN            NaN   \n",
       "16           0.579                          manderson     pop  3216423906414   \n",
       "17             NaN                              event     NaN            NaN   \n",
       "18           0.536                          manderson     pop  4814336118524   \n",
       "19             NaN                              event     NaN            NaN   \n",
       "20           0.461                          manderson     pop  3175874154129   \n",
       "21             NaN                              event     NaN            NaN   \n",
       "22           0.554                          manderson     pop  6827404859809   \n",
       "23             NaN                              event     NaN            NaN   \n",
       "24           0.931  william.jeffrey.harding@gmail.com     pop  6986617453979   \n",
       "25             NaN                              event     NaN            NaN   \n",
       "26           0.826  william.jeffrey.harding@gmail.com     pop  8646845240336   \n",
       "27             NaN                              event     NaN            NaN   \n",
       "28           0.485  william.jeffrey.harding@gmail.com     pop  1820268905401   \n",
       "29             NaN                              event     NaN            NaN   \n",
       "30           0.762  william.jeffrey.harding@gmail.com     pop  5408205765317   \n",
       "31             NaN                              event     NaN            NaN   \n",
       "32           0.350                      Billmanserver     pop  4271185084463   \n",
       "33             NaN                              event     NaN            NaN   \n",
       "34           0.649                      Billmanserver     pop  4667958701560   \n",
       "35             NaN                              event     NaN            NaN   \n",
       "36           0.327                      Billmanserver     pop  2901583468148   \n",
       "37             NaN                              event     NaN            NaN   \n",
       "38           0.473                      Billmanserver     pop  6707630942353   \n",
       "39             NaN                              event     NaN            NaN   \n",
       "\n",
       "    label                                               text  \\\n",
       "0     pop                                                NaN   \n",
       "1   event  The population (Obattla Magor) inhabiting Dorf...   \n",
       "2     pop                                                NaN   \n",
       "3   event  The population (Obattla Pe) inhabiting Dorf ha...   \n",
       "4     pop                                                NaN   \n",
       "5   event  The population (Obattla Van) inhabiting Dorf h...   \n",
       "6     pop                                                NaN   \n",
       "7   event  The population (Hassia Sin) inhabiting Dorf ha...   \n",
       "8     pop                                                NaN   \n",
       "9   event  The population (Obattla Artes) inhabiting Dorf...   \n",
       "10    pop                                                NaN   \n",
       "11  event  The population (Obattla Ser) inhabiting Dorf h...   \n",
       "12    pop                                                NaN   \n",
       "13  event  The population (Ganjtil Siacarrat) inhabiting ...   \n",
       "14    pop                                                NaN   \n",
       "15  event  The population (Ganjtil Wo) inhabiting Luraszi...   \n",
       "16    pop                                                NaN   \n",
       "17  event  The population (Zopon Haydorfkerberg) inhabiti...   \n",
       "18    pop                                                NaN   \n",
       "19  event  The population (Ganjtil Aytu) inhabiting Luras...   \n",
       "20    pop                                                NaN   \n",
       "21  event  The population (Ganjtil Quabanmarwar) inhabiti...   \n",
       "22    pop                                                NaN   \n",
       "23  event  The population (Zopon Lischarha) inhabiting Lu...   \n",
       "24    pop                                                NaN   \n",
       "25  event  The population (Tilcasport Boupatciace) inhabi...   \n",
       "26    pop                                                NaN   \n",
       "27  event  The population (Tilcasport Siatiapec) inhabiti...   \n",
       "28    pop                                                NaN   \n",
       "29  event  The population (Tilcasport Niaar) inhabiting P...   \n",
       "30    pop                                                NaN   \n",
       "31  event  The population (Tilcasport Enwil) inhabiting P...   \n",
       "32    pop                                                NaN   \n",
       "33  event  The population (Serzeampro Wil) inhabiting Tai...   \n",
       "34    pop                                                NaN   \n",
       "35  event  The population (Ciki Basma) inhabiting Taipe h...   \n",
       "36    pop                                                NaN   \n",
       "37  event  The population (Serzeampro Gradon) inhabiting ...   \n",
       "38    pop                                                NaN   \n",
       "39  event  The population (Ciki Fe) inhabiting Taipe has ...   \n",
       "\n",
       "                            visibleTo     time  \n",
       "0                                 NaN      NaN  \n",
       "1                       BillmanLocal2  28311.0  \n",
       "2                                 NaN      NaN  \n",
       "3                       BillmanLocal2  28311.0  \n",
       "4                                 NaN      NaN  \n",
       "5                       BillmanLocal2  28311.0  \n",
       "6                                 NaN      NaN  \n",
       "7                       BillmanLocal2  28311.0  \n",
       "8                                 NaN      NaN  \n",
       "9                       BillmanLocal2  28311.0  \n",
       "10                                NaN      NaN  \n",
       "11                      BillmanLocal2  28311.0  \n",
       "12                                NaN      NaN  \n",
       "13                          manderson  28311.0  \n",
       "14                                NaN      NaN  \n",
       "15                          manderson  28311.0  \n",
       "16                                NaN      NaN  \n",
       "17                          manderson  28311.0  \n",
       "18                                NaN      NaN  \n",
       "19                          manderson  28311.0  \n",
       "20                                NaN      NaN  \n",
       "21                          manderson  28311.0  \n",
       "22                                NaN      NaN  \n",
       "23                          manderson  28311.0  \n",
       "24                                NaN      NaN  \n",
       "25  william.jeffrey.harding@gmail.com  28311.0  \n",
       "26                                NaN      NaN  \n",
       "27  william.jeffrey.harding@gmail.com  28311.0  \n",
       "28                                NaN      NaN  \n",
       "29  william.jeffrey.harding@gmail.com  28311.0  \n",
       "30                                NaN      NaN  \n",
       "31  william.jeffrey.harding@gmail.com  28311.0  \n",
       "32                                NaN      NaN  \n",
       "33                      Billmanserver  28311.0  \n",
       "34                                NaN      NaN  \n",
       "35                      Billmanserver  28311.0  \n",
       "36                                NaN      NaN  \n",
       "37                      Billmanserver  28311.0  \n",
       "38                                NaN      NaN  \n",
       "39                      Billmanserver  28311.0  "
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.DataFrame.from_records(nodes)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>label</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0913584747812</td>\n",
       "      <td>7467985401518</td>\n",
       "      <td>childOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0913584747812</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>isIn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>0913584747812</td>\n",
       "      <td>4291284873310</td>\n",
       "      <td>isOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0913584747812</td>\n",
       "      <td>2972908340606</td>\n",
       "      <td>inhabits</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0630745128207</td>\n",
       "      <td>5100638967625</td>\n",
       "      <td>childOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75</th>\n",
       "      <td>2901583468148</td>\n",
       "      <td>8490894854096</td>\n",
       "      <td>inhabits</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>76</th>\n",
       "      <td>6707630942353</td>\n",
       "      <td>8876287369940</td>\n",
       "      <td>childOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>77</th>\n",
       "      <td>6707630942353</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>isIn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>78</th>\n",
       "      <td>6707630942353</td>\n",
       "      <td>5478087080681</td>\n",
       "      <td>isOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>79</th>\n",
       "      <td>6707630942353</td>\n",
       "      <td>8490894854096</td>\n",
       "      <td>inhabits</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>80 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "            node1          node2     label\n",
       "0   0913584747812  7467985401518   childOf\n",
       "1   0913584747812  8822366435138      isIn\n",
       "2   0913584747812  4291284873310      isOf\n",
       "3   0913584747812  2972908340606  inhabits\n",
       "4   0630745128207  5100638967625   childOf\n",
       "..            ...            ...       ...\n",
       "75  2901583468148  8490894854096  inhabits\n",
       "76  6707630942353  8876287369940   childOf\n",
       "77  6707630942353  0015468195520      isIn\n",
       "78  6707630942353  5478087080681      isOf\n",
       "79  6707630942353  8490894854096  inhabits\n",
       "\n",
       "[80 rows x 3 columns]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.DataFrame.from_records(edges)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[\"\\n        g.V().has('objid','7184852353123')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','7467985401518')\\n            .addE('caused')\\n            .to(g.V().has('objid','7184852353123'))\\n        \",\n",
       " \"\\n        g.V().has('objid','2196391002317')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','5100638967625')\\n            .addE('caused')\\n            .to(g.V().has('objid','2196391002317'))\\n        \",\n",
       " \"\\n        g.V().has('objid','7356076059018')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','1800951322768')\\n            .addE('caused')\\n            .to(g.V().has('objid','7356076059018'))\\n        \",\n",
       " \"\\n        g.V().has('objid','2276175445082')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','0248671359952')\\n            .addE('caused')\\n            .to(g.V().has('objid','2276175445082'))\\n        \",\n",
       " \"\\n        g.V().has('objid','5497131605023')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','9819392335838')\\n            .addE('caused')\\n            .to(g.V().has('objid','5497131605023'))\\n        \",\n",
       " \"\\n        g.V().has('objid','0690887141373')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','7828874183454')\\n            .addE('caused')\\n            .to(g.V().has('objid','0690887141373'))\\n        \",\n",
       " \"\\n        g.V().has('objid','4840616715473')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','5640544774717'))\\n        \",\n",
       " \"\\n        g.V().has('objid','3446159101358')\\n            .addE('caused')\\n            .to(g.V().has('objid','4840616715473'))\\n        \",\n",
       " \"\\n        g.V().has('objid','4703077847671')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','5640544774717'))\\n        \",\n",
       " \"\\n        g.V().has('objid','9552341693154')\\n            .addE('caused')\\n            .to(g.V().has('objid','4703077847671'))\\n        \",\n",
       " \"\\n        g.V().has('objid','0775878869326')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','5640544774717'))\\n        \",\n",
       " \"\\n        g.V().has('objid','1417654942596')\\n            .addE('caused')\\n            .to(g.V().has('objid','0775878869326'))\\n        \",\n",
       " \"\\n        g.V().has('objid','7345988827345')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','5640544774717'))\\n        \",\n",
       " \"\\n        g.V().has('objid','4772723923474')\\n            .addE('caused')\\n            .to(g.V().has('objid','7345988827345'))\\n        \",\n",
       " \"\\n        g.V().has('objid','6378902062013')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','5640544774717'))\\n        \",\n",
       " \"\\n        g.V().has('objid','1786540026813')\\n            .addE('caused')\\n            .to(g.V().has('objid','6378902062013'))\\n        \",\n",
       " \"\\n        g.V().has('objid','8513510577003')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','5640544774717'))\\n        \",\n",
       " \"\\n        g.V().has('objid','2152501246930')\\n            .addE('caused')\\n            .to(g.V().has('objid','8513510577003'))\\n        \",\n",
       " \"\\n        g.V().has('objid','5260747328170')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2816844503430'))\\n        \",\n",
       " \"\\n        g.V().has('objid','4742850136180')\\n            .addE('caused')\\n            .to(g.V().has('objid','5260747328170'))\\n        \",\n",
       " \"\\n        g.V().has('objid','7782388659825')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2816844503430'))\\n        \",\n",
       " \"\\n        g.V().has('objid','5669843388137')\\n            .addE('caused')\\n            .to(g.V().has('objid','7782388659825'))\\n        \",\n",
       " \"\\n        g.V().has('objid','3200486583332')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2816844503430'))\\n        \",\n",
       " \"\\n        g.V().has('objid','7036253430140')\\n            .addE('caused')\\n            .to(g.V().has('objid','3200486583332'))\\n        \",\n",
       " \"\\n        g.V().has('objid','4526569155793')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2816844503430'))\\n        \",\n",
       " \"\\n        g.V().has('objid','3440955961419')\\n            .addE('caused')\\n            .to(g.V().has('objid','4526569155793'))\\n        \",\n",
       " \"\\n        g.V().has('objid','2919916850958')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','8490894854096'))\\n        \",\n",
       " \"\\n        g.V().has('objid','1772981049949')\\n            .addE('caused')\\n            .to(g.V().has('objid','2919916850958'))\\n        \",\n",
       " \"\\n        g.V().has('objid','4183534367737')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','8490894854096'))\\n        \",\n",
       " \"\\n        g.V().has('objid','1247897538416')\\n            .addE('caused')\\n            .to(g.V().has('objid','4183534367737'))\\n        \",\n",
       " \"\\n        g.V().has('objid','4606339513308')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','8490894854096'))\\n        \",\n",
       " \"\\n        g.V().has('objid','8096543483724')\\n            .addE('caused')\\n            .to(g.V().has('objid','4606339513308'))\\n        \",\n",
       " \"\\n        g.V().has('objid','6276059687128')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','8490894854096'))\\n        \",\n",
       " \"\\n        g.V().has('objid','8876287369940')\\n            .addE('caused')\\n            .to(g.V().has('objid','6276059687128'))\\n        \"]"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "event_edges"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [],
   "source": [
    "growth.grow(c,params,syllables)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "c.upload_data()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "exoplanets",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.16"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "625a17269cb94aebb094cbcf5e0e8340f26b69d46569da60e8fc69439048adbf"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
