{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Managing population growth"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys\n",
    "import numpy as np\n",
    "import pandas as pd\n",
    "import altair as alt\n",
    "sys.path.append('..')\n",
    "import helpers.dbquery as db\n",
    "import helpers.functions as f\n",
    "import yaml, ssl, asyncio, pickle, os, ast\n",
    "import nb_black\n",
    "\n",
    "ssl._create_default_https_context = ssl._create_unverified_context\n",
    "asyncio.set_event_loop_policy(asyncio.WindowsSelectorEventLoopPolicy())\n",
    "import nest_asyncio\n",
    "# this is required for running in a Jupyter Notebook. \n",
    "nest_asyncio.apply()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "# mapping to the modules that make the app\n",
    "sys.path.insert(0, \"../../app\")\n",
    "sys.path.insert(0, \"../../functions/popgrowth\")\n",
    "\n",
    "sys.path.insert\n",
    "import models\n",
    "\n",
    "c = models.CosmosdbClient()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'pop_health_requirement': 0.6,\n",
       " 'pop_consumes': 2,\n",
       " 'starve_damage': 0.05,\n",
       " 'changing_values': ['conformity',\n",
       "  'literacy',\n",
       "  'aggression',\n",
       "  'constitution',\n",
       "  'wealth',\n",
       "  'factionLoyalty']}"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "params = yaml.safe_load(open(os.path.join(os.getenv(\"abspath\"),\"functions/popgrowth/settings.yml\")))\n",
    "syllables = pickle.load(open(os.path.join(os.getenv(\"abspath\"),\"app/creators/specs/syllables.p\"), \"rb\"))\n",
    "username = 'notebook'\n",
    "params"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Time is updated by the `time` function. It is always running."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'currentTime': 25797,\n",
       " 'updatedFrom': 'azfunction',\n",
       " 'updatedAt': '2023-03-15 12:40:00.675402',\n",
       " 'objid': '7263327370874',\n",
       " 'name': 'time',\n",
       " 'originTime': 0,\n",
       " 'username': 'notebook',\n",
       " 'objtype': 'time',\n",
       " 'id': '7263327370874'}"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "c.run_query(\"g.V().hasLabel('time').valueMap()\")\n",
    "params['time'] = c.clean_nodes(c.res)[0]\n",
    "params['time']"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "For this notebook, setting the `pop_health_requirement` to an arbitrary value just to examine."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "params['pop_health_requirement'] = 0.4"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Population Resource Consumption"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "from tools import consumption"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>conformity</th>\n",
       "      <th>literacy</th>\n",
       "      <th>aggression</th>\n",
       "      <th>constitution</th>\n",
       "      <th>health</th>\n",
       "      <th>isInFaction</th>\n",
       "      <th>industry</th>\n",
       "      <th>wealth</th>\n",
       "      <th>factionLoyalty</th>\n",
       "      <th>isIdle</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Rinmayherdroegaonbad Pestlan</td>\n",
       "      <td>2065545354087</td>\n",
       "      <td>0.719</td>\n",
       "      <td>0.445</td>\n",
       "      <td>0.484</td>\n",
       "      <td>0.601</td>\n",
       "      <td>0.50</td>\n",
       "      <td>5700878531117</td>\n",
       "      <td>0.5425</td>\n",
       "      <td>0.4938</td>\n",
       "      <td>0.722</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal</td>\n",
       "      <td>pop</td>\n",
       "      <td>2065545354087</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Uniabrafalefanak Batheights</td>\n",
       "      <td>2297177711622</td>\n",
       "      <td>0.549</td>\n",
       "      <td>0.425</td>\n",
       "      <td>0.319</td>\n",
       "      <td>0.711</td>\n",
       "      <td>0.50</td>\n",
       "      <td>1948134031021</td>\n",
       "      <td>0.5150</td>\n",
       "      <td>0.4700</td>\n",
       "      <td>0.724</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal</td>\n",
       "      <td>pop</td>\n",
       "      <td>2297177711622</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Ping Har</td>\n",
       "      <td>6116290971359</td>\n",
       "      <td>0.537</td>\n",
       "      <td>0.541</td>\n",
       "      <td>0.721</td>\n",
       "      <td>0.944</td>\n",
       "      <td>0.50</td>\n",
       "      <td>7750107587129</td>\n",
       "      <td>0.8325</td>\n",
       "      <td>0.6368</td>\n",
       "      <td>0.736</td>\n",
       "      <td>true</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>6116290971359</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Bengarford Ge</td>\n",
       "      <td>8751304618851</td>\n",
       "      <td>0.373</td>\n",
       "      <td>0.636</td>\n",
       "      <td>0.487</td>\n",
       "      <td>1.031</td>\n",
       "      <td>0.50</td>\n",
       "      <td>3297014580825</td>\n",
       "      <td>0.7090</td>\n",
       "      <td>0.5725</td>\n",
       "      <td>0.311</td>\n",
       "      <td>true</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>8751304618851</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Cantadt West</td>\n",
       "      <td>7678594134970</td>\n",
       "      <td>0.666</td>\n",
       "      <td>0.473</td>\n",
       "      <td>0.515</td>\n",
       "      <td>0.633</td>\n",
       "      <td>0.50</td>\n",
       "      <td>7123108087598</td>\n",
       "      <td>0.5240</td>\n",
       "      <td>0.3485</td>\n",
       "      <td>0.627</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>7678594134970</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Cantadt Ho</td>\n",
       "      <td>8027372513635</td>\n",
       "      <td>0.552</td>\n",
       "      <td>0.583</td>\n",
       "      <td>0.641</td>\n",
       "      <td>0.577</td>\n",
       "      <td>0.50</td>\n",
       "      <td>7123108087598</td>\n",
       "      <td>0.5590</td>\n",
       "      <td>0.5160</td>\n",
       "      <td>0.574</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>8027372513635</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Yuri War</td>\n",
       "      <td>1941048076759</td>\n",
       "      <td>0.451</td>\n",
       "      <td>0.439</td>\n",
       "      <td>0.617</td>\n",
       "      <td>0.342</td>\n",
       "      <td>0.50</td>\n",
       "      <td>0063686827678</td>\n",
       "      <td>0.4295</td>\n",
       "      <td>0.3342</td>\n",
       "      <td>0.372</td>\n",
       "      <td>false</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>1941048076759</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Cantadt Gonrean</td>\n",
       "      <td>0504248736284</td>\n",
       "      <td>0.464</td>\n",
       "      <td>0.583</td>\n",
       "      <td>0.584</td>\n",
       "      <td>0.792</td>\n",
       "      <td>0.50</td>\n",
       "      <td>7123108087598</td>\n",
       "      <td>0.6380</td>\n",
       "      <td>0.5105</td>\n",
       "      <td>0.538</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>0504248736284</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Cantadt Kha</td>\n",
       "      <td>0366602777869</td>\n",
       "      <td>0.549</td>\n",
       "      <td>0.560</td>\n",
       "      <td>0.586</td>\n",
       "      <td>0.551</td>\n",
       "      <td>0.50</td>\n",
       "      <td>7123108087598</td>\n",
       "      <td>0.5435</td>\n",
       "      <td>0.5018</td>\n",
       "      <td>0.491</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>0366602777869</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Yuri Astau</td>\n",
       "      <td>5010780035102</td>\n",
       "      <td>0.446</td>\n",
       "      <td>0.361</td>\n",
       "      <td>0.541</td>\n",
       "      <td>0.441</td>\n",
       "      <td>0.50</td>\n",
       "      <td>0063686827678</td>\n",
       "      <td>0.4660</td>\n",
       "      <td>0.3635</td>\n",
       "      <td>0.234</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>5010780035102</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Cantadt Tehia</td>\n",
       "      <td>7219027251170</td>\n",
       "      <td>0.747</td>\n",
       "      <td>0.401</td>\n",
       "      <td>0.460</td>\n",
       "      <td>0.460</td>\n",
       "      <td>0.50</td>\n",
       "      <td>7123108087598</td>\n",
       "      <td>0.4350</td>\n",
       "      <td>0.3680</td>\n",
       "      <td>0.748</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>7219027251170</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Quefloe Koykipi</td>\n",
       "      <td>7579740112190</td>\n",
       "      <td>0.227</td>\n",
       "      <td>0.529</td>\n",
       "      <td>0.498</td>\n",
       "      <td>0.797</td>\n",
       "      <td>-0.05</td>\n",
       "      <td>9206848046216</td>\n",
       "      <td>0.8225</td>\n",
       "      <td>0.3258</td>\n",
       "      <td>0.295</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>7579740112190</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Wahianakpuerkunroy En</td>\n",
       "      <td>7867488530067</td>\n",
       "      <td>0.381</td>\n",
       "      <td>0.616</td>\n",
       "      <td>0.415</td>\n",
       "      <td>0.475</td>\n",
       "      <td>-0.05</td>\n",
       "      <td>5941482846064</td>\n",
       "      <td>0.4450</td>\n",
       "      <td>0.5305</td>\n",
       "      <td>0.530</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>7867488530067</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Potalnyfifehra Fater</td>\n",
       "      <td>3371978602049</td>\n",
       "      <td>0.607</td>\n",
       "      <td>0.813</td>\n",
       "      <td>0.509</td>\n",
       "      <td>0.592</td>\n",
       "      <td>-0.05</td>\n",
       "      <td>7921216900082</td>\n",
       "      <td>0.5505</td>\n",
       "      <td>0.6818</td>\n",
       "      <td>0.533</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>3371978602049</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Quefloe Wes</td>\n",
       "      <td>7274998996179</td>\n",
       "      <td>0.256</td>\n",
       "      <td>0.952</td>\n",
       "      <td>0.410</td>\n",
       "      <td>0.960</td>\n",
       "      <td>-0.05</td>\n",
       "      <td>9206848046216</td>\n",
       "      <td>0.6600</td>\n",
       "      <td>0.6060</td>\n",
       "      <td>0.442</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>7274998996179</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Wahianakpuerkunroy Kaidelmundugroga</td>\n",
       "      <td>8840744086966</td>\n",
       "      <td>0.353</td>\n",
       "      <td>0.514</td>\n",
       "      <td>0.491</td>\n",
       "      <td>0.468</td>\n",
       "      <td>-0.05</td>\n",
       "      <td>5941482846064</td>\n",
       "      <td>0.4795</td>\n",
       "      <td>0.3918</td>\n",
       "      <td>0.319</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>8840744086966</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Wahianakpuerkunroy Rah</td>\n",
       "      <td>6243860490710</td>\n",
       "      <td>0.287</td>\n",
       "      <td>0.459</td>\n",
       "      <td>0.344</td>\n",
       "      <td>0.589</td>\n",
       "      <td>-0.05</td>\n",
       "      <td>5941482846064</td>\n",
       "      <td>0.4665</td>\n",
       "      <td>0.4628</td>\n",
       "      <td>0.385</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>6243860490710</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Quefloe Pe</td>\n",
       "      <td>3651889933541</td>\n",
       "      <td>0.601</td>\n",
       "      <td>0.443</td>\n",
       "      <td>0.382</td>\n",
       "      <td>0.832</td>\n",
       "      <td>-0.05</td>\n",
       "      <td>9206848046216</td>\n",
       "      <td>0.5820</td>\n",
       "      <td>0.4625</td>\n",
       "      <td>0.535</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>3651889933541</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Jevil Maudelpuer</td>\n",
       "      <td>4489494408384</td>\n",
       "      <td>0.276</td>\n",
       "      <td>0.678</td>\n",
       "      <td>0.418</td>\n",
       "      <td>0.460</td>\n",
       "      <td>0.50</td>\n",
       "      <td>4715898613220</td>\n",
       "      <td>0.4390</td>\n",
       "      <td>0.5585</td>\n",
       "      <td>0.104</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanworklaptop</td>\n",
       "      <td>pop</td>\n",
       "      <td>4489494408384</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Ganjbelenman Sel</td>\n",
       "      <td>1854617875967</td>\n",
       "      <td>0.511</td>\n",
       "      <td>0.623</td>\n",
       "      <td>0.494</td>\n",
       "      <td>0.641</td>\n",
       "      <td>0.50</td>\n",
       "      <td>4458292620079</td>\n",
       "      <td>0.5675</td>\n",
       "      <td>0.5953</td>\n",
       "      <td>0.443</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanworklaptop</td>\n",
       "      <td>pop</td>\n",
       "      <td>1854617875967</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Jevil Tle</td>\n",
       "      <td>3195762230526</td>\n",
       "      <td>0.408</td>\n",
       "      <td>0.767</td>\n",
       "      <td>0.325</td>\n",
       "      <td>0.596</td>\n",
       "      <td>0.50</td>\n",
       "      <td>4715898613220</td>\n",
       "      <td>0.4355</td>\n",
       "      <td>0.5513</td>\n",
       "      <td>0.289</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanworklaptop</td>\n",
       "      <td>pop</td>\n",
       "      <td>3195762230526</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Ganjbelenman Guilai</td>\n",
       "      <td>8866282869531</td>\n",
       "      <td>0.487</td>\n",
       "      <td>0.446</td>\n",
       "      <td>0.455</td>\n",
       "      <td>0.601</td>\n",
       "      <td>0.50</td>\n",
       "      <td>4458292620079</td>\n",
       "      <td>0.5280</td>\n",
       "      <td>0.4870</td>\n",
       "      <td>0.466</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanworklaptop</td>\n",
       "      <td>pop</td>\n",
       "      <td>8866282869531</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Raylarlaidi Ji</td>\n",
       "      <td>1097163958614</td>\n",
       "      <td>0.382</td>\n",
       "      <td>0.354</td>\n",
       "      <td>0.408</td>\n",
       "      <td>0.751</td>\n",
       "      <td>0.50</td>\n",
       "      <td>4392968341435</td>\n",
       "      <td>0.5795</td>\n",
       "      <td>0.4668</td>\n",
       "      <td>0.556</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanworklaptop</td>\n",
       "      <td>pop</td>\n",
       "      <td>1097163958614</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Ganjbelenman Ven</td>\n",
       "      <td>5187047269423</td>\n",
       "      <td>0.438</td>\n",
       "      <td>0.482</td>\n",
       "      <td>0.345</td>\n",
       "      <td>0.550</td>\n",
       "      <td>0.50</td>\n",
       "      <td>4458292620079</td>\n",
       "      <td>0.4475</td>\n",
       "      <td>0.4648</td>\n",
       "      <td>0.436</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanworklaptop</td>\n",
       "      <td>pop</td>\n",
       "      <td>5187047269423</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Raylarlaidi Tadt</td>\n",
       "      <td>6374013229289</td>\n",
       "      <td>0.223</td>\n",
       "      <td>0.403</td>\n",
       "      <td>0.387</td>\n",
       "      <td>0.522</td>\n",
       "      <td>0.50</td>\n",
       "      <td>4392968341435</td>\n",
       "      <td>0.4545</td>\n",
       "      <td>0.4288</td>\n",
       "      <td>0.150</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanworklaptop</td>\n",
       "      <td>pop</td>\n",
       "      <td>6374013229289</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Beigarrattle Ke</td>\n",
       "      <td>4683512749902</td>\n",
       "      <td>0.496</td>\n",
       "      <td>0.478</td>\n",
       "      <td>0.387</td>\n",
       "      <td>0.644</td>\n",
       "      <td>0.50</td>\n",
       "      <td>3679071570839</td>\n",
       "      <td>0.4905</td>\n",
       "      <td>0.4342</td>\n",
       "      <td>0.435</td>\n",
       "      <td>true</td>\n",
       "      <td>hapanin</td>\n",
       "      <td>pop</td>\n",
       "      <td>4683512749902</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>Beigarrattle Mu</td>\n",
       "      <td>3592786300484</td>\n",
       "      <td>0.651</td>\n",
       "      <td>0.420</td>\n",
       "      <td>0.584</td>\n",
       "      <td>0.577</td>\n",
       "      <td>0.50</td>\n",
       "      <td>3679071570839</td>\n",
       "      <td>0.5305</td>\n",
       "      <td>0.4752</td>\n",
       "      <td>0.582</td>\n",
       "      <td>true</td>\n",
       "      <td>hapanin</td>\n",
       "      <td>pop</td>\n",
       "      <td>3592786300484</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Dostuuntreergranwan Porwal</td>\n",
       "      <td>3328625419254</td>\n",
       "      <td>0.560</td>\n",
       "      <td>0.675</td>\n",
       "      <td>0.500</td>\n",
       "      <td>0.466</td>\n",
       "      <td>0.50</td>\n",
       "      <td>2373196634640</td>\n",
       "      <td>0.5330</td>\n",
       "      <td>0.5290</td>\n",
       "      <td>0.763</td>\n",
       "      <td>true</td>\n",
       "      <td>hapanin</td>\n",
       "      <td>pop</td>\n",
       "      <td>3328625419254</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>Dostuuntreergranwan Quibabang</td>\n",
       "      <td>2439538385497</td>\n",
       "      <td>0.646</td>\n",
       "      <td>0.577</td>\n",
       "      <td>0.605</td>\n",
       "      <td>0.577</td>\n",
       "      <td>0.50</td>\n",
       "      <td>2373196634640</td>\n",
       "      <td>0.5910</td>\n",
       "      <td>0.5840</td>\n",
       "      <td>0.585</td>\n",
       "      <td>true</td>\n",
       "      <td>hapanin</td>\n",
       "      <td>pop</td>\n",
       "      <td>2439538385497</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Beigarrattle Segor</td>\n",
       "      <td>2843028072570</td>\n",
       "      <td>0.492</td>\n",
       "      <td>0.293</td>\n",
       "      <td>0.604</td>\n",
       "      <td>0.498</td>\n",
       "      <td>0.50</td>\n",
       "      <td>3679071570839</td>\n",
       "      <td>0.5510</td>\n",
       "      <td>0.3170</td>\n",
       "      <td>0.668</td>\n",
       "      <td>true</td>\n",
       "      <td>hapanin</td>\n",
       "      <td>pop</td>\n",
       "      <td>2843028072570</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>Dostuuntreergranwan Wo</td>\n",
       "      <td>3458460170960</td>\n",
       "      <td>0.531</td>\n",
       "      <td>0.706</td>\n",
       "      <td>0.494</td>\n",
       "      <td>0.415</td>\n",
       "      <td>0.50</td>\n",
       "      <td>2373196634640</td>\n",
       "      <td>0.4545</td>\n",
       "      <td>0.5802</td>\n",
       "      <td>0.472</td>\n",
       "      <td>true</td>\n",
       "      <td>hapanin</td>\n",
       "      <td>pop</td>\n",
       "      <td>3458460170960</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>Beigarrattle Ping</td>\n",
       "      <td>7126259274391</td>\n",
       "      <td>0.567</td>\n",
       "      <td>0.466</td>\n",
       "      <td>0.418</td>\n",
       "      <td>0.518</td>\n",
       "      <td>0.50</td>\n",
       "      <td>3679071570839</td>\n",
       "      <td>0.4680</td>\n",
       "      <td>0.4670</td>\n",
       "      <td>0.676</td>\n",
       "      <td>true</td>\n",
       "      <td>hapanin</td>\n",
       "      <td>pop</td>\n",
       "      <td>7126259274391</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                   name          objid  conformity  literacy  \\\n",
       "0          Rinmayherdroegaonbad Pestlan  2065545354087       0.719     0.445   \n",
       "1           Uniabrafalefanak Batheights  2297177711622       0.549     0.425   \n",
       "2                              Ping Har  6116290971359       0.537     0.541   \n",
       "3                         Bengarford Ge  8751304618851       0.373     0.636   \n",
       "4                          Cantadt West  7678594134970       0.666     0.473   \n",
       "5                            Cantadt Ho  8027372513635       0.552     0.583   \n",
       "6                              Yuri War  1941048076759       0.451     0.439   \n",
       "7                       Cantadt Gonrean  0504248736284       0.464     0.583   \n",
       "8                           Cantadt Kha  0366602777869       0.549     0.560   \n",
       "9                            Yuri Astau  5010780035102       0.446     0.361   \n",
       "10                        Cantadt Tehia  7219027251170       0.747     0.401   \n",
       "11                      Quefloe Koykipi  7579740112190       0.227     0.529   \n",
       "12                Wahianakpuerkunroy En  7867488530067       0.381     0.616   \n",
       "13                 Potalnyfifehra Fater  3371978602049       0.607     0.813   \n",
       "14                          Quefloe Wes  7274998996179       0.256     0.952   \n",
       "15  Wahianakpuerkunroy Kaidelmundugroga  8840744086966       0.353     0.514   \n",
       "16               Wahianakpuerkunroy Rah  6243860490710       0.287     0.459   \n",
       "17                           Quefloe Pe  3651889933541       0.601     0.443   \n",
       "18                     Jevil Maudelpuer  4489494408384       0.276     0.678   \n",
       "19                     Ganjbelenman Sel  1854617875967       0.511     0.623   \n",
       "20                            Jevil Tle  3195762230526       0.408     0.767   \n",
       "21                  Ganjbelenman Guilai  8866282869531       0.487     0.446   \n",
       "22                       Raylarlaidi Ji  1097163958614       0.382     0.354   \n",
       "23                     Ganjbelenman Ven  5187047269423       0.438     0.482   \n",
       "24                     Raylarlaidi Tadt  6374013229289       0.223     0.403   \n",
       "25                      Beigarrattle Ke  4683512749902       0.496     0.478   \n",
       "26                      Beigarrattle Mu  3592786300484       0.651     0.420   \n",
       "27           Dostuuntreergranwan Porwal  3328625419254       0.560     0.675   \n",
       "28        Dostuuntreergranwan Quibabang  2439538385497       0.646     0.577   \n",
       "29                   Beigarrattle Segor  2843028072570       0.492     0.293   \n",
       "30               Dostuuntreergranwan Wo  3458460170960       0.531     0.706   \n",
       "31                    Beigarrattle Ping  7126259274391       0.567     0.466   \n",
       "\n",
       "    aggression  constitution  health    isInFaction  industry  wealth  \\\n",
       "0        0.484         0.601    0.50  5700878531117    0.5425  0.4938   \n",
       "1        0.319         0.711    0.50  1948134031021    0.5150  0.4700   \n",
       "2        0.721         0.944    0.50  7750107587129    0.8325  0.6368   \n",
       "3        0.487         1.031    0.50  3297014580825    0.7090  0.5725   \n",
       "4        0.515         0.633    0.50  7123108087598    0.5240  0.3485   \n",
       "5        0.641         0.577    0.50  7123108087598    0.5590  0.5160   \n",
       "6        0.617         0.342    0.50  0063686827678    0.4295  0.3342   \n",
       "7        0.584         0.792    0.50  7123108087598    0.6380  0.5105   \n",
       "8        0.586         0.551    0.50  7123108087598    0.5435  0.5018   \n",
       "9        0.541         0.441    0.50  0063686827678    0.4660  0.3635   \n",
       "10       0.460         0.460    0.50  7123108087598    0.4350  0.3680   \n",
       "11       0.498         0.797   -0.05  9206848046216    0.8225  0.3258   \n",
       "12       0.415         0.475   -0.05  5941482846064    0.4450  0.5305   \n",
       "13       0.509         0.592   -0.05  7921216900082    0.5505  0.6818   \n",
       "14       0.410         0.960   -0.05  9206848046216    0.6600  0.6060   \n",
       "15       0.491         0.468   -0.05  5941482846064    0.4795  0.3918   \n",
       "16       0.344         0.589   -0.05  5941482846064    0.4665  0.4628   \n",
       "17       0.382         0.832   -0.05  9206848046216    0.5820  0.4625   \n",
       "18       0.418         0.460    0.50  4715898613220    0.4390  0.5585   \n",
       "19       0.494         0.641    0.50  4458292620079    0.5675  0.5953   \n",
       "20       0.325         0.596    0.50  4715898613220    0.4355  0.5513   \n",
       "21       0.455         0.601    0.50  4458292620079    0.5280  0.4870   \n",
       "22       0.408         0.751    0.50  4392968341435    0.5795  0.4668   \n",
       "23       0.345         0.550    0.50  4458292620079    0.4475  0.4648   \n",
       "24       0.387         0.522    0.50  4392968341435    0.4545  0.4288   \n",
       "25       0.387         0.644    0.50  3679071570839    0.4905  0.4342   \n",
       "26       0.584         0.577    0.50  3679071570839    0.5305  0.4752   \n",
       "27       0.500         0.466    0.50  2373196634640    0.5330  0.5290   \n",
       "28       0.605         0.577    0.50  2373196634640    0.5910  0.5840   \n",
       "29       0.604         0.498    0.50  3679071570839    0.5510  0.3170   \n",
       "30       0.494         0.415    0.50  2373196634640    0.4545  0.5802   \n",
       "31       0.418         0.518    0.50  3679071570839    0.4680  0.4670   \n",
       "\n",
       "    factionLoyalty isIdle                           username objtype  \\\n",
       "0            0.722   true                       BillmanLocal     pop   \n",
       "1            0.724   true                       BillmanLocal     pop   \n",
       "2            0.736   true  william.jeffrey.harding@gmail.com     pop   \n",
       "3            0.311   true  william.jeffrey.harding@gmail.com     pop   \n",
       "4            0.627   true                      BillmanLocal2     pop   \n",
       "5            0.574   true                      BillmanLocal2     pop   \n",
       "6            0.372  false                      BillmanLocal2     pop   \n",
       "7            0.538   true                      BillmanLocal2     pop   \n",
       "8            0.491   true                      BillmanLocal2     pop   \n",
       "9            0.234   true                      BillmanLocal2     pop   \n",
       "10           0.748   true                      BillmanLocal2     pop   \n",
       "11           0.295   true                      Billmanserver     pop   \n",
       "12           0.530   true                      Billmanserver     pop   \n",
       "13           0.533   true                      Billmanserver     pop   \n",
       "14           0.442   true                      Billmanserver     pop   \n",
       "15           0.319   true                      Billmanserver     pop   \n",
       "16           0.385   true                      Billmanserver     pop   \n",
       "17           0.535   true                      Billmanserver     pop   \n",
       "18           0.104   true                  Billmanworklaptop     pop   \n",
       "19           0.443   true                  Billmanworklaptop     pop   \n",
       "20           0.289   true                  Billmanworklaptop     pop   \n",
       "21           0.466   true                  Billmanworklaptop     pop   \n",
       "22           0.556   true                  Billmanworklaptop     pop   \n",
       "23           0.436   true                  Billmanworklaptop     pop   \n",
       "24           0.150   true                  Billmanworklaptop     pop   \n",
       "25           0.435   true                            hapanin     pop   \n",
       "26           0.582   true                            hapanin     pop   \n",
       "27           0.763   true                            hapanin     pop   \n",
       "28           0.585   true                            hapanin     pop   \n",
       "29           0.668   true                            hapanin     pop   \n",
       "30           0.472   true                            hapanin     pop   \n",
       "31           0.676   true                            hapanin     pop   \n",
       "\n",
       "               id  \n",
       "0   2065545354087  \n",
       "1   2297177711622  \n",
       "2   6116290971359  \n",
       "3   8751304618851  \n",
       "4   7678594134970  \n",
       "5   8027372513635  \n",
       "6   1941048076759  \n",
       "7   0504248736284  \n",
       "8   0366602777869  \n",
       "9   5010780035102  \n",
       "10  7219027251170  \n",
       "11  7579740112190  \n",
       "12  7867488530067  \n",
       "13  3371978602049  \n",
       "14  7274998996179  \n",
       "15  8840744086966  \n",
       "16  6243860490710  \n",
       "17  3651889933541  \n",
       "18  4489494408384  \n",
       "19  1854617875967  \n",
       "20  3195762230526  \n",
       "21  8866282869531  \n",
       "22  1097163958614  \n",
       "23  5187047269423  \n",
       "24  6374013229289  \n",
       "25  4683512749902  \n",
       "26  3592786300484  \n",
       "27  3328625419254  \n",
       "28  2439538385497  \n",
       "29  2843028072570  \n",
       "30  3458460170960  \n",
       "31  7126259274391  "
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pops_df,species_df,locations_df = consumption.all_pops_consumption(c)\n",
    "pops_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>consumes</th>\n",
       "      <th>effuses</th>\n",
       "      <th>viral_resilience</th>\n",
       "      <th>habitat_resilience</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Belneurei</td>\n",
       "      <td>7635975712366</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal</td>\n",
       "      <td>species</td>\n",
       "      <td>7635975712366</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Belneurei</td>\n",
       "      <td>7635975712366</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal</td>\n",
       "      <td>species</td>\n",
       "      <td>7635975712366</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Tlasi</td>\n",
       "      <td>9841299620766</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>species</td>\n",
       "      <td>9841299620766</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Tlasi</td>\n",
       "      <td>9841299620766</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>species</td>\n",
       "      <td>9841299620766</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Pin</td>\n",
       "      <td>7609897667067</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>7609897667067</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Pin</td>\n",
       "      <td>7609897667067</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>7609897667067</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Pin</td>\n",
       "      <td>7609897667067</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>7609897667067</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Pin</td>\n",
       "      <td>7609897667067</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>7609897667067</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Pin</td>\n",
       "      <td>7609897667067</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>7609897667067</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Pin</td>\n",
       "      <td>7609897667067</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>7609897667067</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Pin</td>\n",
       "      <td>7609897667067</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>7609897667067</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Tor</td>\n",
       "      <td>5876090004383</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>species</td>\n",
       "      <td>5876090004383</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Tor</td>\n",
       "      <td>5876090004383</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>species</td>\n",
       "      <td>5876090004383</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Tor</td>\n",
       "      <td>5876090004383</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>species</td>\n",
       "      <td>5876090004383</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Tor</td>\n",
       "      <td>5876090004383</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>species</td>\n",
       "      <td>5876090004383</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Tor</td>\n",
       "      <td>5876090004383</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>species</td>\n",
       "      <td>5876090004383</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Tor</td>\n",
       "      <td>5876090004383</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>species</td>\n",
       "      <td>5876090004383</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Tor</td>\n",
       "      <td>5876090004383</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>species</td>\n",
       "      <td>5876090004383</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Koujunubeach</td>\n",
       "      <td>1393979728845</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanworklaptop</td>\n",
       "      <td>species</td>\n",
       "      <td>1393979728845</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Koujunubeach</td>\n",
       "      <td>1393979728845</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanworklaptop</td>\n",
       "      <td>species</td>\n",
       "      <td>1393979728845</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Koujunubeach</td>\n",
       "      <td>1393979728845</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanworklaptop</td>\n",
       "      <td>species</td>\n",
       "      <td>1393979728845</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Koujunubeach</td>\n",
       "      <td>1393979728845</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanworklaptop</td>\n",
       "      <td>species</td>\n",
       "      <td>1393979728845</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Koujunubeach</td>\n",
       "      <td>1393979728845</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanworklaptop</td>\n",
       "      <td>species</td>\n",
       "      <td>1393979728845</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Koujunubeach</td>\n",
       "      <td>1393979728845</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanworklaptop</td>\n",
       "      <td>species</td>\n",
       "      <td>1393979728845</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Koujunubeach</td>\n",
       "      <td>1393979728845</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanworklaptop</td>\n",
       "      <td>species</td>\n",
       "      <td>1393979728845</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Roc</td>\n",
       "      <td>3880668155868</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>hapanin</td>\n",
       "      <td>species</td>\n",
       "      <td>3880668155868</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>Roc</td>\n",
       "      <td>3880668155868</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>hapanin</td>\n",
       "      <td>species</td>\n",
       "      <td>3880668155868</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Roc</td>\n",
       "      <td>3880668155868</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>hapanin</td>\n",
       "      <td>species</td>\n",
       "      <td>3880668155868</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>Roc</td>\n",
       "      <td>3880668155868</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>hapanin</td>\n",
       "      <td>species</td>\n",
       "      <td>3880668155868</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Roc</td>\n",
       "      <td>3880668155868</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>hapanin</td>\n",
       "      <td>species</td>\n",
       "      <td>3880668155868</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>Roc</td>\n",
       "      <td>3880668155868</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>hapanin</td>\n",
       "      <td>species</td>\n",
       "      <td>3880668155868</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>Roc</td>\n",
       "      <td>3880668155868</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>hapanin</td>\n",
       "      <td>species</td>\n",
       "      <td>3880668155868</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            name          objid   consumes                    effuses  \\\n",
       "0      Belneurei  7635975712366  [Organic]  [Organic waste, Plastics]   \n",
       "1      Belneurei  7635975712366  [Organic]  [Organic waste, Plastics]   \n",
       "2          Tlasi  9841299620766  [Organic]  [Organic waste, Plastics]   \n",
       "3          Tlasi  9841299620766  [Organic]  [Organic waste, Plastics]   \n",
       "4            Pin  7609897667067  [Organic]  [Organic waste, Plastics]   \n",
       "5            Pin  7609897667067  [Organic]  [Organic waste, Plastics]   \n",
       "6            Pin  7609897667067  [Organic]  [Organic waste, Plastics]   \n",
       "7            Pin  7609897667067  [Organic]  [Organic waste, Plastics]   \n",
       "8            Pin  7609897667067  [Organic]  [Organic waste, Plastics]   \n",
       "9            Pin  7609897667067  [Organic]  [Organic waste, Plastics]   \n",
       "10           Pin  7609897667067  [Organic]  [Organic waste, Plastics]   \n",
       "11           Tor  5876090004383  [Organic]  [Organic waste, Plastics]   \n",
       "12           Tor  5876090004383  [Organic]  [Organic waste, Plastics]   \n",
       "13           Tor  5876090004383  [Organic]  [Organic waste, Plastics]   \n",
       "14           Tor  5876090004383  [Organic]  [Organic waste, Plastics]   \n",
       "15           Tor  5876090004383  [Organic]  [Organic waste, Plastics]   \n",
       "16           Tor  5876090004383  [Organic]  [Organic waste, Plastics]   \n",
       "17           Tor  5876090004383  [Organic]  [Organic waste, Plastics]   \n",
       "18  Koujunubeach  1393979728845  [Organic]  [Organic waste, Plastics]   \n",
       "19  Koujunubeach  1393979728845  [Organic]  [Organic waste, Plastics]   \n",
       "20  Koujunubeach  1393979728845  [Organic]  [Organic waste, Plastics]   \n",
       "21  Koujunubeach  1393979728845  [Organic]  [Organic waste, Plastics]   \n",
       "22  Koujunubeach  1393979728845  [Organic]  [Organic waste, Plastics]   \n",
       "23  Koujunubeach  1393979728845  [Organic]  [Organic waste, Plastics]   \n",
       "24  Koujunubeach  1393979728845  [Organic]  [Organic waste, Plastics]   \n",
       "25           Roc  3880668155868  [Organic]  [Organic waste, Plastics]   \n",
       "26           Roc  3880668155868  [Organic]  [Organic waste, Plastics]   \n",
       "27           Roc  3880668155868  [Organic]  [Organic waste, Plastics]   \n",
       "28           Roc  3880668155868  [Organic]  [Organic waste, Plastics]   \n",
       "29           Roc  3880668155868  [Organic]  [Organic waste, Plastics]   \n",
       "30           Roc  3880668155868  [Organic]  [Organic waste, Plastics]   \n",
       "31           Roc  3880668155868  [Organic]  [Organic waste, Plastics]   \n",
       "\n",
       "    viral_resilience  habitat_resilience                           username  \\\n",
       "0                0.7                 0.2                       BillmanLocal   \n",
       "1                0.7                 0.2                       BillmanLocal   \n",
       "2                0.7                 0.2  william.jeffrey.harding@gmail.com   \n",
       "3                0.7                 0.2  william.jeffrey.harding@gmail.com   \n",
       "4                0.7                 0.2                      BillmanLocal2   \n",
       "5                0.7                 0.2                      BillmanLocal2   \n",
       "6                0.7                 0.2                      BillmanLocal2   \n",
       "7                0.7                 0.2                      BillmanLocal2   \n",
       "8                0.7                 0.2                      BillmanLocal2   \n",
       "9                0.7                 0.2                      BillmanLocal2   \n",
       "10               0.7                 0.2                      BillmanLocal2   \n",
       "11               0.7                 0.2                      Billmanserver   \n",
       "12               0.7                 0.2                      Billmanserver   \n",
       "13               0.7                 0.2                      Billmanserver   \n",
       "14               0.7                 0.2                      Billmanserver   \n",
       "15               0.7                 0.2                      Billmanserver   \n",
       "16               0.7                 0.2                      Billmanserver   \n",
       "17               0.7                 0.2                      Billmanserver   \n",
       "18               0.7                 0.2                  Billmanworklaptop   \n",
       "19               0.7                 0.2                  Billmanworklaptop   \n",
       "20               0.7                 0.2                  Billmanworklaptop   \n",
       "21               0.7                 0.2                  Billmanworklaptop   \n",
       "22               0.7                 0.2                  Billmanworklaptop   \n",
       "23               0.7                 0.2                  Billmanworklaptop   \n",
       "24               0.7                 0.2                  Billmanworklaptop   \n",
       "25               0.7                 0.2                            hapanin   \n",
       "26               0.7                 0.2                            hapanin   \n",
       "27               0.7                 0.2                            hapanin   \n",
       "28               0.7                 0.2                            hapanin   \n",
       "29               0.7                 0.2                            hapanin   \n",
       "30               0.7                 0.2                            hapanin   \n",
       "31               0.7                 0.2                            hapanin   \n",
       "\n",
       "    objtype             id  \n",
       "0   species  7635975712366  \n",
       "1   species  7635975712366  \n",
       "2   species  9841299620766  \n",
       "3   species  9841299620766  \n",
       "4   species  7609897667067  \n",
       "5   species  7609897667067  \n",
       "6   species  7609897667067  \n",
       "7   species  7609897667067  \n",
       "8   species  7609897667067  \n",
       "9   species  7609897667067  \n",
       "10  species  7609897667067  \n",
       "11  species  5876090004383  \n",
       "12  species  5876090004383  \n",
       "13  species  5876090004383  \n",
       "14  species  5876090004383  \n",
       "15  species  5876090004383  \n",
       "16  species  5876090004383  \n",
       "17  species  5876090004383  \n",
       "18  species  1393979728845  \n",
       "19  species  1393979728845  \n",
       "20  species  1393979728845  \n",
       "21  species  1393979728845  \n",
       "22  species  1393979728845  \n",
       "23  species  1393979728845  \n",
       "24  species  1393979728845  \n",
       "25  species  3880668155868  \n",
       "26  species  3880668155868  \n",
       "27  species  3880668155868  \n",
       "28  species  3880668155868  \n",
       "29  species  3880668155868  \n",
       "30  species  3880668155868  \n",
       "31  species  3880668155868  "
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "species_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>class</th>\n",
       "      <th>objid</th>\n",
       "      <th>radius</th>\n",
       "      <th>mass</th>\n",
       "      <th>orbitsDistance</th>\n",
       "      <th>orbitsId</th>\n",
       "      <th>orbitsName</th>\n",
       "      <th>isSupportsLife</th>\n",
       "      <th>isPopulated</th>\n",
       "      <th>type</th>\n",
       "      <th>isHomeworld</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Dos</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>7696190212701</td>\n",
       "      <td>1.071</td>\n",
       "      <td>0.741</td>\n",
       "      <td>1.000</td>\n",
       "      <td>7627175892791</td>\n",
       "      <td>Ramsartau</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>BillmanLocal</td>\n",
       "      <td>planet</td>\n",
       "      <td>7696190212701</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Dos</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>7696190212701</td>\n",
       "      <td>1.071</td>\n",
       "      <td>0.741</td>\n",
       "      <td>1.000</td>\n",
       "      <td>7627175892791</td>\n",
       "      <td>Ramsartau</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>BillmanLocal</td>\n",
       "      <td>planet</td>\n",
       "      <td>7696190212701</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Losmo</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>1831814248083</td>\n",
       "      <td>0.266</td>\n",
       "      <td>0.624</td>\n",
       "      <td>0.977</td>\n",
       "      <td>4328232676270</td>\n",
       "      <td>Am</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>planet</td>\n",
       "      <td>1831814248083</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Losmo</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>1831814248083</td>\n",
       "      <td>0.266</td>\n",
       "      <td>0.624</td>\n",
       "      <td>0.977</td>\n",
       "      <td>4328232676270</td>\n",
       "      <td>Am</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>planet</td>\n",
       "      <td>1831814248083</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Kergnabervel</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>1136187907097</td>\n",
       "      <td>0.527</td>\n",
       "      <td>0.000</td>\n",
       "      <td>0.910</td>\n",
       "      <td>4258108753342</td>\n",
       "      <td>Unal</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>1136187907097</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Kergnabervel</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>1136187907097</td>\n",
       "      <td>0.527</td>\n",
       "      <td>0.000</td>\n",
       "      <td>0.910</td>\n",
       "      <td>4258108753342</td>\n",
       "      <td>Unal</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>1136187907097</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Kergnabervel</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>1136187907097</td>\n",
       "      <td>0.527</td>\n",
       "      <td>0.000</td>\n",
       "      <td>0.910</td>\n",
       "      <td>4258108753342</td>\n",
       "      <td>Unal</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>1136187907097</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>Kergnabervel</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>1136187907097</td>\n",
       "      <td>0.527</td>\n",
       "      <td>0.000</td>\n",
       "      <td>0.910</td>\n",
       "      <td>4258108753342</td>\n",
       "      <td>Unal</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>1136187907097</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>Kergnabervel</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>1136187907097</td>\n",
       "      <td>0.527</td>\n",
       "      <td>0.000</td>\n",
       "      <td>0.910</td>\n",
       "      <td>4258108753342</td>\n",
       "      <td>Unal</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>1136187907097</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>Kergnabervel</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>1136187907097</td>\n",
       "      <td>0.527</td>\n",
       "      <td>0.000</td>\n",
       "      <td>0.910</td>\n",
       "      <td>4258108753342</td>\n",
       "      <td>Unal</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>1136187907097</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>Kergnabervel</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>1136187907097</td>\n",
       "      <td>0.527</td>\n",
       "      <td>0.000</td>\n",
       "      <td>0.910</td>\n",
       "      <td>4258108753342</td>\n",
       "      <td>Unal</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>1136187907097</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>Field</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>8149854906906</td>\n",
       "      <td>0.933</td>\n",
       "      <td>0.439</td>\n",
       "      <td>0.937</td>\n",
       "      <td>1385551754630</td>\n",
       "      <td>Yo</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>planet</td>\n",
       "      <td>8149854906906</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>Field</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>8149854906906</td>\n",
       "      <td>0.933</td>\n",
       "      <td>0.439</td>\n",
       "      <td>0.937</td>\n",
       "      <td>1385551754630</td>\n",
       "      <td>Yo</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>planet</td>\n",
       "      <td>8149854906906</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>Field</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>8149854906906</td>\n",
       "      <td>0.933</td>\n",
       "      <td>0.439</td>\n",
       "      <td>0.937</td>\n",
       "      <td>1385551754630</td>\n",
       "      <td>Yo</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>planet</td>\n",
       "      <td>8149854906906</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>Field</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>8149854906906</td>\n",
       "      <td>0.933</td>\n",
       "      <td>0.439</td>\n",
       "      <td>0.937</td>\n",
       "      <td>1385551754630</td>\n",
       "      <td>Yo</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>planet</td>\n",
       "      <td>8149854906906</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>Field</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>8149854906906</td>\n",
       "      <td>0.933</td>\n",
       "      <td>0.439</td>\n",
       "      <td>0.937</td>\n",
       "      <td>1385551754630</td>\n",
       "      <td>Yo</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>planet</td>\n",
       "      <td>8149854906906</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>Field</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>8149854906906</td>\n",
       "      <td>0.933</td>\n",
       "      <td>0.439</td>\n",
       "      <td>0.937</td>\n",
       "      <td>1385551754630</td>\n",
       "      <td>Yo</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>planet</td>\n",
       "      <td>8149854906906</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>Field</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>8149854906906</td>\n",
       "      <td>0.933</td>\n",
       "      <td>0.439</td>\n",
       "      <td>0.937</td>\n",
       "      <td>1385551754630</td>\n",
       "      <td>Yo</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>planet</td>\n",
       "      <td>8149854906906</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>Zumen</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>5517071204057</td>\n",
       "      <td>0.997</td>\n",
       "      <td>0.000</td>\n",
       "      <td>0.432</td>\n",
       "      <td>7987542642127</td>\n",
       "      <td>Neu</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>Billmanworklaptop</td>\n",
       "      <td>planet</td>\n",
       "      <td>5517071204057</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>Zumen</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>5517071204057</td>\n",
       "      <td>0.997</td>\n",
       "      <td>0.000</td>\n",
       "      <td>0.432</td>\n",
       "      <td>7987542642127</td>\n",
       "      <td>Neu</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>Billmanworklaptop</td>\n",
       "      <td>planet</td>\n",
       "      <td>5517071204057</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>Zumen</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>5517071204057</td>\n",
       "      <td>0.997</td>\n",
       "      <td>0.000</td>\n",
       "      <td>0.432</td>\n",
       "      <td>7987542642127</td>\n",
       "      <td>Neu</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>Billmanworklaptop</td>\n",
       "      <td>planet</td>\n",
       "      <td>5517071204057</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>Zumen</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>5517071204057</td>\n",
       "      <td>0.997</td>\n",
       "      <td>0.000</td>\n",
       "      <td>0.432</td>\n",
       "      <td>7987542642127</td>\n",
       "      <td>Neu</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>Billmanworklaptop</td>\n",
       "      <td>planet</td>\n",
       "      <td>5517071204057</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>Zumen</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>5517071204057</td>\n",
       "      <td>0.997</td>\n",
       "      <td>0.000</td>\n",
       "      <td>0.432</td>\n",
       "      <td>7987542642127</td>\n",
       "      <td>Neu</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>Billmanworklaptop</td>\n",
       "      <td>planet</td>\n",
       "      <td>5517071204057</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>Zumen</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>5517071204057</td>\n",
       "      <td>0.997</td>\n",
       "      <td>0.000</td>\n",
       "      <td>0.432</td>\n",
       "      <td>7987542642127</td>\n",
       "      <td>Neu</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>Billmanworklaptop</td>\n",
       "      <td>planet</td>\n",
       "      <td>5517071204057</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>Zumen</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>5517071204057</td>\n",
       "      <td>0.997</td>\n",
       "      <td>0.000</td>\n",
       "      <td>0.432</td>\n",
       "      <td>7987542642127</td>\n",
       "      <td>Neu</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>Billmanworklaptop</td>\n",
       "      <td>planet</td>\n",
       "      <td>5517071204057</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>Varsucia</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>5593524437383</td>\n",
       "      <td>0.991</td>\n",
       "      <td>0.887</td>\n",
       "      <td>0.428</td>\n",
       "      <td>0302318256972</td>\n",
       "      <td>Fortfe</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>hapanin</td>\n",
       "      <td>planet</td>\n",
       "      <td>5593524437383</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>Varsucia</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>5593524437383</td>\n",
       "      <td>0.991</td>\n",
       "      <td>0.887</td>\n",
       "      <td>0.428</td>\n",
       "      <td>0302318256972</td>\n",
       "      <td>Fortfe</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>hapanin</td>\n",
       "      <td>planet</td>\n",
       "      <td>5593524437383</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>Varsucia</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>5593524437383</td>\n",
       "      <td>0.991</td>\n",
       "      <td>0.887</td>\n",
       "      <td>0.428</td>\n",
       "      <td>0302318256972</td>\n",
       "      <td>Fortfe</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>hapanin</td>\n",
       "      <td>planet</td>\n",
       "      <td>5593524437383</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>Varsucia</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>5593524437383</td>\n",
       "      <td>0.991</td>\n",
       "      <td>0.887</td>\n",
       "      <td>0.428</td>\n",
       "      <td>0302318256972</td>\n",
       "      <td>Fortfe</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>hapanin</td>\n",
       "      <td>planet</td>\n",
       "      <td>5593524437383</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>Varsucia</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>5593524437383</td>\n",
       "      <td>0.991</td>\n",
       "      <td>0.887</td>\n",
       "      <td>0.428</td>\n",
       "      <td>0302318256972</td>\n",
       "      <td>Fortfe</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>hapanin</td>\n",
       "      <td>planet</td>\n",
       "      <td>5593524437383</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>Varsucia</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>5593524437383</td>\n",
       "      <td>0.991</td>\n",
       "      <td>0.887</td>\n",
       "      <td>0.428</td>\n",
       "      <td>0302318256972</td>\n",
       "      <td>Fortfe</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>hapanin</td>\n",
       "      <td>planet</td>\n",
       "      <td>5593524437383</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>Varsucia</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>5593524437383</td>\n",
       "      <td>0.991</td>\n",
       "      <td>0.887</td>\n",
       "      <td>0.428</td>\n",
       "      <td>0302318256972</td>\n",
       "      <td>Fortfe</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>hapanin</td>\n",
       "      <td>planet</td>\n",
       "      <td>5593524437383</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "            name        class          objid  radius   mass  orbitsDistance  \\\n",
       "0            Dos  terrestrial  7696190212701   1.071  0.741           1.000   \n",
       "1            Dos  terrestrial  7696190212701   1.071  0.741           1.000   \n",
       "2          Losmo  terrestrial  1831814248083   0.266  0.624           0.977   \n",
       "3          Losmo  terrestrial  1831814248083   0.266  0.624           0.977   \n",
       "4   Kergnabervel  terrestrial  1136187907097   0.527  0.000           0.910   \n",
       "5   Kergnabervel  terrestrial  1136187907097   0.527  0.000           0.910   \n",
       "6   Kergnabervel  terrestrial  1136187907097   0.527  0.000           0.910   \n",
       "7   Kergnabervel  terrestrial  1136187907097   0.527  0.000           0.910   \n",
       "8   Kergnabervel  terrestrial  1136187907097   0.527  0.000           0.910   \n",
       "9   Kergnabervel  terrestrial  1136187907097   0.527  0.000           0.910   \n",
       "10  Kergnabervel  terrestrial  1136187907097   0.527  0.000           0.910   \n",
       "11         Field  terrestrial  8149854906906   0.933  0.439           0.937   \n",
       "12         Field  terrestrial  8149854906906   0.933  0.439           0.937   \n",
       "13         Field  terrestrial  8149854906906   0.933  0.439           0.937   \n",
       "14         Field  terrestrial  8149854906906   0.933  0.439           0.937   \n",
       "15         Field  terrestrial  8149854906906   0.933  0.439           0.937   \n",
       "16         Field  terrestrial  8149854906906   0.933  0.439           0.937   \n",
       "17         Field  terrestrial  8149854906906   0.933  0.439           0.937   \n",
       "18         Zumen  terrestrial  5517071204057   0.997  0.000           0.432   \n",
       "19         Zumen  terrestrial  5517071204057   0.997  0.000           0.432   \n",
       "20         Zumen  terrestrial  5517071204057   0.997  0.000           0.432   \n",
       "21         Zumen  terrestrial  5517071204057   0.997  0.000           0.432   \n",
       "22         Zumen  terrestrial  5517071204057   0.997  0.000           0.432   \n",
       "23         Zumen  terrestrial  5517071204057   0.997  0.000           0.432   \n",
       "24         Zumen  terrestrial  5517071204057   0.997  0.000           0.432   \n",
       "25      Varsucia  terrestrial  5593524437383   0.991  0.887           0.428   \n",
       "26      Varsucia  terrestrial  5593524437383   0.991  0.887           0.428   \n",
       "27      Varsucia  terrestrial  5593524437383   0.991  0.887           0.428   \n",
       "28      Varsucia  terrestrial  5593524437383   0.991  0.887           0.428   \n",
       "29      Varsucia  terrestrial  5593524437383   0.991  0.887           0.428   \n",
       "30      Varsucia  terrestrial  5593524437383   0.991  0.887           0.428   \n",
       "31      Varsucia  terrestrial  5593524437383   0.991  0.887           0.428   \n",
       "\n",
       "         orbitsId orbitsName isSupportsLife isPopulated         type  \\\n",
       "0   7627175892791  Ramsartau           True        True  terrestrial   \n",
       "1   7627175892791  Ramsartau           True        True  terrestrial   \n",
       "2   4328232676270         Am           True        True  terrestrial   \n",
       "3   4328232676270         Am           True        True  terrestrial   \n",
       "4   4258108753342       Unal           True        True  terrestrial   \n",
       "5   4258108753342       Unal           True        True  terrestrial   \n",
       "6   4258108753342       Unal           True        True  terrestrial   \n",
       "7   4258108753342       Unal           True        True  terrestrial   \n",
       "8   4258108753342       Unal           True        True  terrestrial   \n",
       "9   4258108753342       Unal           True        True  terrestrial   \n",
       "10  4258108753342       Unal           True        True  terrestrial   \n",
       "11  1385551754630         Yo           True        True  terrestrial   \n",
       "12  1385551754630         Yo           True        True  terrestrial   \n",
       "13  1385551754630         Yo           True        True  terrestrial   \n",
       "14  1385551754630         Yo           True        True  terrestrial   \n",
       "15  1385551754630         Yo           True        True  terrestrial   \n",
       "16  1385551754630         Yo           True        True  terrestrial   \n",
       "17  1385551754630         Yo           True        True  terrestrial   \n",
       "18  7987542642127        Neu           True        True  terrestrial   \n",
       "19  7987542642127        Neu           True        True  terrestrial   \n",
       "20  7987542642127        Neu           True        True  terrestrial   \n",
       "21  7987542642127        Neu           True        True  terrestrial   \n",
       "22  7987542642127        Neu           True        True  terrestrial   \n",
       "23  7987542642127        Neu           True        True  terrestrial   \n",
       "24  7987542642127        Neu           True        True  terrestrial   \n",
       "25  0302318256972     Fortfe           True        True  terrestrial   \n",
       "26  0302318256972     Fortfe           True        True  terrestrial   \n",
       "27  0302318256972     Fortfe           True        True  terrestrial   \n",
       "28  0302318256972     Fortfe           True        True  terrestrial   \n",
       "29  0302318256972     Fortfe           True        True  terrestrial   \n",
       "30  0302318256972     Fortfe           True        True  terrestrial   \n",
       "31  0302318256972     Fortfe           True        True  terrestrial   \n",
       "\n",
       "   isHomeworld                           username objtype             id  \n",
       "0         True                       BillmanLocal  planet  7696190212701  \n",
       "1         True                       BillmanLocal  planet  7696190212701  \n",
       "2         True  william.jeffrey.harding@gmail.com  planet  1831814248083  \n",
       "3         True  william.jeffrey.harding@gmail.com  planet  1831814248083  \n",
       "4         True                      BillmanLocal2  planet  1136187907097  \n",
       "5         True                      BillmanLocal2  planet  1136187907097  \n",
       "6         True                      BillmanLocal2  planet  1136187907097  \n",
       "7         True                      BillmanLocal2  planet  1136187907097  \n",
       "8         True                      BillmanLocal2  planet  1136187907097  \n",
       "9         True                      BillmanLocal2  planet  1136187907097  \n",
       "10        True                      BillmanLocal2  planet  1136187907097  \n",
       "11        True                      Billmanserver  planet  8149854906906  \n",
       "12        True                      Billmanserver  planet  8149854906906  \n",
       "13        True                      Billmanserver  planet  8149854906906  \n",
       "14        True                      Billmanserver  planet  8149854906906  \n",
       "15        True                      Billmanserver  planet  8149854906906  \n",
       "16        True                      Billmanserver  planet  8149854906906  \n",
       "17        True                      Billmanserver  planet  8149854906906  \n",
       "18        True                  Billmanworklaptop  planet  5517071204057  \n",
       "19        True                  Billmanworklaptop  planet  5517071204057  \n",
       "20        True                  Billmanworklaptop  planet  5517071204057  \n",
       "21        True                  Billmanworklaptop  planet  5517071204057  \n",
       "22        True                  Billmanworklaptop  planet  5517071204057  \n",
       "23        True                  Billmanworklaptop  planet  5517071204057  \n",
       "24        True                  Billmanworklaptop  planet  5517071204057  \n",
       "25        True                            hapanin  planet  5593524437383  \n",
       "26        True                            hapanin  planet  5593524437383  \n",
       "27        True                            hapanin  planet  5593524437383  \n",
       "28        True                            hapanin  planet  5593524437383  \n",
       "29        True                            hapanin  planet  5593524437383  \n",
       "30        True                            hapanin  planet  5593524437383  \n",
       "31        True                            hapanin  planet  5593524437383  "
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "locations_df"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "First getting the list of consumption for each pop.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>location_id</th>\n",
       "      <th>consumes</th>\n",
       "      <th>pop</th>\n",
       "      <th>consumption</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1136187907097</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>7</td>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1831814248083</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>5517071204057</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>7</td>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>5593524437383</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>7</td>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>7696190212701</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>8149854906906</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>7</td>\n",
       "      <td>14</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     location_id   consumes  pop  consumption\n",
       "0  1136187907097  [Organic]    7           14\n",
       "1  1831814248083  [Organic]    2            4\n",
       "2  5517071204057  [Organic]    7           14\n",
       "3  5593524437383  [Organic]    7           14\n",
       "4  7696190212701  [Organic]    2            4\n",
       "5  8149854906906  [Organic]    7           14"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "consumption_df = consumption.get_consumption_df(locations_df,species_df,params)\n",
    "consumption_df"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We expand that dataset to break open the list of people in each pop. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "c:\\Users\\william.harding\\anaconda3\\envs\\exoplanets\\lib\\site-packages\\pandas\\core\\series.py:1056: SettingWithCopyWarning: \n",
      "A value is trying to be set on a copy of a slice from a DataFrame\n",
      "\n",
      "See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy\n",
      "  cacher_needs_updating = self._check_is_chained_assignment_possible()\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>location_id</th>\n",
       "      <th>consumes</th>\n",
       "      <th>pop</th>\n",
       "      <th>consumption</th>\n",
       "      <th>multi</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1136187907097</td>\n",
       "      <td>Organic</td>\n",
       "      <td>7</td>\n",
       "      <td>14</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1831814248083</td>\n",
       "      <td>Organic</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>5517071204057</td>\n",
       "      <td>Organic</td>\n",
       "      <td>7</td>\n",
       "      <td>14</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>5593524437383</td>\n",
       "      <td>Organic</td>\n",
       "      <td>7</td>\n",
       "      <td>14</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>7696190212701</td>\n",
       "      <td>Organic</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>8149854906906</td>\n",
       "      <td>Organic</td>\n",
       "      <td>7</td>\n",
       "      <td>14</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     location_id consumes pop consumption multi\n",
       "0  1136187907097  Organic   7          14  True\n",
       "1  1831814248083  Organic   2           4  True\n",
       "2  5517071204057  Organic   7          14  True\n",
       "3  5593524437383  Organic   7          14  True\n",
       "4  7696190212701  Organic   2           4  True\n",
       "5  8149854906906  Organic   7          14  True"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "consumption_df = consumption.expand_consumption_df(consumption_df)\n",
    "consumption_df"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Then we get a list of the resources available on that location. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'labels': [['location'], ['resource']],\n",
       "  'objects': [{'objid': ['7696190212701'], 'name': ['Dos']},\n",
       "   {'volume': [2656], 'objid': ['3854368291228'], 'name': ['Organic']}]},\n",
       " {'labels': [['location'], ['resource']],\n",
       "  'objects': [{'objid': ['1831814248083'], 'name': ['Losmo']},\n",
       "   {'volume': [1391], 'objid': ['9475184497649'], 'name': ['Organic']}]},\n",
       " {'labels': [['location'], ['resource']],\n",
       "  'objects': [{'objid': ['1136187907097'], 'name': ['Kergnabervel']},\n",
       "   {'volume': [374], 'objid': ['5174873116348'], 'name': ['Organic']}]},\n",
       " {'labels': [['location'], ['resource']],\n",
       "  'objects': [{'objid': ['8149854906906'], 'name': ['Field']},\n",
       "   {'volume': [-79], 'objid': ['4958106057205'], 'name': ['Organic']}]},\n",
       " {'labels': [['location'], ['resource']],\n",
       "  'objects': [{'objid': ['5517071204057'], 'name': ['Zumen']},\n",
       "   {'volume': [878], 'objid': ['6966447146498'], 'name': ['Organic']}]},\n",
       " {'labels': [['location'], ['resource']],\n",
       "  'objects': [{'objid': ['5593524437383'], 'name': ['Varsucia']},\n",
       "   {'volume': [408], 'objid': ['2914369342140'], 'name': ['Organic']}]}]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "c.run_query(consumption.make_resource_query(consumption_df))\n",
    "resources = c.res\n",
    "resources"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "../../functions/popgrowth\\tools\\consumption.py:78: SettingWithCopyWarning: \n",
      "A value is trying to be set on a copy of a slice from a DataFrame.\n",
      "Try using .loc[row_indexer,col_indexer] = value instead\n",
      "\n",
      "See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy\n",
      "  consumption_df[consumption_df['remaining']<0]['remaining'] = -1\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>location_id</th>\n",
       "      <th>consumes</th>\n",
       "      <th>pop</th>\n",
       "      <th>consumption</th>\n",
       "      <th>multi</th>\n",
       "      <th>available</th>\n",
       "      <th>remaining</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1136187907097</td>\n",
       "      <td>Organic</td>\n",
       "      <td>7</td>\n",
       "      <td>14</td>\n",
       "      <td>True</td>\n",
       "      <td>374.0</td>\n",
       "      <td>360.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1831814248083</td>\n",
       "      <td>Organic</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>True</td>\n",
       "      <td>1391.0</td>\n",
       "      <td>1387.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>5517071204057</td>\n",
       "      <td>Organic</td>\n",
       "      <td>7</td>\n",
       "      <td>14</td>\n",
       "      <td>True</td>\n",
       "      <td>878.0</td>\n",
       "      <td>864.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>5593524437383</td>\n",
       "      <td>Organic</td>\n",
       "      <td>7</td>\n",
       "      <td>14</td>\n",
       "      <td>True</td>\n",
       "      <td>408.0</td>\n",
       "      <td>394.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>7696190212701</td>\n",
       "      <td>Organic</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>True</td>\n",
       "      <td>2656.0</td>\n",
       "      <td>2652.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>8149854906906</td>\n",
       "      <td>Organic</td>\n",
       "      <td>7</td>\n",
       "      <td>14</td>\n",
       "      <td>True</td>\n",
       "      <td>-79.0</td>\n",
       "      <td>-93.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     location_id consumes pop consumption multi  available  remaining\n",
       "0  1136187907097  Organic   7          14  True      374.0      360.0\n",
       "1  1831814248083  Organic   2           4  True     1391.0     1387.0\n",
       "2  5517071204057  Organic   7          14  True      878.0      864.0\n",
       "3  5593524437383  Organic   7          14  True      408.0      394.0\n",
       "4  7696190212701  Organic   2           4  True     2656.0     2652.0\n",
       "5  8149854906906  Organic   7          14  True      -79.0      -93.0"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "consumption_df = consumption.tally_consumption(c,consumption_df,resources)\n",
    "consumption_df"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Then we update the resources by taking out the resources that exist. You can check that this has happened in the graph by looking at the location ids. This is a verification query that isn't run in the function application."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0    None\n",
       "1    None\n",
       "dtype: object"
      ]
     },
     "execution_count": 52,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "consumption_df.apply(lambda x: consumption.make_resource_update_query(c,x),axis=1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "g.V().has('objid','1212171618802').out('hasResource').valueMap()\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>volume</th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>description</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>864</td>\n",
       "      <td>Organic</td>\n",
       "      <td>1139592844940</td>\n",
       "      <td>bilogical material that can be consumed by pops</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>resource</td>\n",
       "      <td>1139592844940</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>107</td>\n",
       "      <td>Common Minerals</td>\n",
       "      <td>4579244562521</td>\n",
       "      <td>Iron and other common material used in constru...</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>resource</td>\n",
       "      <td>4579244562521</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>46</td>\n",
       "      <td>Rare Minerals</td>\n",
       "      <td>7328863888302</td>\n",
       "      <td>lithium, silver and other rare minerals used i...</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>resource</td>\n",
       "      <td>7328863888302</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>10419</td>\n",
       "      <td>Water</td>\n",
       "      <td>0620999397406</td>\n",
       "      <td>H2O ready to be consumed, either frozen or in ...</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>resource</td>\n",
       "      <td>0620999397406</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   volume             name          objid  \\\n",
       "0     864          Organic  1139592844940   \n",
       "1     107  Common Minerals  4579244562521   \n",
       "2      46    Rare Minerals  7328863888302   \n",
       "3   10419            Water  0620999397406   \n",
       "\n",
       "                                         description  \\\n",
       "0    bilogical material that can be consumed by pops   \n",
       "1  Iron and other common material used in constru...   \n",
       "2  lithium, silver and other rare minerals used i...   \n",
       "3  H2O ready to be consumed, either frozen or in ...   \n",
       "\n",
       "                            username   objtype             id  \n",
       "0  william.jeffrey.harding@gmail.com  resource  1139592844940  \n",
       "1  william.jeffrey.harding@gmail.com  resource  4579244562521  \n",
       "2  william.jeffrey.harding@gmail.com  resource  7328863888302  \n",
       "3  william.jeffrey.harding@gmail.com  resource  0620999397406  "
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "validate_resources_updated_query = f\"\"\"\n",
    "g.V().has('objid','1212171618802').out('hasResource').valueMap()\n",
    "\"\"\"\n",
    "print(validate_resources_updated_query)\n",
    "c.run_query(validate_resources_updated_query)\n",
    "pd.DataFrame.from_records(c.clean_nodes(c.res))"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now for the starving. Populations without enough food will starve (health declines). Populations with < 0 health will die."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>location_id</th>\n",
       "      <th>consumes</th>\n",
       "      <th>pop</th>\n",
       "      <th>consumption</th>\n",
       "      <th>multi</th>\n",
       "      <th>available</th>\n",
       "      <th>remaining</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1212171618802</td>\n",
       "      <td>Organic</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>True</td>\n",
       "      <td>868.0</td>\n",
       "      <td>864.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1566812213349</td>\n",
       "      <td>Organic</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>True</td>\n",
       "      <td>728.0</td>\n",
       "      <td>724.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     location_id consumes pop consumption multi  available  remaining\n",
       "0  1212171618802  Organic   2           4  True      868.0      864.0\n",
       "1  1566812213349  Organic   2           4  True      728.0      724.0"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "consumption_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>location_id</th>\n",
       "      <th>consumes</th>\n",
       "      <th>pop</th>\n",
       "      <th>consumption</th>\n",
       "      <th>multi</th>\n",
       "      <th>available</th>\n",
       "      <th>remaining</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: [location_id, consumes, pop, consumption, multi, available, remaining]\n",
       "Index: []"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "consumption_df[consumption_df['remaining']<=0].apply(lambda x: consumption.lower_health(c,params,x),axis=1)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Looking more closely at `lower_health`\n",
    "This only happens on locations that have < 0 resources. But here we're going to do it regardless"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "location_id    1212171618802\n",
      "consumes             Organic\n",
      "pop                        2\n",
      "consumption                4\n",
      "multi                   True\n",
      "available              868.0\n",
      "remaining              864.0\n",
      "Name: 0, dtype: object\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[{'labels': [['location'], ['pop'], ['species']],\n",
       "  'objects': [{'objid': ['1212171618802'], 'name': ['Yepi']},\n",
       "   {'name': ['Dorf Maymanessha'],\n",
       "    'objid': ['3740655755079'],\n",
       "    'health': [0.5],\n",
       "    'username': ['william.jeffrey.harding@gmail.com']},\n",
       "   {'name': ['Gordi'],\n",
       "    'objid': ['0327650709394'],\n",
       "    'consumes': ['[Organic]']}]},\n",
       " {'labels': [['location'], ['pop'], ['species']],\n",
       "  'objects': [{'objid': ['1212171618802'], 'name': ['Yepi']},\n",
       "   {'name': ['Behaleslaikon Pla'],\n",
       "    'objid': ['7148617739848'],\n",
       "    'health': [0.5],\n",
       "    'username': ['william.jeffrey.harding@gmail.com']},\n",
       "   {'name': ['Gordi'],\n",
       "    'objid': ['0327650709394'],\n",
       "    'consumes': ['[Organic]']}]}]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x = consumption_df.loc[0]\n",
    "print(x)\n",
    "\n",
    "dead_pop_nodes = []\n",
    "dead_pop_ids = []\n",
    "death_event_edges = []\n",
    "query =f\"\"\"\n",
    "g.V().has('objid','{x.location_id}').as('location').in('inhabits')\n",
    "    .haslabel('pop').as('pop')\n",
    "    .out('isOfSpecies').as('species')\n",
    "    .path()\n",
    "        .by(valueMap('objid','name'))\n",
    "        .by(valueMap('name','objid','health','username'))\n",
    "        .by(valueMap('name','objid','consumes'))\n",
    "\"\"\"\n",
    "c.run_query(query)\n",
    "out = c.res\n",
    "out"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 pops will starve in 1212171618802\n"
     ]
    }
   ],
   "source": [
    "print(f\"{len(out)} pops will starve in {x.location_id}\")"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We are only going to starve the pop if the pop consumes that resource. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'labels': [['location'], ['pop'], ['species']], 'objects': [{'objid': ['1212171618802'], 'name': ['Yepi']}, {'name': ['Behaleslaikon Pla'], 'objid': ['7148617739848'], 'health': [0.5], 'username': ['william.jeffrey.harding@gmail.com']}, {'name': ['Gordi'], 'objid': ['0327650709394'], 'consumes': ['[Organic]']}]} True\n"
     ]
    }
   ],
   "source": [
    "for i in out:\n",
    "    health = i['objects'][1]['health'][0]\n",
    "    objid = i['objects'][1]['objid'][0]\n",
    "    consumes = yaml.safe_load(i['objects'][2]['consumes'][0])\n",
    "    all_death = 0\n",
    "\n",
    "print(i, x.consumes in consumes)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "health just goes down. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "                g.V().has('objid','7148617739848').property('health',0.45)\n",
      "                \n"
     ]
    }
   ],
   "source": [
    "starve_query = f\"\"\"\n",
    "                g.V().has('objid','{objid}').property('health',{health-params['starve_damage']})\n",
    "                \"\"\"\n",
    "print(starve_query)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Let's pretend that the pop will die. IF they do, it will create a `death event`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'objid': '9409138528410',\n",
       " 'name': 'starvation',\n",
       " 'label': 'event',\n",
       " 'text': 'The population (Behaleslaikon Pla) inhabiting Yepi has died of starvation.',\n",
       " 'visibleTo': 'william.jeffrey.harding@gmail.com',\n",
       " 'time': 23763,\n",
       " 'username': 'azfunction'}"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "death_event = consumption.death_by_starvation_event(c.clean_node(i['objects'][0]),i['objects'][1],params)\n",
    "death_event"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We will also link that event to an appropriate `happendAt` so that we can see it when looking at events related to specific things. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "g.V().has('objid','9409138528410')\n",
      "            .addE('happenedAt')\n",
      "            .to(g.V().has('objid','1212171618802'))\n"
     ]
    }
   ],
   "source": [
    "print(c.create_custom_edge(death_event, c.clean_node(i['objects'][0]), 'happenedAt').strip())"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Population growth\n",
    "* Populations that die are deleted, so they don't grow.\n",
    "* However all pops that can grow will, regardless of wheter they are starving or not. \n",
    "* Starving will lower thier health, which will eventually make them unable to grow. \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [],
   "source": [
    "from tools import growth\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "lenth of pops == 0 : False\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>health</th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>conformity</th>\n",
       "      <th>literacy</th>\n",
       "      <th>aggression</th>\n",
       "      <th>constitution</th>\n",
       "      <th>isInFaction</th>\n",
       "      <th>industry</th>\n",
       "      <th>wealth</th>\n",
       "      <th>factionLoyalty</th>\n",
       "      <th>isIdle</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.5</td>\n",
       "      <td>Monuevil Harreipia</td>\n",
       "      <td>8622793176589</td>\n",
       "      <td>0.453</td>\n",
       "      <td>0.508</td>\n",
       "      <td>0.501</td>\n",
       "      <td>0.446</td>\n",
       "      <td>9132659179734</td>\n",
       "      <td>0.4735</td>\n",
       "      <td>0.4908</td>\n",
       "      <td>0.447</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>8622793176589</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0.5</td>\n",
       "      <td>Chan Lamauhal</td>\n",
       "      <td>9972182873463</td>\n",
       "      <td>0.499</td>\n",
       "      <td>0.676</td>\n",
       "      <td>0.516</td>\n",
       "      <td>0.506</td>\n",
       "      <td>2075919117794</td>\n",
       "      <td>0.5110</td>\n",
       "      <td>0.5935</td>\n",
       "      <td>0.606</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>9972182873463</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>0.5</td>\n",
       "      <td>Dorf Maymanessha</td>\n",
       "      <td>3740655755079</td>\n",
       "      <td>0.538</td>\n",
       "      <td>0.524</td>\n",
       "      <td>0.526</td>\n",
       "      <td>0.670</td>\n",
       "      <td>3600019733579</td>\n",
       "      <td>0.5980</td>\n",
       "      <td>0.5610</td>\n",
       "      <td>0.538</td>\n",
       "      <td>true</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>3740655755079</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0.5</td>\n",
       "      <td>Behaleslaikon Pla</td>\n",
       "      <td>7148617739848</td>\n",
       "      <td>0.509</td>\n",
       "      <td>0.439</td>\n",
       "      <td>0.699</td>\n",
       "      <td>0.399</td>\n",
       "      <td>8774319370110</td>\n",
       "      <td>0.5490</td>\n",
       "      <td>0.4940</td>\n",
       "      <td>0.404</td>\n",
       "      <td>true</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>7148617739848</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   health                name          objid  conformity  literacy  \\\n",
       "0     0.5  Monuevil Harreipia  8622793176589       0.453     0.508   \n",
       "1     0.5       Chan Lamauhal  9972182873463       0.499     0.676   \n",
       "2     0.5    Dorf Maymanessha  3740655755079       0.538     0.524   \n",
       "3     0.5   Behaleslaikon Pla  7148617739848       0.509     0.439   \n",
       "\n",
       "   aggression  constitution    isInFaction  industry  wealth  factionLoyalty  \\\n",
       "0       0.501         0.446  9132659179734    0.4735  0.4908           0.447   \n",
       "1       0.516         0.506  2075919117794    0.5110  0.5935           0.606   \n",
       "2       0.526         0.670  3600019733579    0.5980  0.5610           0.538   \n",
       "3       0.699         0.399  8774319370110    0.5490  0.4940           0.404   \n",
       "\n",
       "  isIdle                           username objtype             id  \n",
       "0   true                      BillmanLocal2     pop  8622793176589  \n",
       "1   true                      BillmanLocal2     pop  9972182873463  \n",
       "2   true  william.jeffrey.harding@gmail.com     pop  3740655755079  \n",
       "3   true  william.jeffrey.harding@gmail.com     pop  7148617739848  "
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pops_df,species_df,locations_df = growth.get_pop_health(c,params)\n",
    "print(f\"lenth of pops == 0 : {len(pops_df)==0}\")\n",
    "pops_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>consumes</th>\n",
       "      <th>effuses</th>\n",
       "      <th>viral_resilience</th>\n",
       "      <th>habitat_resilience</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Losfenly</td>\n",
       "      <td>5303083615604</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>5303083615604</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Losfenly</td>\n",
       "      <td>5303083615604</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>5303083615604</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Gordi</td>\n",
       "      <td>0327650709394</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>species</td>\n",
       "      <td>0327650709394</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Gordi</td>\n",
       "      <td>0327650709394</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>species</td>\n",
       "      <td>0327650709394</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       name          objid   consumes                    effuses  \\\n",
       "0  Losfenly  5303083615604  [Organic]  [Organic waste, Plastics]   \n",
       "1  Losfenly  5303083615604  [Organic]  [Organic waste, Plastics]   \n",
       "2     Gordi  0327650709394  [Organic]  [Organic waste, Plastics]   \n",
       "3     Gordi  0327650709394  [Organic]  [Organic waste, Plastics]   \n",
       "\n",
       "   viral_resilience  habitat_resilience                           username  \\\n",
       "0               0.7                 0.2                      BillmanLocal2   \n",
       "1               0.7                 0.2                      BillmanLocal2   \n",
       "2               0.7                 0.2  william.jeffrey.harding@gmail.com   \n",
       "3               0.7                 0.2  william.jeffrey.harding@gmail.com   \n",
       "\n",
       "   objtype             id  \n",
       "0  species  5303083615604  \n",
       "1  species  5303083615604  \n",
       "2  species  0327650709394  \n",
       "3  species  0327650709394  "
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "species_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>class</th>\n",
       "      <th>objid</th>\n",
       "      <th>radius</th>\n",
       "      <th>mass</th>\n",
       "      <th>orbitsDistance</th>\n",
       "      <th>orbitsId</th>\n",
       "      <th>orbitsName</th>\n",
       "      <th>isSupportsLife</th>\n",
       "      <th>isPopulated</th>\n",
       "      <th>type</th>\n",
       "      <th>isHomeworld</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Tesebrid</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>1566812213349</td>\n",
       "      <td>1.019</td>\n",
       "      <td>0.00</td>\n",
       "      <td>2</td>\n",
       "      <td>2367018655305</td>\n",
       "      <td>Varhu</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>1566812213349</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Tesebrid</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>1566812213349</td>\n",
       "      <td>1.019</td>\n",
       "      <td>0.00</td>\n",
       "      <td>2</td>\n",
       "      <td>2367018655305</td>\n",
       "      <td>Varhu</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>1566812213349</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Yepi</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>1212171618802</td>\n",
       "      <td>1.268</td>\n",
       "      <td>0.99</td>\n",
       "      <td>1</td>\n",
       "      <td>4037124139478</td>\n",
       "      <td>Qaneu</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>planet</td>\n",
       "      <td>1212171618802</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Yepi</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>1212171618802</td>\n",
       "      <td>1.268</td>\n",
       "      <td>0.99</td>\n",
       "      <td>1</td>\n",
       "      <td>4037124139478</td>\n",
       "      <td>Qaneu</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>planet</td>\n",
       "      <td>1212171618802</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       name        class          objid  radius  mass  orbitsDistance  \\\n",
       "0  Tesebrid  terrestrial  1566812213349   1.019  0.00               2   \n",
       "1  Tesebrid  terrestrial  1566812213349   1.019  0.00               2   \n",
       "2      Yepi  terrestrial  1212171618802   1.268  0.99               1   \n",
       "3      Yepi  terrestrial  1212171618802   1.268  0.99               1   \n",
       "\n",
       "        orbitsId orbitsName isSupportsLife isPopulated         type  \\\n",
       "0  2367018655305      Varhu           True        True  terrestrial   \n",
       "1  2367018655305      Varhu           True        True  terrestrial   \n",
       "2  4037124139478      Qaneu           True        True  terrestrial   \n",
       "3  4037124139478      Qaneu           True        True  terrestrial   \n",
       "\n",
       "  isHomeworld                           username objtype             id  \n",
       "0        True                      BillmanLocal2  planet  1566812213349  \n",
       "1        True                      BillmanLocal2  planet  1566812213349  \n",
       "2        True  william.jeffrey.harding@gmail.com  planet  1212171618802  \n",
       "3        True  william.jeffrey.harding@gmail.com  planet  1212171618802  "
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "locations_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>health</th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>conformity</th>\n",
       "      <th>literacy</th>\n",
       "      <th>aggression</th>\n",
       "      <th>constitution</th>\n",
       "      <th>isInFaction</th>\n",
       "      <th>industry</th>\n",
       "      <th>wealth</th>\n",
       "      <th>factionLoyalty</th>\n",
       "      <th>isIdle</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "      <th>roll</th>\n",
       "      <th>grow</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.5</td>\n",
       "      <td>Monuevil Harreipia</td>\n",
       "      <td>8622793176589</td>\n",
       "      <td>0.453</td>\n",
       "      <td>0.508</td>\n",
       "      <td>0.501</td>\n",
       "      <td>0.446</td>\n",
       "      <td>9132659179734</td>\n",
       "      <td>0.4735</td>\n",
       "      <td>0.4908</td>\n",
       "      <td>0.447</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>8622793176589</td>\n",
       "      <td>0.140471</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0.5</td>\n",
       "      <td>Chan Lamauhal</td>\n",
       "      <td>9972182873463</td>\n",
       "      <td>0.499</td>\n",
       "      <td>0.676</td>\n",
       "      <td>0.516</td>\n",
       "      <td>0.506</td>\n",
       "      <td>2075919117794</td>\n",
       "      <td>0.5110</td>\n",
       "      <td>0.5935</td>\n",
       "      <td>0.606</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>9972182873463</td>\n",
       "      <td>0.496344</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>0.5</td>\n",
       "      <td>Dorf Maymanessha</td>\n",
       "      <td>3740655755079</td>\n",
       "      <td>0.538</td>\n",
       "      <td>0.524</td>\n",
       "      <td>0.526</td>\n",
       "      <td>0.670</td>\n",
       "      <td>3600019733579</td>\n",
       "      <td>0.5980</td>\n",
       "      <td>0.5610</td>\n",
       "      <td>0.538</td>\n",
       "      <td>true</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>3740655755079</td>\n",
       "      <td>0.638432</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0.5</td>\n",
       "      <td>Behaleslaikon Pla</td>\n",
       "      <td>7148617739848</td>\n",
       "      <td>0.509</td>\n",
       "      <td>0.439</td>\n",
       "      <td>0.699</td>\n",
       "      <td>0.399</td>\n",
       "      <td>8774319370110</td>\n",
       "      <td>0.5490</td>\n",
       "      <td>0.4940</td>\n",
       "      <td>0.404</td>\n",
       "      <td>true</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>7148617739848</td>\n",
       "      <td>0.414724</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   health                name          objid  conformity  literacy  \\\n",
       "0     0.5  Monuevil Harreipia  8622793176589       0.453     0.508   \n",
       "1     0.5       Chan Lamauhal  9972182873463       0.499     0.676   \n",
       "2     0.5    Dorf Maymanessha  3740655755079       0.538     0.524   \n",
       "3     0.5   Behaleslaikon Pla  7148617739848       0.509     0.439   \n",
       "\n",
       "   aggression  constitution    isInFaction  industry  wealth  factionLoyalty  \\\n",
       "0       0.501         0.446  9132659179734    0.4735  0.4908           0.447   \n",
       "1       0.516         0.506  2075919117794    0.5110  0.5935           0.606   \n",
       "2       0.526         0.670  3600019733579    0.5980  0.5610           0.538   \n",
       "3       0.699         0.399  8774319370110    0.5490  0.4940           0.404   \n",
       "\n",
       "  isIdle                           username objtype             id      roll  \\\n",
       "0   true                      BillmanLocal2     pop  8622793176589  0.140471   \n",
       "1   true                      BillmanLocal2     pop  9972182873463  0.496344   \n",
       "2   true  william.jeffrey.harding@gmail.com     pop  3740655755079  0.638432   \n",
       "3   true  william.jeffrey.harding@gmail.com     pop  7148617739848  0.414724   \n",
       "\n",
       "    grow  \n",
       "0   True  \n",
       "1   True  \n",
       "2  False  \n",
       "3   True  "
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pops_df['roll'] = pops_df['objid'].apply(lambda x: np.random.random())\n",
    "pops_df['grow'] = pops_df[['wealth','health']].T.mean() >= pops_df['roll']\n",
    "\n",
    "reproducing_pops = pops_df[pops_df['grow']].drop(['roll','grow'],axis=1)\n",
    "pops_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>health</th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>conformity</th>\n",
       "      <th>literacy</th>\n",
       "      <th>aggression</th>\n",
       "      <th>constitution</th>\n",
       "      <th>isInFaction</th>\n",
       "      <th>industry</th>\n",
       "      <th>wealth</th>\n",
       "      <th>factionLoyalty</th>\n",
       "      <th>isIdle</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.5</td>\n",
       "      <td>Monuevil Harreipia</td>\n",
       "      <td>8622793176589</td>\n",
       "      <td>0.453</td>\n",
       "      <td>0.508</td>\n",
       "      <td>0.501</td>\n",
       "      <td>0.446</td>\n",
       "      <td>9132659179734</td>\n",
       "      <td>0.4735</td>\n",
       "      <td>0.4908</td>\n",
       "      <td>0.447</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>8622793176589</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0.5</td>\n",
       "      <td>Chan Lamauhal</td>\n",
       "      <td>9972182873463</td>\n",
       "      <td>0.499</td>\n",
       "      <td>0.676</td>\n",
       "      <td>0.516</td>\n",
       "      <td>0.506</td>\n",
       "      <td>2075919117794</td>\n",
       "      <td>0.5110</td>\n",
       "      <td>0.5935</td>\n",
       "      <td>0.606</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>9972182873463</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0.5</td>\n",
       "      <td>Behaleslaikon Pla</td>\n",
       "      <td>7148617739848</td>\n",
       "      <td>0.509</td>\n",
       "      <td>0.439</td>\n",
       "      <td>0.699</td>\n",
       "      <td>0.399</td>\n",
       "      <td>8774319370110</td>\n",
       "      <td>0.5490</td>\n",
       "      <td>0.4940</td>\n",
       "      <td>0.404</td>\n",
       "      <td>true</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>7148617739848</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   health                name          objid  conformity  literacy  \\\n",
       "0     0.5  Monuevil Harreipia  8622793176589       0.453     0.508   \n",
       "1     0.5       Chan Lamauhal  9972182873463       0.499     0.676   \n",
       "3     0.5   Behaleslaikon Pla  7148617739848       0.509     0.439   \n",
       "\n",
       "   aggression  constitution    isInFaction  industry  wealth  factionLoyalty  \\\n",
       "0       0.501         0.446  9132659179734    0.4735  0.4908           0.447   \n",
       "1       0.516         0.506  2075919117794    0.5110  0.5935           0.606   \n",
       "3       0.699         0.399  8774319370110    0.5490  0.4940           0.404   \n",
       "\n",
       "  isIdle                           username objtype             id  \n",
       "0   true                      BillmanLocal2     pop  8622793176589  \n",
       "1   true                      BillmanLocal2     pop  9972182873463  \n",
       "3   true  william.jeffrey.harding@gmail.com     pop  7148617739848  "
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "reproducing_pops"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [],
   "source": [
    "nodes = []\n",
    "edges = []\n",
    "# Event edges must be uploaded separately, because the event nodes haven't been created yet.    \n",
    "event_edges = []"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [],
   "source": [
    "for i in reproducing_pops.index.to_list():\n",
    "    p = reproducing_pops.loc[i].to_dict()\n",
    "    species = species_df.loc[i].to_dict()\n",
    "    location = locations_df.loc[i].to_dict()\n",
    "    child = growth.grow_pop(p,species,params,syllables)\n",
    "    nodes.append(child)\n",
    "    event = growth.population_growth_event(p, location,child,params)\n",
    "    nodes.append(event)\n",
    "    edges.append({\"node1\": child[\"objid\"], \"node2\": p[\"objid\"], \"label\": \"childOf\"})\n",
    "    edges.append({\"node1\": child[\"objid\"], \"node2\": child[\"isInFaction\"], \"label\": \"isInFaction\"})\n",
    "    edges.append({\"node1\": child[\"objid\"], \"node2\": species[\"objid\"], \"label\": \"isOfSpecies\"})\n",
    "    event_edges.append(c.create_custom_edge(event,location,'happenedAt'))\n",
    "    event_edges.append(c.create_custom_edge(p,event,'caused'))\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'health': 0.5,\n",
       " 'name': 'Behaleslaikon Pla',\n",
       " 'objid': '7148617739848',\n",
       " 'conformity': 0.509,\n",
       " 'literacy': 0.439,\n",
       " 'aggression': 0.699,\n",
       " 'constitution': 0.399,\n",
       " 'isInFaction': '8774319370110',\n",
       " 'industry': 0.549,\n",
       " 'wealth': 0.494,\n",
       " 'factionLoyalty': 0.404,\n",
       " 'isIdle': 'true',\n",
       " 'username': 'william.jeffrey.harding@gmail.com',\n",
       " 'objtype': 'pop',\n",
       " 'id': '7148617739848'}"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "p"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'health': 0.3,\n",
       " 'name': 'Behaleslaikon Plaben',\n",
       " 'objid': '2001620281634',\n",
       " 'conformity': 0.429,\n",
       " 'literacy': 0.343,\n",
       " 'aggression': 0.621,\n",
       " 'constitution': 0.305,\n",
       " 'isInFaction': '8774319370110',\n",
       " 'industry': 0.329,\n",
       " 'wealth': 0.328,\n",
       " 'factionLoyalty': 0.305,\n",
       " 'isIdle': 'true',\n",
       " 'username': 'william.jeffrey.harding@gmail.com',\n",
       " 'objtype': 'pop',\n",
       " 'id': '2001620281634',\n",
       " 'label': 'pop'}"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "growth.grow_pop(p,species,params,syllables)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>health</th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>conformity</th>\n",
       "      <th>literacy</th>\n",
       "      <th>aggression</th>\n",
       "      <th>constitution</th>\n",
       "      <th>isInFaction</th>\n",
       "      <th>industry</th>\n",
       "      <th>wealth</th>\n",
       "      <th>factionLoyalty</th>\n",
       "      <th>isIdle</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "      <th>label</th>\n",
       "      <th>text</th>\n",
       "      <th>visibleTo</th>\n",
       "      <th>time</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.3</td>\n",
       "      <td>Monuevil Harreipiador</td>\n",
       "      <td>7465445793593</td>\n",
       "      <td>0.416</td>\n",
       "      <td>0.469</td>\n",
       "      <td>0.456</td>\n",
       "      <td>0.521</td>\n",
       "      <td>9132659179734</td>\n",
       "      <td>0.284</td>\n",
       "      <td>0.324</td>\n",
       "      <td>0.433</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>7465445793593</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0.3</td>\n",
       "      <td>Monuevil Harreipiate</td>\n",
       "      <td>3197398916113</td>\n",
       "      <td>0.386</td>\n",
       "      <td>0.478</td>\n",
       "      <td>0.420</td>\n",
       "      <td>0.384</td>\n",
       "      <td>9132659179734</td>\n",
       "      <td>0.284</td>\n",
       "      <td>0.365</td>\n",
       "      <td>0.387</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>3197398916113</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>2264452032270</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Monuevil Harreipia) inhabiting...</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>23763.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0.3</td>\n",
       "      <td>Chan Lamauhalhay</td>\n",
       "      <td>0245165221776</td>\n",
       "      <td>0.554</td>\n",
       "      <td>0.715</td>\n",
       "      <td>0.461</td>\n",
       "      <td>0.589</td>\n",
       "      <td>2075919117794</td>\n",
       "      <td>0.307</td>\n",
       "      <td>0.267</td>\n",
       "      <td>0.537</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>0245165221776</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>8977074283212</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Chan Lamauhal) inhabiting Tese...</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>23763.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>0.3</td>\n",
       "      <td>Behaleslaikon Plare</td>\n",
       "      <td>3121628058607</td>\n",
       "      <td>0.539</td>\n",
       "      <td>0.528</td>\n",
       "      <td>0.719</td>\n",
       "      <td>0.415</td>\n",
       "      <td>8774319370110</td>\n",
       "      <td>0.329</td>\n",
       "      <td>0.221</td>\n",
       "      <td>0.334</td>\n",
       "      <td>true</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>3121628058607</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>3717898925491</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Behaleslaikon Pla) inhabiting ...</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>23763.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   health                   name          objid  conformity  literacy  \\\n",
       "0     0.3  Monuevil Harreipiador  7465445793593       0.416     0.469   \n",
       "1     0.3   Monuevil Harreipiate  3197398916113       0.386     0.478   \n",
       "2     NaN      population growth  2264452032270         NaN       NaN   \n",
       "3     0.3       Chan Lamauhalhay  0245165221776       0.554     0.715   \n",
       "4     NaN      population growth  8977074283212         NaN       NaN   \n",
       "5     0.3    Behaleslaikon Plare  3121628058607       0.539     0.528   \n",
       "6     NaN      population growth  3717898925491         NaN       NaN   \n",
       "\n",
       "   aggression  constitution    isInFaction  industry  wealth  factionLoyalty  \\\n",
       "0       0.456         0.521  9132659179734     0.284   0.324           0.433   \n",
       "1       0.420         0.384  9132659179734     0.284   0.365           0.387   \n",
       "2         NaN           NaN            NaN       NaN     NaN             NaN   \n",
       "3       0.461         0.589  2075919117794     0.307   0.267           0.537   \n",
       "4         NaN           NaN            NaN       NaN     NaN             NaN   \n",
       "5       0.719         0.415  8774319370110     0.329   0.221           0.334   \n",
       "6         NaN           NaN            NaN       NaN     NaN             NaN   \n",
       "\n",
       "  isIdle                           username objtype             id  label  \\\n",
       "0   true                      BillmanLocal2     pop  7465445793593    pop   \n",
       "1   true                      BillmanLocal2     pop  3197398916113    pop   \n",
       "2    NaN                                NaN     NaN            NaN  event   \n",
       "3   true                      BillmanLocal2     pop  0245165221776    pop   \n",
       "4    NaN                                NaN     NaN            NaN  event   \n",
       "5   true  william.jeffrey.harding@gmail.com     pop  3121628058607    pop   \n",
       "6    NaN                                NaN     NaN            NaN  event   \n",
       "\n",
       "                                                text  \\\n",
       "0                                                NaN   \n",
       "1                                                NaN   \n",
       "2  The population (Monuevil Harreipia) inhabiting...   \n",
       "3                                                NaN   \n",
       "4  The population (Chan Lamauhal) inhabiting Tese...   \n",
       "5                                                NaN   \n",
       "6  The population (Behaleslaikon Pla) inhabiting ...   \n",
       "\n",
       "                           visibleTo     time  \n",
       "0                                NaN      NaN  \n",
       "1                                NaN      NaN  \n",
       "2                      BillmanLocal2  23763.0  \n",
       "3                                NaN      NaN  \n",
       "4                      BillmanLocal2  23763.0  \n",
       "5                                NaN      NaN  \n",
       "6  william.jeffrey.harding@gmail.com  23763.0  "
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.DataFrame.from_records(nodes)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>label</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3197398916113</td>\n",
       "      <td>8622793176589</td>\n",
       "      <td>childOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>3197398916113</td>\n",
       "      <td>9132659179734</td>\n",
       "      <td>isInFaction</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3197398916113</td>\n",
       "      <td>5303083615604</td>\n",
       "      <td>isOfSpecies</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0245165221776</td>\n",
       "      <td>9972182873463</td>\n",
       "      <td>childOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0245165221776</td>\n",
       "      <td>2075919117794</td>\n",
       "      <td>isInFaction</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>0245165221776</td>\n",
       "      <td>5303083615604</td>\n",
       "      <td>isOfSpecies</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>3121628058607</td>\n",
       "      <td>7148617739848</td>\n",
       "      <td>childOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>3121628058607</td>\n",
       "      <td>8774319370110</td>\n",
       "      <td>isInFaction</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>3121628058607</td>\n",
       "      <td>0327650709394</td>\n",
       "      <td>isOfSpecies</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           node1          node2        label\n",
       "0  3197398916113  8622793176589      childOf\n",
       "1  3197398916113  9132659179734  isInFaction\n",
       "2  3197398916113  5303083615604  isOfSpecies\n",
       "3  0245165221776  9972182873463      childOf\n",
       "4  0245165221776  2075919117794  isInFaction\n",
       "5  0245165221776  5303083615604  isOfSpecies\n",
       "6  3121628058607  7148617739848      childOf\n",
       "7  3121628058607  8774319370110  isInFaction\n",
       "8  3121628058607  0327650709394  isOfSpecies"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.DataFrame.from_records(edges)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[\"\\n        g.V().has('objid','2264452032270')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','1566812213349'))\\n        \",\n",
       " \"\\n        g.V().has('objid','8622793176589')\\n            .addE('caused')\\n            .to(g.V().has('objid','2264452032270'))\\n        \",\n",
       " \"\\n        g.V().has('objid','8977074283212')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','1566812213349'))\\n        \",\n",
       " \"\\n        g.V().has('objid','9972182873463')\\n            .addE('caused')\\n            .to(g.V().has('objid','8977074283212'))\\n        \",\n",
       " \"\\n        g.V().has('objid','3717898925491')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','1212171618802'))\\n        \",\n",
       " \"\\n        g.V().has('objid','7148617739848')\\n            .addE('caused')\\n            .to(g.V().has('objid','3717898925491'))\\n        \"]"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "event_edges"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "exoplanets",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.0"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "625a17269cb94aebb094cbcf5e0e8340f26b69d46569da60e8fc69439048adbf"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
