{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Population growth\n",
    "* Populations that die are deleted, so they don't grow.\n",
    "* However all pops that can grow will, regardless of wheter they are starving or not. \n",
    "* Starving will lower thier health, which will eventually make them unable to grow. \n",
    "\n",
    "Sarving and Death is taken care of elsewhere, so this notebook won't have that filter. \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "executing local windows deployment\n"
     ]
    }
   ],
   "source": [
    "import sys\n",
    "import numpy as np\n",
    "import pandas as pd\n",
    "\n",
    "# mapping to the modules that make the app\n",
    "sys.path.insert(0, \"..\")\n",
    "sys.path.insert(0, \"../..\")\n",
    "sys.path.insert(0, \"../../app\")\n",
    "sys.path.insert(0, \"../../functions/popgrowth/\")\n",
    "\n",
    "import yaml, ssl, asyncio, pickle, os, ast\n",
    "\n",
    "ssl._create_default_https_context = ssl._create_unverified_context\n",
    "asyncio.set_event_loop_policy(asyncio.WindowsSelectorEventLoopPolicy())\n",
    "\n",
    "import nest_asyncio\n",
    "# this is required for running in a Jupyter Notebook. \n",
    "nest_asyncio.apply()\n",
    "\n",
    "#importing the libraries from the app\n",
    "from app.connectors import cmdb_graph\n",
    "from app.objects import time\n",
    "from app.objects import population\n",
    "from app.functions import language\n",
    "from helpers import test_queries\n",
    "\n",
    "c = cmdb_graph.CosmosdbClient()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Much of the Population growth is handled in scripts inside the Azure Function"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "params = yaml.safe_load(open(os.path.join(os.getenv(\"abspath\"),\"functions/popgrowth/settings.yml\")))\n",
    "syllables = pickle.load(open(os.path.join(os.getenv(\"abspath\"),\"app/creators/specs/syllables.p\"), \"rb\"))\n",
    "username = 'notebook'"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Time is updated by the `time` function. It is always running."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "< time at: 2023-08-01T00:50:24.366438+00:00 UTU:28311 >"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "t = time.Time(c)\n",
    "t.get_current_UTU()\n",
    "params['currentTime'] = t.params['currentTime']\n",
    "t"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'pop_health_requirement': 0.6,\n",
       " 'pop_consumes': 2,\n",
       " 'starve_damage': 0.05,\n",
       " 'changing_values': ['conformity',\n",
       "  'literacy',\n",
       "  'aggression',\n",
       "  'constitution',\n",
       "  'wealth',\n",
       "  'factionLoyalty'],\n",
       " 'currentTime': 28311}"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "params"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "For this notebook, setting the `pop_health_requirement` to an arbitrary value just to examine."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "params['pop_health_requirement'] = 0.4"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "# from tools import growth\n",
    "global_health_manager = population.Global_Pop_Manager(params,c)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "global_health_manager.get_pop_health()\n",
    "\n",
    "pops_df = pd.DataFrame([d['pop'] for d in global_health_manager.data])\n",
    "species_df = pd.DataFrame([d['species'] for d in global_health_manager.data])\n",
    "locations_df = pd.DataFrame([d['location'] for d in global_health_manager.data])\n",
    "factions_df = pd.DataFrame([d['faction'] for d in global_health_manager.data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "lenth of pops == 0 : False\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>health</th>\n",
       "      <th>isIdle</th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>conformity</th>\n",
       "      <th>literacy</th>\n",
       "      <th>aggression</th>\n",
       "      <th>constitution</th>\n",
       "      <th>isIn</th>\n",
       "      <th>industry</th>\n",
       "      <th>wealth</th>\n",
       "      <th>factionLoyalty</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.70</td>\n",
       "      <td>false</td>\n",
       "      <td>Obattla Magor</td>\n",
       "      <td>7467985401518</td>\n",
       "      <td>0.421</td>\n",
       "      <td>0.376</td>\n",
       "      <td>0.632</td>\n",
       "      <td>0.338</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.4850</td>\n",
       "      <td>0.4305</td>\n",
       "      <td>0.505</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>7467985401518</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Pe</td>\n",
       "      <td>5100638967625</td>\n",
       "      <td>0.325</td>\n",
       "      <td>0.352</td>\n",
       "      <td>0.606</td>\n",
       "      <td>0.450</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.5280</td>\n",
       "      <td>0.4400</td>\n",
       "      <td>0.459</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>5100638967625</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Van</td>\n",
       "      <td>1800951322768</td>\n",
       "      <td>0.446</td>\n",
       "      <td>0.390</td>\n",
       "      <td>0.549</td>\n",
       "      <td>0.573</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.5610</td>\n",
       "      <td>0.4755</td>\n",
       "      <td>0.423</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>1800951322768</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Rochi</td>\n",
       "      <td>0692394121482</td>\n",
       "      <td>0.452</td>\n",
       "      <td>0.395</td>\n",
       "      <td>0.514</td>\n",
       "      <td>0.546</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.5300</td>\n",
       "      <td>0.4625</td>\n",
       "      <td>0.354</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>0692394121482</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Hassia Sin</td>\n",
       "      <td>0248671359952</td>\n",
       "      <td>0.623</td>\n",
       "      <td>0.215</td>\n",
       "      <td>0.704</td>\n",
       "      <td>0.569</td>\n",
       "      <td>4146242421204</td>\n",
       "      <td>0.6365</td>\n",
       "      <td>0.4258</td>\n",
       "      <td>0.662</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>0248671359952</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>121</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Serzeampro Bilnoru</td>\n",
       "      <td>9142883900818</td>\n",
       "      <td>0.557</td>\n",
       "      <td>0.544</td>\n",
       "      <td>0.609</td>\n",
       "      <td>0.557</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.3500</td>\n",
       "      <td>0.3900</td>\n",
       "      <td>0.749</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>9142883900818</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>122</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ciki Yqa</td>\n",
       "      <td>2819449749992</td>\n",
       "      <td>0.298</td>\n",
       "      <td>0.586</td>\n",
       "      <td>0.489</td>\n",
       "      <td>0.468</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>0.2660</td>\n",
       "      <td>0.2940</td>\n",
       "      <td>0.316</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>2819449749992</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>123</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Serzeampro Wilfo</td>\n",
       "      <td>0872830607503</td>\n",
       "      <td>0.469</td>\n",
       "      <td>0.545</td>\n",
       "      <td>0.722</td>\n",
       "      <td>0.570</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.3940</td>\n",
       "      <td>0.2740</td>\n",
       "      <td>0.494</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>0872830607503</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>124</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Serzeampro Gradonnue</td>\n",
       "      <td>7834145976449</td>\n",
       "      <td>0.340</td>\n",
       "      <td>0.495</td>\n",
       "      <td>0.532</td>\n",
       "      <td>0.635</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.3450</td>\n",
       "      <td>0.3030</td>\n",
       "      <td>0.331</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>7834145976449</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>125</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ciki Fesha</td>\n",
       "      <td>0652360161340</td>\n",
       "      <td>0.524</td>\n",
       "      <td>0.726</td>\n",
       "      <td>0.452</td>\n",
       "      <td>0.635</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>0.2970</td>\n",
       "      <td>0.3150</td>\n",
       "      <td>0.521</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>0652360161340</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>126 rows × 15 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     health isIdle                  name          objid  conformity  literacy  \\\n",
       "0      0.70  false         Obattla Magor  7467985401518       0.421     0.376   \n",
       "1      0.70   true            Obattla Pe  5100638967625       0.325     0.352   \n",
       "2      0.70   true           Obattla Van  1800951322768       0.446     0.390   \n",
       "3      0.70   true         Obattla Rochi  0692394121482       0.452     0.395   \n",
       "4      0.70   true            Hassia Sin  0248671359952       0.623     0.215   \n",
       "..      ...    ...                   ...            ...         ...       ...   \n",
       "121    0.42   true    Serzeampro Bilnoru  9142883900818       0.557     0.544   \n",
       "122    0.42   true              Ciki Yqa  2819449749992       0.298     0.586   \n",
       "123    0.42   true      Serzeampro Wilfo  0872830607503       0.469     0.545   \n",
       "124    0.42   true  Serzeampro Gradonnue  7834145976449       0.340     0.495   \n",
       "125    0.42   true            Ciki Fesha  0652360161340       0.524     0.726   \n",
       "\n",
       "     aggression  constitution           isIn  industry  wealth  \\\n",
       "0         0.632         0.338  8822366435138    0.4850  0.4305   \n",
       "1         0.606         0.450  8822366435138    0.5280  0.4400   \n",
       "2         0.549         0.573  8822366435138    0.5610  0.4755   \n",
       "3         0.514         0.546  8822366435138    0.5300  0.4625   \n",
       "4         0.704         0.569  4146242421204    0.6365  0.4258   \n",
       "..          ...           ...            ...       ...     ...   \n",
       "121       0.609         0.557  4873232607770    0.3500  0.3900   \n",
       "122       0.489         0.468  0015468195520    0.2660  0.2940   \n",
       "123       0.722         0.570  4873232607770    0.3940  0.2740   \n",
       "124       0.532         0.635  4873232607770    0.3450  0.3030   \n",
       "125       0.452         0.635  0015468195520    0.2970  0.3150   \n",
       "\n",
       "     factionLoyalty       username objtype             id  \n",
       "0             0.505  BillmanLocal2     pop  7467985401518  \n",
       "1             0.459  BillmanLocal2     pop  5100638967625  \n",
       "2             0.423  BillmanLocal2     pop  1800951322768  \n",
       "3             0.354  BillmanLocal2     pop  0692394121482  \n",
       "4             0.662  BillmanLocal2     pop  0248671359952  \n",
       "..              ...            ...     ...            ...  \n",
       "121           0.749  Billmanserver     pop  9142883900818  \n",
       "122           0.316  Billmanserver     pop  2819449749992  \n",
       "123           0.494  Billmanserver     pop  0872830607503  \n",
       "124           0.331  Billmanserver     pop  7834145976449  \n",
       "125           0.521  Billmanserver     pop  0652360161340  \n",
       "\n",
       "[126 rows x 15 columns]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# pops_df,species_df,locations_df,factions_df = growth.get_pop_health(c,params)\n",
    "print(f\"lenth of pops == 0 : {len(pops_df)==0}\")\n",
    "pops_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>consumes</th>\n",
       "      <th>effuses</th>\n",
       "      <th>viral_resilience</th>\n",
       "      <th>habitat_resilience</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Koykudra</td>\n",
       "      <td>4291284873310</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>4291284873310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Koykudra</td>\n",
       "      <td>4291284873310</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>4291284873310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Koykudra</td>\n",
       "      <td>4291284873310</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>4291284873310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Koykudra</td>\n",
       "      <td>4291284873310</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>4291284873310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Koykudra</td>\n",
       "      <td>4291284873310</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>4291284873310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>121</th>\n",
       "      <td>Til</td>\n",
       "      <td>5478087080681</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>species</td>\n",
       "      <td>5478087080681</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>122</th>\n",
       "      <td>Til</td>\n",
       "      <td>5478087080681</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>species</td>\n",
       "      <td>5478087080681</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>123</th>\n",
       "      <td>Til</td>\n",
       "      <td>5478087080681</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>species</td>\n",
       "      <td>5478087080681</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>124</th>\n",
       "      <td>Til</td>\n",
       "      <td>5478087080681</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>species</td>\n",
       "      <td>5478087080681</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>125</th>\n",
       "      <td>Til</td>\n",
       "      <td>5478087080681</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>species</td>\n",
       "      <td>5478087080681</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>126 rows × 9 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "         name          objid   consumes                    effuses  \\\n",
       "0    Koykudra  4291284873310  [Organic]  [Organic waste, Plastics]   \n",
       "1    Koykudra  4291284873310  [Organic]  [Organic waste, Plastics]   \n",
       "2    Koykudra  4291284873310  [Organic]  [Organic waste, Plastics]   \n",
       "3    Koykudra  4291284873310  [Organic]  [Organic waste, Plastics]   \n",
       "4    Koykudra  4291284873310  [Organic]  [Organic waste, Plastics]   \n",
       "..        ...            ...        ...                        ...   \n",
       "121       Til  5478087080681  [Organic]  [Organic waste, Plastics]   \n",
       "122       Til  5478087080681  [Organic]  [Organic waste, Plastics]   \n",
       "123       Til  5478087080681  [Organic]  [Organic waste, Plastics]   \n",
       "124       Til  5478087080681  [Organic]  [Organic waste, Plastics]   \n",
       "125       Til  5478087080681  [Organic]  [Organic waste, Plastics]   \n",
       "\n",
       "     viral_resilience  habitat_resilience       username  objtype  \\\n",
       "0                 0.7                 0.2  BillmanLocal2  species   \n",
       "1                 0.7                 0.2  BillmanLocal2  species   \n",
       "2                 0.7                 0.2  BillmanLocal2  species   \n",
       "3                 0.7                 0.2  BillmanLocal2  species   \n",
       "4                 0.7                 0.2  BillmanLocal2  species   \n",
       "..                ...                 ...            ...      ...   \n",
       "121               0.7                 0.2  Billmanserver  species   \n",
       "122               0.7                 0.2  Billmanserver  species   \n",
       "123               0.7                 0.2  Billmanserver  species   \n",
       "124               0.7                 0.2  Billmanserver  species   \n",
       "125               0.7                 0.2  Billmanserver  species   \n",
       "\n",
       "                id  \n",
       "0    4291284873310  \n",
       "1    4291284873310  \n",
       "2    4291284873310  \n",
       "3    4291284873310  \n",
       "4    4291284873310  \n",
       "..             ...  \n",
       "121  5478087080681  \n",
       "122  5478087080681  \n",
       "123  5478087080681  \n",
       "124  5478087080681  \n",
       "125  5478087080681  \n",
       "\n",
       "[126 rows x 9 columns]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "species_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>class</th>\n",
       "      <th>objid</th>\n",
       "      <th>radius</th>\n",
       "      <th>mass</th>\n",
       "      <th>orbitsDistance</th>\n",
       "      <th>orbitsId</th>\n",
       "      <th>orbitsName</th>\n",
       "      <th>isSupportsLife</th>\n",
       "      <th>isPopulated</th>\n",
       "      <th>isHomeworld</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Dorf</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>2972908340606</td>\n",
       "      <td>0.884</td>\n",
       "      <td>0.882</td>\n",
       "      <td>1.057</td>\n",
       "      <td>9570931993836</td>\n",
       "      <td>Lisallos</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>2972908340606</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Dorf</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>2972908340606</td>\n",
       "      <td>0.884</td>\n",
       "      <td>0.882</td>\n",
       "      <td>1.057</td>\n",
       "      <td>9570931993836</td>\n",
       "      <td>Lisallos</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>2972908340606</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Dorf</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>2972908340606</td>\n",
       "      <td>0.884</td>\n",
       "      <td>0.882</td>\n",
       "      <td>1.057</td>\n",
       "      <td>9570931993836</td>\n",
       "      <td>Lisallos</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>2972908340606</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Dorf</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>2972908340606</td>\n",
       "      <td>0.884</td>\n",
       "      <td>0.882</td>\n",
       "      <td>1.057</td>\n",
       "      <td>9570931993836</td>\n",
       "      <td>Lisallos</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>2972908340606</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Dorf</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>2972908340606</td>\n",
       "      <td>0.884</td>\n",
       "      <td>0.882</td>\n",
       "      <td>1.057</td>\n",
       "      <td>9570931993836</td>\n",
       "      <td>Lisallos</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>2972908340606</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>121</th>\n",
       "      <td>Taipe</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>8490894854096</td>\n",
       "      <td>0.898</td>\n",
       "      <td>0.113</td>\n",
       "      <td>1.087</td>\n",
       "      <td>1849212388331</td>\n",
       "      <td>Lindraja</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>planet</td>\n",
       "      <td>8490894854096</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>122</th>\n",
       "      <td>Taipe</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>8490894854096</td>\n",
       "      <td>0.898</td>\n",
       "      <td>0.113</td>\n",
       "      <td>1.087</td>\n",
       "      <td>1849212388331</td>\n",
       "      <td>Lindraja</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>planet</td>\n",
       "      <td>8490894854096</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>123</th>\n",
       "      <td>Taipe</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>8490894854096</td>\n",
       "      <td>0.898</td>\n",
       "      <td>0.113</td>\n",
       "      <td>1.087</td>\n",
       "      <td>1849212388331</td>\n",
       "      <td>Lindraja</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>planet</td>\n",
       "      <td>8490894854096</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>124</th>\n",
       "      <td>Taipe</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>8490894854096</td>\n",
       "      <td>0.898</td>\n",
       "      <td>0.113</td>\n",
       "      <td>1.087</td>\n",
       "      <td>1849212388331</td>\n",
       "      <td>Lindraja</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>planet</td>\n",
       "      <td>8490894854096</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>125</th>\n",
       "      <td>Taipe</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>8490894854096</td>\n",
       "      <td>0.898</td>\n",
       "      <td>0.113</td>\n",
       "      <td>1.087</td>\n",
       "      <td>1849212388331</td>\n",
       "      <td>Lindraja</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>planet</td>\n",
       "      <td>8490894854096</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>126 rows × 14 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      name        class          objid  radius   mass  orbitsDistance  \\\n",
       "0     Dorf  terrestrial  2972908340606   0.884  0.882           1.057   \n",
       "1     Dorf  terrestrial  2972908340606   0.884  0.882           1.057   \n",
       "2     Dorf  terrestrial  2972908340606   0.884  0.882           1.057   \n",
       "3     Dorf  terrestrial  2972908340606   0.884  0.882           1.057   \n",
       "4     Dorf  terrestrial  2972908340606   0.884  0.882           1.057   \n",
       "..     ...          ...            ...     ...    ...             ...   \n",
       "121  Taipe  terrestrial  8490894854096   0.898  0.113           1.087   \n",
       "122  Taipe  terrestrial  8490894854096   0.898  0.113           1.087   \n",
       "123  Taipe  terrestrial  8490894854096   0.898  0.113           1.087   \n",
       "124  Taipe  terrestrial  8490894854096   0.898  0.113           1.087   \n",
       "125  Taipe  terrestrial  8490894854096   0.898  0.113           1.087   \n",
       "\n",
       "          orbitsId orbitsName isSupportsLife isPopulated isHomeworld  \\\n",
       "0    9570931993836   Lisallos           true        true        true   \n",
       "1    9570931993836   Lisallos           true        true        true   \n",
       "2    9570931993836   Lisallos           true        true        true   \n",
       "3    9570931993836   Lisallos           true        true        true   \n",
       "4    9570931993836   Lisallos           true        true        true   \n",
       "..             ...        ...            ...         ...         ...   \n",
       "121  1849212388331   Lindraja           true        true        true   \n",
       "122  1849212388331   Lindraja           true        true        true   \n",
       "123  1849212388331   Lindraja           true        true        true   \n",
       "124  1849212388331   Lindraja           true        true        true   \n",
       "125  1849212388331   Lindraja           true        true        true   \n",
       "\n",
       "          username objtype             id  \n",
       "0    BillmanLocal2  planet  2972908340606  \n",
       "1    BillmanLocal2  planet  2972908340606  \n",
       "2    BillmanLocal2  planet  2972908340606  \n",
       "3    BillmanLocal2  planet  2972908340606  \n",
       "4    BillmanLocal2  planet  2972908340606  \n",
       "..             ...     ...            ...  \n",
       "121  Billmanserver  planet  8490894854096  \n",
       "122  Billmanserver  planet  8490894854096  \n",
       "123  Billmanserver  planet  8490894854096  \n",
       "124  Billmanserver  planet  8490894854096  \n",
       "125  Billmanserver  planet  8490894854096  \n",
       "\n",
       "[126 rows x 14 columns]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "locations_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>pop_locations</th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>lat</th>\n",
       "      <th>long</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "      <th>pop_loactions</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[[0, 0], [-1, 1], [-2, 0], [0, 2], [-1, -1], [...</td>\n",
       "      <td>Obattla</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>-0.149</td>\n",
       "      <td>0.0</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>faction</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[[0, 0], [-1, 1], [-2, 0], [0, 2], [-1, -1], [...</td>\n",
       "      <td>Obattla</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>-0.149</td>\n",
       "      <td>0.0</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>faction</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[[0, 0], [-1, 1], [-2, 0], [0, 2], [-1, -1], [...</td>\n",
       "      <td>Obattla</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>-0.149</td>\n",
       "      <td>0.0</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>faction</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[[0, 0], [-1, 1], [-2, 0], [0, 2], [-1, -1], [...</td>\n",
       "      <td>Obattla</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>-0.149</td>\n",
       "      <td>0.0</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>faction</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[[0, 0], [-2, 2], [-1, -1], [2, 0], [-1, 3], [...</td>\n",
       "      <td>Hassia</td>\n",
       "      <td>4146242421204</td>\n",
       "      <td>0.149</td>\n",
       "      <td>0.0</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>faction</td>\n",
       "      <td>4146242421204</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>121</th>\n",
       "      <td>[[0, 0], [2, -2], [0, -2], [-2, -2], [0, 2], [...</td>\n",
       "      <td>Serzeampro</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.113</td>\n",
       "      <td>0.0</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>faction</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>122</th>\n",
       "      <td>[[0, 0], [0, -2], [-2, 2], [-2, -2], [2, 2], [...</td>\n",
       "      <td>Ciki</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>-0.113</td>\n",
       "      <td>0.0</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>faction</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>123</th>\n",
       "      <td>[[0, 0], [2, -2], [0, -2], [-2, -2], [0, 2], [...</td>\n",
       "      <td>Serzeampro</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.113</td>\n",
       "      <td>0.0</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>faction</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>124</th>\n",
       "      <td>[[0, 0], [2, -2], [0, -2], [-2, -2], [0, 2], [...</td>\n",
       "      <td>Serzeampro</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.113</td>\n",
       "      <td>0.0</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>faction</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>125</th>\n",
       "      <td>[[0, 0], [0, -2], [-2, 2], [-2, -2], [2, 2], [...</td>\n",
       "      <td>Ciki</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>-0.113</td>\n",
       "      <td>0.0</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>faction</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>126 rows × 9 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                         pop_locations        name  \\\n",
       "0    [[0, 0], [-1, 1], [-2, 0], [0, 2], [-1, -1], [...     Obattla   \n",
       "1    [[0, 0], [-1, 1], [-2, 0], [0, 2], [-1, -1], [...     Obattla   \n",
       "2    [[0, 0], [-1, 1], [-2, 0], [0, 2], [-1, -1], [...     Obattla   \n",
       "3    [[0, 0], [-1, 1], [-2, 0], [0, 2], [-1, -1], [...     Obattla   \n",
       "4    [[0, 0], [-2, 2], [-1, -1], [2, 0], [-1, 3], [...      Hassia   \n",
       "..                                                 ...         ...   \n",
       "121  [[0, 0], [2, -2], [0, -2], [-2, -2], [0, 2], [...  Serzeampro   \n",
       "122  [[0, 0], [0, -2], [-2, 2], [-2, -2], [2, 2], [...        Ciki   \n",
       "123  [[0, 0], [2, -2], [0, -2], [-2, -2], [0, 2], [...  Serzeampro   \n",
       "124  [[0, 0], [2, -2], [0, -2], [-2, -2], [0, 2], [...  Serzeampro   \n",
       "125  [[0, 0], [0, -2], [-2, 2], [-2, -2], [2, 2], [...        Ciki   \n",
       "\n",
       "             objid    lat  long       username  objtype             id  \\\n",
       "0    8822366435138 -0.149   0.0  BillmanLocal2  faction  8822366435138   \n",
       "1    8822366435138 -0.149   0.0  BillmanLocal2  faction  8822366435138   \n",
       "2    8822366435138 -0.149   0.0  BillmanLocal2  faction  8822366435138   \n",
       "3    8822366435138 -0.149   0.0  BillmanLocal2  faction  8822366435138   \n",
       "4    4146242421204  0.149   0.0  BillmanLocal2  faction  4146242421204   \n",
       "..             ...    ...   ...            ...      ...            ...   \n",
       "121  4873232607770  0.113   0.0  Billmanserver  faction  4873232607770   \n",
       "122  0015468195520 -0.113   0.0  Billmanserver  faction  0015468195520   \n",
       "123  4873232607770  0.113   0.0  Billmanserver  faction  4873232607770   \n",
       "124  4873232607770  0.113   0.0  Billmanserver  faction  4873232607770   \n",
       "125  0015468195520 -0.113   0.0  Billmanserver  faction  0015468195520   \n",
       "\n",
       "    pop_loactions  \n",
       "0             NaN  \n",
       "1             NaN  \n",
       "2             NaN  \n",
       "3             NaN  \n",
       "4             NaN  \n",
       "..            ...  \n",
       "121           NaN  \n",
       "122           NaN  \n",
       "123           NaN  \n",
       "124           NaN  \n",
       "125           NaN  \n",
       "\n",
       "[126 rows x 9 columns]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "factions_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>health</th>\n",
       "      <th>isIdle</th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>conformity</th>\n",
       "      <th>literacy</th>\n",
       "      <th>aggression</th>\n",
       "      <th>constitution</th>\n",
       "      <th>isIn</th>\n",
       "      <th>industry</th>\n",
       "      <th>wealth</th>\n",
       "      <th>factionLoyalty</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Van</td>\n",
       "      <td>1800951322768</td>\n",
       "      <td>0.446</td>\n",
       "      <td>0.390</td>\n",
       "      <td>0.549</td>\n",
       "      <td>0.573</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.5610</td>\n",
       "      <td>0.4755</td>\n",
       "      <td>0.423</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>1800951322768</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Hassia Sin</td>\n",
       "      <td>0248671359952</td>\n",
       "      <td>0.623</td>\n",
       "      <td>0.215</td>\n",
       "      <td>0.704</td>\n",
       "      <td>0.569</td>\n",
       "      <td>4146242421204</td>\n",
       "      <td>0.6365</td>\n",
       "      <td>0.4258</td>\n",
       "      <td>0.662</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>0248671359952</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Artes</td>\n",
       "      <td>9819392335838</td>\n",
       "      <td>0.488</td>\n",
       "      <td>0.383</td>\n",
       "      <td>0.572</td>\n",
       "      <td>0.570</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.5710</td>\n",
       "      <td>0.4770</td>\n",
       "      <td>0.497</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>9819392335838</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Peu</td>\n",
       "      <td>5350816288225</td>\n",
       "      <td>0.249</td>\n",
       "      <td>0.308</td>\n",
       "      <td>0.557</td>\n",
       "      <td>0.421</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.3170</td>\n",
       "      <td>0.2850</td>\n",
       "      <td>0.519</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>5350816288225</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Arteshy</td>\n",
       "      <td>3348033092776</td>\n",
       "      <td>0.489</td>\n",
       "      <td>0.283</td>\n",
       "      <td>0.501</td>\n",
       "      <td>0.606</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.3430</td>\n",
       "      <td>0.3020</td>\n",
       "      <td>0.484</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>3348033092776</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Servo</td>\n",
       "      <td>9772027208419</td>\n",
       "      <td>0.344</td>\n",
       "      <td>0.401</td>\n",
       "      <td>0.545</td>\n",
       "      <td>0.670</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.3470</td>\n",
       "      <td>0.3230</td>\n",
       "      <td>0.498</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>9772027208419</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Wo</td>\n",
       "      <td>9552341693154</td>\n",
       "      <td>0.494</td>\n",
       "      <td>0.615</td>\n",
       "      <td>0.354</td>\n",
       "      <td>0.410</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.3820</td>\n",
       "      <td>0.4985</td>\n",
       "      <td>0.485</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>9552341693154</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Zopon Haydorfkerberg</td>\n",
       "      <td>1417654942596</td>\n",
       "      <td>0.370</td>\n",
       "      <td>0.389</td>\n",
       "      <td>0.509</td>\n",
       "      <td>0.389</td>\n",
       "      <td>9376731217333</td>\n",
       "      <td>0.4490</td>\n",
       "      <td>0.4190</td>\n",
       "      <td>0.510</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>1417654942596</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Lismontpastil</td>\n",
       "      <td>4150839486690</td>\n",
       "      <td>0.576</td>\n",
       "      <td>0.508</td>\n",
       "      <td>0.380</td>\n",
       "      <td>0.648</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.5140</td>\n",
       "      <td>0.5110</td>\n",
       "      <td>0.692</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>4150839486690</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Quabanmarwar</td>\n",
       "      <td>1786540026813</td>\n",
       "      <td>0.473</td>\n",
       "      <td>0.475</td>\n",
       "      <td>0.511</td>\n",
       "      <td>0.539</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.4750</td>\n",
       "      <td>0.4750</td>\n",
       "      <td>0.491</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>1786540026813</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>0.70</td>\n",
       "      <td>false</td>\n",
       "      <td>Tilcasport Tla</td>\n",
       "      <td>3298484338584</td>\n",
       "      <td>0.780</td>\n",
       "      <td>0.751</td>\n",
       "      <td>0.252</td>\n",
       "      <td>0.195</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.2235</td>\n",
       "      <td>0.4872</td>\n",
       "      <td>0.788</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>3298484338584</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Boupatciace</td>\n",
       "      <td>4742850136180</td>\n",
       "      <td>0.692</td>\n",
       "      <td>0.822</td>\n",
       "      <td>0.374</td>\n",
       "      <td>0.187</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.2555</td>\n",
       "      <td>0.4888</td>\n",
       "      <td>0.855</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>4742850136180</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Siatiapec</td>\n",
       "      <td>5669843388137</td>\n",
       "      <td>0.859</td>\n",
       "      <td>0.824</td>\n",
       "      <td>0.225</td>\n",
       "      <td>0.232</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.2285</td>\n",
       "      <td>0.3762</td>\n",
       "      <td>0.827</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>5669843388137</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>0.75</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Niaar</td>\n",
       "      <td>7036253430140</td>\n",
       "      <td>0.584</td>\n",
       "      <td>0.692</td>\n",
       "      <td>0.252</td>\n",
       "      <td>0.248</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.2500</td>\n",
       "      <td>0.4210</td>\n",
       "      <td>0.521</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>7036253430140</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>0.75</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Tos</td>\n",
       "      <td>1437057417022</td>\n",
       "      <td>0.752</td>\n",
       "      <td>0.622</td>\n",
       "      <td>0.327</td>\n",
       "      <td>0.251</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.2890</td>\n",
       "      <td>0.4055</td>\n",
       "      <td>0.715</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>1437057417022</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Tlacen</td>\n",
       "      <td>9570919893877</td>\n",
       "      <td>0.715</td>\n",
       "      <td>0.711</td>\n",
       "      <td>0.197</td>\n",
       "      <td>0.199</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.1340</td>\n",
       "      <td>0.3290</td>\n",
       "      <td>0.810</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>9570919893877</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Magorgan</td>\n",
       "      <td>6074420508131</td>\n",
       "      <td>0.513</td>\n",
       "      <td>0.380</td>\n",
       "      <td>0.671</td>\n",
       "      <td>0.364</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.2910</td>\n",
       "      <td>0.1870</td>\n",
       "      <td>0.441</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>6074420508131</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Pemac</td>\n",
       "      <td>2299636896903</td>\n",
       "      <td>0.396</td>\n",
       "      <td>0.339</td>\n",
       "      <td>0.658</td>\n",
       "      <td>0.416</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.3170</td>\n",
       "      <td>0.3300</td>\n",
       "      <td>0.477</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>2299636896903</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Rochifield</td>\n",
       "      <td>1059188390521</td>\n",
       "      <td>0.364</td>\n",
       "      <td>0.316</td>\n",
       "      <td>0.540</td>\n",
       "      <td>0.456</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.3180</td>\n",
       "      <td>0.2240</td>\n",
       "      <td>0.345</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>1059188390521</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Artesner</td>\n",
       "      <td>3135645518769</td>\n",
       "      <td>0.473</td>\n",
       "      <td>0.469</td>\n",
       "      <td>0.568</td>\n",
       "      <td>0.610</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.3430</td>\n",
       "      <td>0.2790</td>\n",
       "      <td>0.538</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>3135645518769</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Sertan</td>\n",
       "      <td>5065137436307</td>\n",
       "      <td>0.396</td>\n",
       "      <td>0.390</td>\n",
       "      <td>0.603</td>\n",
       "      <td>0.654</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.3470</td>\n",
       "      <td>0.2680</td>\n",
       "      <td>0.416</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>5065137436307</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Niaarbeach</td>\n",
       "      <td>3773349428121</td>\n",
       "      <td>0.488</td>\n",
       "      <td>0.613</td>\n",
       "      <td>0.226</td>\n",
       "      <td>0.321</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.1500</td>\n",
       "      <td>0.2540</td>\n",
       "      <td>0.590</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>3773349428121</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>54</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Hassia Sinwe</td>\n",
       "      <td>6897035664431</td>\n",
       "      <td>0.563</td>\n",
       "      <td>0.269</td>\n",
       "      <td>0.659</td>\n",
       "      <td>0.504</td>\n",
       "      <td>4146242421204</td>\n",
       "      <td>0.3820</td>\n",
       "      <td>0.3450</td>\n",
       "      <td>0.699</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>6897035664431</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>55</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Siacarratdia</td>\n",
       "      <td>6941269568884</td>\n",
       "      <td>0.521</td>\n",
       "      <td>0.525</td>\n",
       "      <td>0.398</td>\n",
       "      <td>0.545</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.2570</td>\n",
       "      <td>0.3520</td>\n",
       "      <td>0.771</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>6941269568884</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>56</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Woja</td>\n",
       "      <td>7863646225535</td>\n",
       "      <td>0.538</td>\n",
       "      <td>0.581</td>\n",
       "      <td>0.345</td>\n",
       "      <td>0.490</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.2290</td>\n",
       "      <td>0.3360</td>\n",
       "      <td>0.396</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>7863646225535</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>57</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Zopon Haydorfkerbergqua</td>\n",
       "      <td>9495139972228</td>\n",
       "      <td>0.331</td>\n",
       "      <td>0.391</td>\n",
       "      <td>0.599</td>\n",
       "      <td>0.337</td>\n",
       "      <td>9376731217333</td>\n",
       "      <td>0.2690</td>\n",
       "      <td>0.1690</td>\n",
       "      <td>0.509</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>9495139972228</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>58</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Aytudro</td>\n",
       "      <td>5841609833234</td>\n",
       "      <td>0.558</td>\n",
       "      <td>0.631</td>\n",
       "      <td>0.392</td>\n",
       "      <td>0.426</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.2570</td>\n",
       "      <td>0.2530</td>\n",
       "      <td>0.585</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>5841609833234</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>59</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Quabanmarwarsa</td>\n",
       "      <td>0531521583377</td>\n",
       "      <td>0.462</td>\n",
       "      <td>0.377</td>\n",
       "      <td>0.446</td>\n",
       "      <td>0.503</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.2850</td>\n",
       "      <td>0.3820</td>\n",
       "      <td>0.504</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>0531521583377</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>66</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Magorlon</td>\n",
       "      <td>1513984569596</td>\n",
       "      <td>0.371</td>\n",
       "      <td>0.378</td>\n",
       "      <td>0.555</td>\n",
       "      <td>0.424</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.2910</td>\n",
       "      <td>0.2150</td>\n",
       "      <td>0.509</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>1513984569596</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>69</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Zopon Haydorfkerbergbou</td>\n",
       "      <td>4099521721838</td>\n",
       "      <td>0.370</td>\n",
       "      <td>0.343</td>\n",
       "      <td>0.459</td>\n",
       "      <td>0.365</td>\n",
       "      <td>9376731217333</td>\n",
       "      <td>0.2690</td>\n",
       "      <td>0.1970</td>\n",
       "      <td>0.587</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>4099521721838</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>73</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Boupatciacekoy</td>\n",
       "      <td>0389248018331</td>\n",
       "      <td>0.769</td>\n",
       "      <td>0.724</td>\n",
       "      <td>0.359</td>\n",
       "      <td>0.135</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.1530</td>\n",
       "      <td>0.3410</td>\n",
       "      <td>0.912</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>0389248018331</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>74</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Siatiapecac</td>\n",
       "      <td>6434625393637</td>\n",
       "      <td>0.883</td>\n",
       "      <td>0.815</td>\n",
       "      <td>0.260</td>\n",
       "      <td>0.200</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.1370</td>\n",
       "      <td>0.1320</td>\n",
       "      <td>0.747</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>6434625393637</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>77</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Vanhin</td>\n",
       "      <td>2721412697024</td>\n",
       "      <td>0.449</td>\n",
       "      <td>0.414</td>\n",
       "      <td>0.501</td>\n",
       "      <td>0.566</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.3370</td>\n",
       "      <td>0.1980</td>\n",
       "      <td>0.436</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>2721412697024</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>78</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Artestai</td>\n",
       "      <td>3735917286448</td>\n",
       "      <td>0.416</td>\n",
       "      <td>0.332</td>\n",
       "      <td>0.629</td>\n",
       "      <td>0.654</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.3430</td>\n",
       "      <td>0.2860</td>\n",
       "      <td>0.463</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>3735917286448</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>84</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Zopon Lischarhalai</td>\n",
       "      <td>5908398361747</td>\n",
       "      <td>0.561</td>\n",
       "      <td>0.461</td>\n",
       "      <td>0.641</td>\n",
       "      <td>0.427</td>\n",
       "      <td>9376731217333</td>\n",
       "      <td>0.2910</td>\n",
       "      <td>0.3180</td>\n",
       "      <td>0.618</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>5908398361747</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>88</th>\n",
       "      <td>0.45</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Tosrang</td>\n",
       "      <td>9820062295194</td>\n",
       "      <td>0.720</td>\n",
       "      <td>0.602</td>\n",
       "      <td>0.284</td>\n",
       "      <td>0.265</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.1730</td>\n",
       "      <td>0.2280</td>\n",
       "      <td>0.801</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>9820062295194</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>93</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Wono</td>\n",
       "      <td>5856112216725</td>\n",
       "      <td>0.524</td>\n",
       "      <td>0.583</td>\n",
       "      <td>0.366</td>\n",
       "      <td>0.506</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.2290</td>\n",
       "      <td>0.3170</td>\n",
       "      <td>0.474</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>5856112216725</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>97</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Quabanmarwaro</td>\n",
       "      <td>6321321817492</td>\n",
       "      <td>0.411</td>\n",
       "      <td>0.436</td>\n",
       "      <td>0.505</td>\n",
       "      <td>0.567</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.2850</td>\n",
       "      <td>0.2180</td>\n",
       "      <td>0.405</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>6321321817492</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>100</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Serzeampro Bilno</td>\n",
       "      <td>9890591392190</td>\n",
       "      <td>0.481</td>\n",
       "      <td>0.519</td>\n",
       "      <td>0.608</td>\n",
       "      <td>0.557</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.5825</td>\n",
       "      <td>0.5508</td>\n",
       "      <td>0.706</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>9890591392190</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>101</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Ciki Dadcas</td>\n",
       "      <td>9068536152668</td>\n",
       "      <td>0.436</td>\n",
       "      <td>0.457</td>\n",
       "      <td>0.526</td>\n",
       "      <td>0.354</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>0.4400</td>\n",
       "      <td>0.4485</td>\n",
       "      <td>0.462</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>9068536152668</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>102</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Ciki Y</td>\n",
       "      <td>4377394578049</td>\n",
       "      <td>0.366</td>\n",
       "      <td>0.554</td>\n",
       "      <td>0.430</td>\n",
       "      <td>0.456</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>0.4430</td>\n",
       "      <td>0.4985</td>\n",
       "      <td>0.412</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>4377394578049</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>105</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Serzeampro Gradon</td>\n",
       "      <td>8096543483724</td>\n",
       "      <td>0.432</td>\n",
       "      <td>0.502</td>\n",
       "      <td>0.546</td>\n",
       "      <td>0.604</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.5750</td>\n",
       "      <td>0.5385</td>\n",
       "      <td>0.375</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>8096543483724</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>106</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Ciki Fe</td>\n",
       "      <td>8876287369940</td>\n",
       "      <td>0.456</td>\n",
       "      <td>0.725</td>\n",
       "      <td>0.428</td>\n",
       "      <td>0.562</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>0.4950</td>\n",
       "      <td>0.6100</td>\n",
       "      <td>0.529</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>8876287369940</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>107</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Magorah</td>\n",
       "      <td>5087070127104</td>\n",
       "      <td>0.433</td>\n",
       "      <td>0.318</td>\n",
       "      <td>0.612</td>\n",
       "      <td>0.322</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.2910</td>\n",
       "      <td>0.2090</td>\n",
       "      <td>0.465</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>5087070127104</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>109</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Hassia Sinkoy</td>\n",
       "      <td>1756526331281</td>\n",
       "      <td>0.556</td>\n",
       "      <td>0.150</td>\n",
       "      <td>0.683</td>\n",
       "      <td>0.619</td>\n",
       "      <td>4146242421204</td>\n",
       "      <td>0.3820</td>\n",
       "      <td>0.3300</td>\n",
       "      <td>0.631</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>1756526331281</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>111</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Wosun</td>\n",
       "      <td>9629904984175</td>\n",
       "      <td>0.400</td>\n",
       "      <td>0.521</td>\n",
       "      <td>0.351</td>\n",
       "      <td>0.345</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.2290</td>\n",
       "      <td>0.2960</td>\n",
       "      <td>0.583</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>9629904984175</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>112</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Zopon Haydorfkerbergganj</td>\n",
       "      <td>8026028327611</td>\n",
       "      <td>0.437</td>\n",
       "      <td>0.344</td>\n",
       "      <td>0.548</td>\n",
       "      <td>0.351</td>\n",
       "      <td>9376731217333</td>\n",
       "      <td>0.2690</td>\n",
       "      <td>0.2610</td>\n",
       "      <td>0.442</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>8026028327611</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>124</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Serzeampro Gradonnue</td>\n",
       "      <td>7834145976449</td>\n",
       "      <td>0.340</td>\n",
       "      <td>0.495</td>\n",
       "      <td>0.532</td>\n",
       "      <td>0.635</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.3450</td>\n",
       "      <td>0.3030</td>\n",
       "      <td>0.331</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>7834145976449</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     health isIdle                       name          objid  conformity  \\\n",
       "2      0.70   true                Obattla Van  1800951322768       0.446   \n",
       "4      0.70   true                 Hassia Sin  0248671359952       0.623   \n",
       "5      0.70   true              Obattla Artes  9819392335838       0.488   \n",
       "8      0.42   true                Obattla Peu  5350816288225       0.249   \n",
       "14     0.42   true            Obattla Arteshy  3348033092776       0.489   \n",
       "15     0.42   true              Obattla Servo  9772027208419       0.344   \n",
       "17     0.70   true                 Ganjtil Wo  9552341693154       0.494   \n",
       "18     0.70   true       Zopon Haydorfkerberg  1417654942596       0.370   \n",
       "20     0.70   true      Ganjtil Lismontpastil  4150839486690       0.576   \n",
       "21     0.70   true       Ganjtil Quabanmarwar  1786540026813       0.473   \n",
       "23     0.70  false             Tilcasport Tla  3298484338584       0.780   \n",
       "24     0.70   true     Tilcasport Boupatciace  4742850136180       0.692   \n",
       "25     0.70   true       Tilcasport Siatiapec  5669843388137       0.859   \n",
       "26     0.75   true           Tilcasport Niaar  7036253430140       0.584   \n",
       "28     0.75   true             Tilcasport Tos  1437057417022       0.752   \n",
       "35     0.42   true          Tilcasport Tlacen  9570919893877       0.715   \n",
       "38     0.42   true           Obattla Magorgan  6074420508131       0.513   \n",
       "39     0.42   true              Obattla Pemac  2299636896903       0.396   \n",
       "40     0.42   true         Obattla Rochifield  1059188390521       0.364   \n",
       "41     0.42   true           Obattla Artesner  3135645518769       0.473   \n",
       "42     0.42   true             Obattla Sertan  5065137436307       0.396   \n",
       "49     0.42   true      Tilcasport Niaarbeach  3773349428121       0.488   \n",
       "54     0.42   true               Hassia Sinwe  6897035664431       0.563   \n",
       "55     0.42   true       Ganjtil Siacarratdia  6941269568884       0.521   \n",
       "56     0.42   true               Ganjtil Woja  7863646225535       0.538   \n",
       "57     0.42   true    Zopon Haydorfkerbergqua  9495139972228       0.331   \n",
       "58     0.42   true            Ganjtil Aytudro  5841609833234       0.558   \n",
       "59     0.42   true     Ganjtil Quabanmarwarsa  0531521583377       0.462   \n",
       "66     0.42   true           Obattla Magorlon  1513984569596       0.371   \n",
       "69     0.42   true    Zopon Haydorfkerbergbou  4099521721838       0.370   \n",
       "73     0.42   true  Tilcasport Boupatciacekoy  0389248018331       0.769   \n",
       "74     0.42   true     Tilcasport Siatiapecac  6434625393637       0.883   \n",
       "77     0.42   true             Obattla Vanhin  2721412697024       0.449   \n",
       "78     0.42   true           Obattla Artestai  3735917286448       0.416   \n",
       "84     0.42   true         Zopon Lischarhalai  5908398361747       0.561   \n",
       "88     0.45   true         Tilcasport Tosrang  9820062295194       0.720   \n",
       "93     0.42   true               Ganjtil Wono  5856112216725       0.524   \n",
       "97     0.42   true      Ganjtil Quabanmarwaro  6321321817492       0.411   \n",
       "100    0.70   true           Serzeampro Bilno  9890591392190       0.481   \n",
       "101    0.70   true                Ciki Dadcas  9068536152668       0.436   \n",
       "102    0.70   true                     Ciki Y  4377394578049       0.366   \n",
       "105    0.70   true          Serzeampro Gradon  8096543483724       0.432   \n",
       "106    0.70   true                    Ciki Fe  8876287369940       0.456   \n",
       "107    0.42   true            Obattla Magorah  5087070127104       0.433   \n",
       "109    0.42   true              Hassia Sinkoy  1756526331281       0.556   \n",
       "111    0.42   true              Ganjtil Wosun  9629904984175       0.400   \n",
       "112    0.42   true   Zopon Haydorfkerbergganj  8026028327611       0.437   \n",
       "124    0.42   true       Serzeampro Gradonnue  7834145976449       0.340   \n",
       "\n",
       "     literacy  aggression  constitution           isIn  industry  wealth  \\\n",
       "2       0.390       0.549         0.573  8822366435138    0.5610  0.4755   \n",
       "4       0.215       0.704         0.569  4146242421204    0.6365  0.4258   \n",
       "5       0.383       0.572         0.570  8822366435138    0.5710  0.4770   \n",
       "8       0.308       0.557         0.421  8822366435138    0.3170  0.2850   \n",
       "14      0.283       0.501         0.606  8822366435138    0.3430  0.3020   \n",
       "15      0.401       0.545         0.670  8822366435138    0.3470  0.3230   \n",
       "17      0.615       0.354         0.410  4115897493342    0.3820  0.4985   \n",
       "18      0.389       0.509         0.389  9376731217333    0.4490  0.4190   \n",
       "20      0.508       0.380         0.648  4115897493342    0.5140  0.5110   \n",
       "21      0.475       0.511         0.539  4115897493342    0.4750  0.4750   \n",
       "23      0.751       0.252         0.195  4232678858631    0.2235  0.4872   \n",
       "24      0.822       0.374         0.187  4232678858631    0.2555  0.4888   \n",
       "25      0.824       0.225         0.232  4232678858631    0.2285  0.3762   \n",
       "26      0.692       0.252         0.248  4232678858631    0.2500  0.4210   \n",
       "28      0.622       0.327         0.251  4232678858631    0.2890  0.4055   \n",
       "35      0.711       0.197         0.199  4232678858631    0.1340  0.3290   \n",
       "38      0.380       0.671         0.364  8822366435138    0.2910  0.1870   \n",
       "39      0.339       0.658         0.416  8822366435138    0.3170  0.3300   \n",
       "40      0.316       0.540         0.456  8822366435138    0.3180  0.2240   \n",
       "41      0.469       0.568         0.610  8822366435138    0.3430  0.2790   \n",
       "42      0.390       0.603         0.654  8822366435138    0.3470  0.2680   \n",
       "49      0.613       0.226         0.321  4232678858631    0.1500  0.2540   \n",
       "54      0.269       0.659         0.504  4146242421204    0.3820  0.3450   \n",
       "55      0.525       0.398         0.545  4115897493342    0.2570  0.3520   \n",
       "56      0.581       0.345         0.490  4115897493342    0.2290  0.3360   \n",
       "57      0.391       0.599         0.337  9376731217333    0.2690  0.1690   \n",
       "58      0.631       0.392         0.426  4115897493342    0.2570  0.2530   \n",
       "59      0.377       0.446         0.503  4115897493342    0.2850  0.3820   \n",
       "66      0.378       0.555         0.424  8822366435138    0.2910  0.2150   \n",
       "69      0.343       0.459         0.365  9376731217333    0.2690  0.1970   \n",
       "73      0.724       0.359         0.135  4232678858631    0.1530  0.3410   \n",
       "74      0.815       0.260         0.200  4232678858631    0.1370  0.1320   \n",
       "77      0.414       0.501         0.566  8822366435138    0.3370  0.1980   \n",
       "78      0.332       0.629         0.654  8822366435138    0.3430  0.2860   \n",
       "84      0.461       0.641         0.427  9376731217333    0.2910  0.3180   \n",
       "88      0.602       0.284         0.265  4232678858631    0.1730  0.2280   \n",
       "93      0.583       0.366         0.506  4115897493342    0.2290  0.3170   \n",
       "97      0.436       0.505         0.567  4115897493342    0.2850  0.2180   \n",
       "100     0.519       0.608         0.557  4873232607770    0.5825  0.5508   \n",
       "101     0.457       0.526         0.354  0015468195520    0.4400  0.4485   \n",
       "102     0.554       0.430         0.456  0015468195520    0.4430  0.4985   \n",
       "105     0.502       0.546         0.604  4873232607770    0.5750  0.5385   \n",
       "106     0.725       0.428         0.562  0015468195520    0.4950  0.6100   \n",
       "107     0.318       0.612         0.322  8822366435138    0.2910  0.2090   \n",
       "109     0.150       0.683         0.619  4146242421204    0.3820  0.3300   \n",
       "111     0.521       0.351         0.345  4115897493342    0.2290  0.2960   \n",
       "112     0.344       0.548         0.351  9376731217333    0.2690  0.2610   \n",
       "124     0.495       0.532         0.635  4873232607770    0.3450  0.3030   \n",
       "\n",
       "     factionLoyalty                           username objtype             id  \n",
       "2             0.423                      BillmanLocal2     pop  1800951322768  \n",
       "4             0.662                      BillmanLocal2     pop  0248671359952  \n",
       "5             0.497                      BillmanLocal2     pop  9819392335838  \n",
       "8             0.519                      BillmanLocal2     pop  5350816288225  \n",
       "14            0.484                      BillmanLocal2     pop  3348033092776  \n",
       "15            0.498                      BillmanLocal2     pop  9772027208419  \n",
       "17            0.485                          manderson     pop  9552341693154  \n",
       "18            0.510                          manderson     pop  1417654942596  \n",
       "20            0.692                          manderson     pop  4150839486690  \n",
       "21            0.491                          manderson     pop  1786540026813  \n",
       "23            0.788  william.jeffrey.harding@gmail.com     pop  3298484338584  \n",
       "24            0.855  william.jeffrey.harding@gmail.com     pop  4742850136180  \n",
       "25            0.827  william.jeffrey.harding@gmail.com     pop  5669843388137  \n",
       "26            0.521  william.jeffrey.harding@gmail.com     pop  7036253430140  \n",
       "28            0.715  william.jeffrey.harding@gmail.com     pop  1437057417022  \n",
       "35            0.810  william.jeffrey.harding@gmail.com     pop  9570919893877  \n",
       "38            0.441                      BillmanLocal2     pop  6074420508131  \n",
       "39            0.477                      BillmanLocal2     pop  2299636896903  \n",
       "40            0.345                      BillmanLocal2     pop  1059188390521  \n",
       "41            0.538                      BillmanLocal2     pop  3135645518769  \n",
       "42            0.416                      BillmanLocal2     pop  5065137436307  \n",
       "49            0.590  william.jeffrey.harding@gmail.com     pop  3773349428121  \n",
       "54            0.699                      BillmanLocal2     pop  6897035664431  \n",
       "55            0.771                          manderson     pop  6941269568884  \n",
       "56            0.396                          manderson     pop  7863646225535  \n",
       "57            0.509                          manderson     pop  9495139972228  \n",
       "58            0.585                          manderson     pop  5841609833234  \n",
       "59            0.504                          manderson     pop  0531521583377  \n",
       "66            0.509                      BillmanLocal2     pop  1513984569596  \n",
       "69            0.587                          manderson     pop  4099521721838  \n",
       "73            0.912  william.jeffrey.harding@gmail.com     pop  0389248018331  \n",
       "74            0.747  william.jeffrey.harding@gmail.com     pop  6434625393637  \n",
       "77            0.436                      BillmanLocal2     pop  2721412697024  \n",
       "78            0.463                      BillmanLocal2     pop  3735917286448  \n",
       "84            0.618                          manderson     pop  5908398361747  \n",
       "88            0.801  william.jeffrey.harding@gmail.com     pop  9820062295194  \n",
       "93            0.474                          manderson     pop  5856112216725  \n",
       "97            0.405                          manderson     pop  6321321817492  \n",
       "100           0.706                      Billmanserver     pop  9890591392190  \n",
       "101           0.462                      Billmanserver     pop  9068536152668  \n",
       "102           0.412                      Billmanserver     pop  4377394578049  \n",
       "105           0.375                      Billmanserver     pop  8096543483724  \n",
       "106           0.529                      Billmanserver     pop  8876287369940  \n",
       "107           0.465                      BillmanLocal2     pop  5087070127104  \n",
       "109           0.631                      BillmanLocal2     pop  1756526331281  \n",
       "111           0.583                          manderson     pop  9629904984175  \n",
       "112           0.442                          manderson     pop  8026028327611  \n",
       "124           0.331                      Billmanserver     pop  7834145976449  "
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pops_df['roll'] = pops_df['objid'].apply(lambda x: np.random.random())\n",
    "pops_df['grow'] = pops_df[['wealth','health']].T.mean() >= pops_df['roll']\n",
    "\n",
    "reproducing_pops = pops_df[pops_df['grow']].drop(['roll','grow'],axis=1)\n",
    "reproducing_pops"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "48 of 126 will grow\n"
     ]
    }
   ],
   "source": [
    "print(f\"{len(reproducing_pops)} of {len(pops_df)} will grow\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Going to create species objects for the populations that will reproduce"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<species: None; 4291284873310; Koykudra>,\n",
       " <species: None; 7324266402745; Si>,\n",
       " <species: None; 1245644824657; Towner>,\n",
       " <species: None; 5478087080681; Til>]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "species = [population.species.Species(species_df.drop_duplicates().T.to_dict()[i]) for i in  species_df.drop_duplicates().T.to_dict().keys()]\n",
    "species"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'4291284873310': <species: None; 4291284873310; Koykudra>,\n",
       " '7324266402745': <species: None; 7324266402745; Si>,\n",
       " '1245644824657': <species: None; 1245644824657; Towner>,\n",
       " '5478087080681': <species: None; 5478087080681; Til>}"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "for i in species:\n",
    "    global_health_manager.species_dict[i.objid]=i\n",
    "global_health_manager.species_dict"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<faction: None; 8822366435138; Obattla>,\n",
       " <faction: None; 4146242421204; Hassia>,\n",
       " <faction: None; 4115897493342; Ganjtil>,\n",
       " <faction: None; 9376731217333; Zopon>,\n",
       " <faction: None; 4232678858631; Tilcasport>,\n",
       " <faction: None; 4873232607770; Serzeampro>,\n",
       " <faction: None; 0015468195520; Ciki>]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "factions = [population.Faction(factions_df.drop_duplicates().T.to_dict()[i]) for i in  factions_df.drop_duplicates().T.to_dict().keys()]\n",
    "factions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<faction: None; 8822366435138; Obattla>"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def get_faction(objid):\n",
    "    res = [i for i in factions if i.objid == objid]\n",
    "    return res[0]\n",
    "\n",
    "get_faction(factions[0].objid)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [],
   "source": [
    "children = []\n",
    "events = []\n",
    "event_edges = []\n",
    "for i in reproducing_pops.index.to_list():\n",
    "    s = global_health_manager.species_dict[species_df.loc[i].to_dict()['objid']]\n",
    "    p = reproducing_pops.loc[i].to_dict()\n",
    "    #adding the current pop as a defautl to the species.\n",
    "    s.config['defaults'] = p\n",
    "    f = factions_df.loc[i].to_dict()\n",
    "    l = locations_df.loc[i].to_dict()\n",
    "    child = population.Pop(s)\n",
    "    child.birthplace = l\n",
    "    child.inhabitsEdge = {\"node1\": child.objid, \"node2\": l['objid'], \"label\": \"inhabits\"}\n",
    "    child.name = p['name']+language.make_word(1).lower()\n",
    "    get_faction(f['objid']).assign_pop_to_faction(child)\n",
    "    event = global_health_manager.population_growth_event(p,l,child)\n",
    "    events.append(event)\n",
    "    event_edges.append({\"node1\": event['objid'], \"node2\": l['objid'], \"label\": \"happenedAt\"})\n",
    "    event_edges.append({\"node1\": p['objid'], \"node2\": event['objid'], \"label\": \"caused\"})\n",
    "    children.append(child)    \n",
    "\n",
    "    \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 46,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>objid</th>\n",
       "      <th>name</th>\n",
       "      <th>label</th>\n",
       "      <th>text</th>\n",
       "      <th>visibleTo</th>\n",
       "      <th>time</th>\n",
       "      <th>username</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3460677560824</td>\n",
       "      <td>population growth</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Obattla Van) inhabiting Dorf h...</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>28311</td>\n",
       "      <td>event</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>4204960538102</td>\n",
       "      <td>population growth</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Hassia Sin) inhabiting Dorf ha...</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>28311</td>\n",
       "      <td>event</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>4006963445018</td>\n",
       "      <td>population growth</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Obattla Artes) inhabiting Dorf...</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>28311</td>\n",
       "      <td>event</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>6573133122797</td>\n",
       "      <td>population growth</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Obattla Peu) inhabiting Dorf h...</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>28311</td>\n",
       "      <td>event</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0608593303335</td>\n",
       "      <td>population growth</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Obattla Arteshy) inhabiting Do...</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>28311</td>\n",
       "      <td>event</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           objid               name  label  \\\n",
       "0  3460677560824  population growth  event   \n",
       "1  4204960538102  population growth  event   \n",
       "2  4006963445018  population growth  event   \n",
       "3  6573133122797  population growth  event   \n",
       "4  0608593303335  population growth  event   \n",
       "\n",
       "                                                text      visibleTo   time  \\\n",
       "0  The population (Obattla Van) inhabiting Dorf h...  BillmanLocal2  28311   \n",
       "1  The population (Hassia Sin) inhabiting Dorf ha...  BillmanLocal2  28311   \n",
       "2  The population (Obattla Artes) inhabiting Dorf...  BillmanLocal2  28311   \n",
       "3  The population (Obattla Peu) inhabiting Dorf h...  BillmanLocal2  28311   \n",
       "4  The population (Obattla Arteshy) inhabiting Do...  BillmanLocal2  28311   \n",
       "\n",
       "  username  \n",
       "0    event  \n",
       "1    event  \n",
       "2    event  \n",
       "3    event  \n",
       "4    event  "
      ]
     },
     "execution_count": 46,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.DataFrame(events).head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>label</th>\n",
       "      <th>conformity</th>\n",
       "      <th>literacy</th>\n",
       "      <th>aggression</th>\n",
       "      <th>constitution</th>\n",
       "      <th>health</th>\n",
       "      <th>isIn</th>\n",
       "      <th>industry</th>\n",
       "      <th>wealth</th>\n",
       "      <th>factionLoyalty</th>\n",
       "      <th>isIdle</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Obattla Vandu</td>\n",
       "      <td>1836179804201</td>\n",
       "      <td>pop</td>\n",
       "      <td>0.455</td>\n",
       "      <td>0.592</td>\n",
       "      <td>0.512</td>\n",
       "      <td>0.539</td>\n",
       "      <td>0.70</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.5255</td>\n",
       "      <td>0.55875</td>\n",
       "      <td>0.628</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Hassia Sinson</td>\n",
       "      <td>3806410178650</td>\n",
       "      <td>pop</td>\n",
       "      <td>0.412</td>\n",
       "      <td>0.454</td>\n",
       "      <td>0.527</td>\n",
       "      <td>0.353</td>\n",
       "      <td>0.70</td>\n",
       "      <td>4146242421204</td>\n",
       "      <td>0.4400</td>\n",
       "      <td>0.44700</td>\n",
       "      <td>0.390</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Obattla Artesjo</td>\n",
       "      <td>7674099494380</td>\n",
       "      <td>pop</td>\n",
       "      <td>0.585</td>\n",
       "      <td>0.624</td>\n",
       "      <td>0.433</td>\n",
       "      <td>0.345</td>\n",
       "      <td>0.70</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.3890</td>\n",
       "      <td>0.50650</td>\n",
       "      <td>0.526</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Obattla Peutas</td>\n",
       "      <td>3061748474769</td>\n",
       "      <td>pop</td>\n",
       "      <td>0.478</td>\n",
       "      <td>0.575</td>\n",
       "      <td>0.606</td>\n",
       "      <td>0.620</td>\n",
       "      <td>0.42</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.6130</td>\n",
       "      <td>0.59400</td>\n",
       "      <td>0.413</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Obattla Arteshyal</td>\n",
       "      <td>7976429919711</td>\n",
       "      <td>pop</td>\n",
       "      <td>0.327</td>\n",
       "      <td>0.555</td>\n",
       "      <td>0.524</td>\n",
       "      <td>0.578</td>\n",
       "      <td>0.42</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.5510</td>\n",
       "      <td>0.55300</td>\n",
       "      <td>0.412</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                name          objid label  conformity  literacy  aggression  \\\n",
       "0      Obattla Vandu  1836179804201   pop       0.455     0.592       0.512   \n",
       "1      Hassia Sinson  3806410178650   pop       0.412     0.454       0.527   \n",
       "2    Obattla Artesjo  7674099494380   pop       0.585     0.624       0.433   \n",
       "3     Obattla Peutas  3061748474769   pop       0.478     0.575       0.606   \n",
       "4  Obattla Arteshyal  7976429919711   pop       0.327     0.555       0.524   \n",
       "\n",
       "   constitution  health           isIn  industry   wealth  factionLoyalty  \\\n",
       "0         0.539    0.70  8822366435138    0.5255  0.55875           0.628   \n",
       "1         0.353    0.70  4146242421204    0.4400  0.44700           0.390   \n",
       "2         0.345    0.70  8822366435138    0.3890  0.50650           0.526   \n",
       "3         0.620    0.42  8822366435138    0.6130  0.59400           0.413   \n",
       "4         0.578    0.42  8822366435138    0.5510  0.55300           0.412   \n",
       "\n",
       "   isIdle  \n",
       "0    True  \n",
       "1    True  \n",
       "2    True  \n",
       "3    True  \n",
       "4    True  "
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "children_df = pd.DataFrame([c.get_data() for c in children])\n",
    "children_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'health': 0.42,\n",
       " 'isIdle': 'true',\n",
       " 'name': 'Serzeampro Gradonnue',\n",
       " 'objid': '7834145976449',\n",
       " 'conformity': 0.34,\n",
       " 'literacy': 0.495,\n",
       " 'aggression': 0.532,\n",
       " 'constitution': 0.635,\n",
       " 'isIn': '4873232607770',\n",
       " 'industry': 0.345,\n",
       " 'wealth': 0.303,\n",
       " 'factionLoyalty': 0.331,\n",
       " 'username': 'Billmanserver',\n",
       " 'objtype': 'pop',\n",
       " 'id': '7834145976449'}"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "p"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'name': 'Serzeampro Gradonnuebo',\n",
       " 'objid': '2657450629078',\n",
       " 'label': 'pop',\n",
       " 'conformity': 0.457,\n",
       " 'literacy': 0.419,\n",
       " 'aggression': 0.626,\n",
       " 'constitution': 0.418,\n",
       " 'health': 0.42,\n",
       " 'isIn': '4873232607770',\n",
       " 'industry': 0.522,\n",
       " 'wealth': 0.47050000000000003,\n",
       " 'factionLoyalty': 0.426,\n",
       " 'isIdle': True}"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "child.get_data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>label</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1836179804201</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>isIn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>7674099494380</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>isIn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3061748474769</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>isIn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>7976429919711</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>isIn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0072544323805</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>isIn</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           node1          node2 label\n",
       "0  1836179804201  8822366435138  isIn\n",
       "1  7674099494380  8822366435138  isIn\n",
       "2  3061748474769  8822366435138  isIn\n",
       "3  7976429919711  8822366435138  isIn\n",
       "4  0072544323805  8822366435138  isIn"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "factionedges = []\n",
    "[f.get_pop_edges(factionedges) for f in factions]\n",
    "pd.DataFrame(factionedges).head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>label</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1836179804201</td>\n",
       "      <td>1800951322768</td>\n",
       "      <td>childOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>3806410178650</td>\n",
       "      <td>0248671359952</td>\n",
       "      <td>childOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>7674099494380</td>\n",
       "      <td>9819392335838</td>\n",
       "      <td>childOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3061748474769</td>\n",
       "      <td>5350816288225</td>\n",
       "      <td>childOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>7976429919711</td>\n",
       "      <td>3348033092776</td>\n",
       "      <td>childOf</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           node1          node2    label\n",
       "0  1836179804201  1800951322768  childOf\n",
       "1  3806410178650  0248671359952  childOf\n",
       "2  7674099494380  9819392335838  childOf\n",
       "3  3061748474769  5350816288225  childOf\n",
       "4  7976429919711  3348033092776  childOf"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "childofEdges = [c.childOf for c in children]\n",
    "pd.DataFrame(childofEdges).head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>label</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1836179804201</td>\n",
       "      <td>4291284873310</td>\n",
       "      <td>isOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>3806410178650</td>\n",
       "      <td>4291284873310</td>\n",
       "      <td>isOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>7674099494380</td>\n",
       "      <td>4291284873310</td>\n",
       "      <td>isOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3061748474769</td>\n",
       "      <td>4291284873310</td>\n",
       "      <td>isOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>7976429919711</td>\n",
       "      <td>4291284873310</td>\n",
       "      <td>isOf</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           node1          node2 label\n",
       "0  1836179804201  4291284873310  isOf\n",
       "1  3806410178650  4291284873310  isOf\n",
       "2  7674099494380  4291284873310  isOf\n",
       "3  3061748474769  4291284873310  isOf\n",
       "4  7976429919711  4291284873310  isOf"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "isOfEdges = [c.isOfSpecies for c in children]\n",
    "pd.DataFrame(isOfEdges).head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>label</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1836179804201</td>\n",
       "      <td>2972908340606</td>\n",
       "      <td>inhabits</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>3806410178650</td>\n",
       "      <td>2972908340606</td>\n",
       "      <td>inhabits</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>7674099494380</td>\n",
       "      <td>2972908340606</td>\n",
       "      <td>inhabits</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3061748474769</td>\n",
       "      <td>2972908340606</td>\n",
       "      <td>inhabits</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>7976429919711</td>\n",
       "      <td>2972908340606</td>\n",
       "      <td>inhabits</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           node1          node2     label\n",
       "0  1836179804201  2972908340606  inhabits\n",
       "1  3806410178650  2972908340606  inhabits\n",
       "2  7674099494380  2972908340606  inhabits\n",
       "3  3061748474769  2972908340606  inhabits\n",
       "4  7976429919711  2972908340606  inhabits"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "inhabitsEdges = [c.inhabitsEdge for c in children]\n",
    "pd.DataFrame(inhabitsEdges).head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Validating The Counts of Edges and Nodes Created"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Expecting 48 children, got 48\n",
      "Expecting isOfEdges 48\n",
      "Expecting inhabitsEdges 48\n",
      "Expecting childofEdges 48\n",
      "Expecting factionedges 48\n",
      "Expecting events 48\n",
      "Expecting event_edges 96 (both caused and happenedAt)\n"
     ]
    }
   ],
   "source": [
    "assert(len(reproducing_pops) == len(children))\n",
    "print(f\"Expecting {len(reproducing_pops)} children, got {len(children)}\")\n",
    "\n",
    "assert(len(reproducing_pops) == len(isOfEdges))\n",
    "print(f\"Expecting isOfEdges {len(isOfEdges)}\")\n",
    "\n",
    "assert(len(reproducing_pops) == len(inhabitsEdges))\n",
    "print(f\"Expecting inhabitsEdges {len(inhabitsEdges)}\")\n",
    "\n",
    "assert(len(reproducing_pops) == len(childofEdges))\n",
    "print(f\"Expecting childofEdges {len(childofEdges)}\")\n",
    "\n",
    "assert(len(reproducing_pops) == len(factionedges))\n",
    "print(f\"Expecting factionedges {len(factionedges)}\")\n",
    "\n",
    "assert(len(reproducing_pops) == len(events))\n",
    "print(f\"Expecting events {len(events)}\")\n",
    "\n",
    "\n",
    "assert(len(event_edges) == len(events)*2)\n",
    "print(f\"Expecting event_edges {len(event_edges)} (both caused and happenedAt)\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Building the uploaded data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "The final dataset is 96 nodes and 288 edges\n"
     ]
    },
    {
     "ename": "TypeError",
     "evalue": "string indices must be integers",
     "output_type": "error",
     "traceback": [
      "\u001b[1;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[1;31mTypeError\u001b[0m                                 Traceback (most recent call last)",
      "Cell \u001b[1;32mIn[38], line 5\u001b[0m\n\u001b[0;32m      1\u001b[0m data \u001b[39m=\u001b[39m {\u001b[39m\"\u001b[39m\u001b[39mnodes\u001b[39m\u001b[39m\"\u001b[39m:[c\u001b[39m.\u001b[39mget_data() \u001b[39mfor\u001b[39;00m c \u001b[39min\u001b[39;00m children] \u001b[39m+\u001b[39m events ,\u001b[39m\"\u001b[39m\u001b[39medges\u001b[39m\u001b[39m\"\u001b[39m:isOfEdges \u001b[39m+\u001b[39m inhabitsEdges \u001b[39m+\u001b[39m childofEdges \u001b[39m+\u001b[39m factionedges \u001b[39m+\u001b[39m event_edges }\n\u001b[0;32m      3\u001b[0m \u001b[39mprint\u001b[39m(\u001b[39mf\u001b[39m\u001b[39m\"\u001b[39m\u001b[39mThe final dataset is \u001b[39m\u001b[39m{\u001b[39;00m\u001b[39mlen\u001b[39m(data\u001b[39m.\u001b[39mget(\u001b[39m'\u001b[39m\u001b[39mnodes\u001b[39m\u001b[39m'\u001b[39m))\u001b[39m}\u001b[39;00m\u001b[39m nodes and \u001b[39m\u001b[39m{\u001b[39;00m\u001b[39mlen\u001b[39m(data\u001b[39m.\u001b[39mget(\u001b[39m'\u001b[39m\u001b[39medges\u001b[39m\u001b[39m'\u001b[39m))\u001b[39m}\u001b[39;00m\u001b[39m edges\u001b[39m\u001b[39m\"\u001b[39m)\n\u001b[1;32m----> 5\u001b[0m c\u001b[39m.\u001b[39;49mupload_data(\u001b[39m'\u001b[39;49m\u001b[39mnotebook\u001b[39;49m\u001b[39m'\u001b[39;49m,data)\n",
      "File \u001b[1;32mc:\\Users\\william.harding\\Documents\\repos\\exoplanets\\notebooks\\People\\../..\\app\\connectors\\cmdb_graph.py:267\u001b[0m, in \u001b[0;36mCosmosdbClient.upload_data\u001b[1;34m(self, username, data)\u001b[0m\n\u001b[0;32m    265\u001b[0m \u001b[39mself\u001b[39m\u001b[39m.\u001b[39mrun_queries()\n\u001b[0;32m    266\u001b[0m \u001b[39mfor\u001b[39;00m edge \u001b[39min\u001b[39;00m data[\u001b[39m\"\u001b[39m\u001b[39medges\u001b[39m\u001b[39m\"\u001b[39m]:\n\u001b[1;32m--> 267\u001b[0m     e \u001b[39m=\u001b[39m \u001b[39mself\u001b[39;49m\u001b[39m.\u001b[39;49mcreate_edge(edge, username)\n\u001b[0;32m    268\u001b[0m     \u001b[39mself\u001b[39m\u001b[39m.\u001b[39madd_query(e)\n\u001b[0;32m    269\u001b[0m     \u001b[39mif\u001b[39;00m \u001b[39mlen\u001b[39m(\u001b[39mself\u001b[39m\u001b[39m.\u001b[39mstack)\u001b[39m>\u001b[39m\u001b[39mself\u001b[39m\u001b[39m.\u001b[39mstacklimit:\n",
      "File \u001b[1;32mc:\\Users\\william.harding\\Documents\\repos\\exoplanets\\notebooks\\People\\../..\\app\\connectors\\cmdb_graph.py:243\u001b[0m, in \u001b[0;36mCosmosdbClient.create_edge\u001b[1;34m(self, edge, username)\u001b[0m\n\u001b[0;32m    242\u001b[0m \u001b[39mdef\u001b[39;00m \u001b[39mcreate_edge\u001b[39m(\u001b[39mself\u001b[39m, edge, username):\n\u001b[1;32m--> 243\u001b[0m     gadde \u001b[39m=\u001b[39m \u001b[39mf\u001b[39m\u001b[39m\"\u001b[39m\u001b[39mg.V().has(\u001b[39m\u001b[39m'\u001b[39m\u001b[39mobjid\u001b[39m\u001b[39m'\u001b[39m\u001b[39m,\u001b[39m\u001b[39m'\u001b[39m\u001b[39m{\u001b[39;00medge[\u001b[39m'\u001b[39m\u001b[39mnode1\u001b[39m\u001b[39m'\u001b[39m]\u001b[39m}\u001b[39;00m\u001b[39m'\u001b[39m\u001b[39m).addE(\u001b[39m\u001b[39m'\u001b[39m\u001b[39m{\u001b[39;00m\u001b[39mself\u001b[39m\u001b[39m.\u001b[39mcs(edge[\u001b[39m'\u001b[39m\u001b[39mlabel\u001b[39m\u001b[39m'\u001b[39m])\u001b[39m}\u001b[39;00m\u001b[39m'\u001b[39m\u001b[39m).property(\u001b[39m\u001b[39m'\u001b[39m\u001b[39musername\u001b[39m\u001b[39m'\u001b[39m\u001b[39m,\u001b[39m\u001b[39m'\u001b[39m\u001b[39m{\u001b[39;00musername\u001b[39m}\u001b[39;00m\u001b[39m'\u001b[39m\u001b[39m)\u001b[39m\u001b[39m\"\u001b[39m\n\u001b[0;32m    244\u001b[0m     \u001b[39mfor\u001b[39;00m i \u001b[39min\u001b[39;00m [j \u001b[39mfor\u001b[39;00m j \u001b[39min\u001b[39;00m edge\u001b[39m.\u001b[39mkeys() \u001b[39mif\u001b[39;00m j \u001b[39mnot\u001b[39;00m \u001b[39min\u001b[39;00m [\u001b[39m'\u001b[39m\u001b[39mlabel\u001b[39m\u001b[39m'\u001b[39m,\u001b[39m'\u001b[39m\u001b[39mnode1\u001b[39m\u001b[39m'\u001b[39m,\u001b[39m'\u001b[39m\u001b[39mnode2\u001b[39m\u001b[39m'\u001b[39m]]:\n\u001b[0;32m    245\u001b[0m         gadde \u001b[39m+\u001b[39m\u001b[39m=\u001b[39m \u001b[39mf\u001b[39m\u001b[39m\"\u001b[39m\u001b[39m.property(\u001b[39m\u001b[39m'\u001b[39m\u001b[39m{\u001b[39;00mi\u001b[39m}\u001b[39;00m\u001b[39m'\u001b[39m\u001b[39m,\u001b[39m\u001b[39m'\u001b[39m\u001b[39m{\u001b[39;00medge[i]\u001b[39m}\u001b[39;00m\u001b[39m'\u001b[39m\u001b[39m)\u001b[39m\u001b[39m\"\u001b[39m\n",
      "\u001b[1;31mTypeError\u001b[0m: string indices must be integers"
     ]
    }
   ],
   "source": [
    "data = {\"nodes\":[c.get_data() for c in children] + events ,\"edges\":isOfEdges + inhabitsEdges + childofEdges + factionedges + event_edges }\n",
    "\n",
    "print(f\"The final dataset is {len(data.get('nodes'))} nodes and {len(data.get('edges'))} edges\")\n",
    "\n",
    "c.upload_data('notebook',data)\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "It takes a while to upload all of that data. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[\"\\n        g.V().has('objid','2752642995590')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','1800951322768')\\n            .addE('caused')\\n            .to(g.V().has('objid','2752642995590'))\\n        \",\n",
       " \"\\n        g.V().has('objid','8219442888303')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','0248671359952')\\n            .addE('caused')\\n            .to(g.V().has('objid','8219442888303'))\\n        \",\n",
       " \"\\n        g.V().has('objid','4353072064100')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','9819392335838')\\n            .addE('caused')\\n            .to(g.V().has('objid','4353072064100'))\\n        \",\n",
       " \"\\n        g.V().has('objid','0615091833273')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','5350816288225')\\n            .addE('caused')\\n            .to(g.V().has('objid','0615091833273'))\\n        \",\n",
       " \"\\n        g.V().has('objid','5258006735596')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','3348033092776')\\n            .addE('caused')\\n            .to(g.V().has('objid','5258006735596'))\\n        \",\n",
       " \"\\n        g.V().has('objid','7132973632143')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','9772027208419')\\n            .addE('caused')\\n            .to(g.V().has('objid','7132973632143'))\\n        \",\n",
       " \"\\n        g.V().has('objid','0100951993057')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','5640544774717'))\\n        \",\n",
       " \"\\n        g.V().has('objid','9552341693154')\\n            .addE('caused')\\n            .to(g.V().has('objid','0100951993057'))\\n        \",\n",
       " \"\\n        g.V().has('objid','4124964568837')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','5640544774717'))\\n        \",\n",
       " \"\\n        g.V().has('objid','1417654942596')\\n            .addE('caused')\\n            .to(g.V().has('objid','4124964568837'))\\n        \",\n",
       " \"\\n        g.V().has('objid','1549609787195')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','5640544774717'))\\n        \",\n",
       " \"\\n        g.V().has('objid','4150839486690')\\n            .addE('caused')\\n            .to(g.V().has('objid','1549609787195'))\\n        \",\n",
       " \"\\n        g.V().has('objid','4023383106375')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','5640544774717'))\\n        \",\n",
       " \"\\n        g.V().has('objid','1786540026813')\\n            .addE('caused')\\n            .to(g.V().has('objid','4023383106375'))\\n        \",\n",
       " \"\\n        g.V().has('objid','5979125311743')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2816844503430'))\\n        \",\n",
       " \"\\n        g.V().has('objid','3298484338584')\\n            .addE('caused')\\n            .to(g.V().has('objid','5979125311743'))\\n        \",\n",
       " \"\\n        g.V().has('objid','8431976232724')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2816844503430'))\\n        \",\n",
       " \"\\n        g.V().has('objid','4742850136180')\\n            .addE('caused')\\n            .to(g.V().has('objid','8431976232724'))\\n        \",\n",
       " \"\\n        g.V().has('objid','3029078593049')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2816844503430'))\\n        \",\n",
       " \"\\n        g.V().has('objid','5669843388137')\\n            .addE('caused')\\n            .to(g.V().has('objid','3029078593049'))\\n        \",\n",
       " \"\\n        g.V().has('objid','8225781124991')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2816844503430'))\\n        \",\n",
       " \"\\n        g.V().has('objid','7036253430140')\\n            .addE('caused')\\n            .to(g.V().has('objid','8225781124991'))\\n        \",\n",
       " \"\\n        g.V().has('objid','3277070235706')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2816844503430'))\\n        \",\n",
       " \"\\n        g.V().has('objid','1437057417022')\\n            .addE('caused')\\n            .to(g.V().has('objid','3277070235706'))\\n        \",\n",
       " \"\\n        g.V().has('objid','4033467095933')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2816844503430'))\\n        \",\n",
       " \"\\n        g.V().has('objid','9570919893877')\\n            .addE('caused')\\n            .to(g.V().has('objid','4033467095933'))\\n        \",\n",
       " \"\\n        g.V().has('objid','6954972523480')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','6074420508131')\\n            .addE('caused')\\n            .to(g.V().has('objid','6954972523480'))\\n        \",\n",
       " \"\\n        g.V().has('objid','4060265242910')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','2299636896903')\\n            .addE('caused')\\n            .to(g.V().has('objid','4060265242910'))\\n        \",\n",
       " \"\\n        g.V().has('objid','2940532564771')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','1059188390521')\\n            .addE('caused')\\n            .to(g.V().has('objid','2940532564771'))\\n        \",\n",
       " \"\\n        g.V().has('objid','0075735813134')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','3135645518769')\\n            .addE('caused')\\n            .to(g.V().has('objid','0075735813134'))\\n        \",\n",
       " \"\\n        g.V().has('objid','7328524447115')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','5065137436307')\\n            .addE('caused')\\n            .to(g.V().has('objid','7328524447115'))\\n        \",\n",
       " \"\\n        g.V().has('objid','8013672061026')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2816844503430'))\\n        \",\n",
       " \"\\n        g.V().has('objid','3773349428121')\\n            .addE('caused')\\n            .to(g.V().has('objid','8013672061026'))\\n        \",\n",
       " \"\\n        g.V().has('objid','9418280577270')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','6897035664431')\\n            .addE('caused')\\n            .to(g.V().has('objid','9418280577270'))\\n        \",\n",
       " \"\\n        g.V().has('objid','1388151078875')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','5640544774717'))\\n        \",\n",
       " \"\\n        g.V().has('objid','6941269568884')\\n            .addE('caused')\\n            .to(g.V().has('objid','1388151078875'))\\n        \",\n",
       " \"\\n        g.V().has('objid','3535373163027')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','5640544774717'))\\n        \",\n",
       " \"\\n        g.V().has('objid','7863646225535')\\n            .addE('caused')\\n            .to(g.V().has('objid','3535373163027'))\\n        \",\n",
       " \"\\n        g.V().has('objid','2891591498155')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','5640544774717'))\\n        \",\n",
       " \"\\n        g.V().has('objid','9495139972228')\\n            .addE('caused')\\n            .to(g.V().has('objid','2891591498155'))\\n        \",\n",
       " \"\\n        g.V().has('objid','6702343567140')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','5640544774717'))\\n        \",\n",
       " \"\\n        g.V().has('objid','5841609833234')\\n            .addE('caused')\\n            .to(g.V().has('objid','6702343567140'))\\n        \",\n",
       " \"\\n        g.V().has('objid','0711894390341')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','5640544774717'))\\n        \",\n",
       " \"\\n        g.V().has('objid','0531521583377')\\n            .addE('caused')\\n            .to(g.V().has('objid','0711894390341'))\\n        \",\n",
       " \"\\n        g.V().has('objid','2635733690977')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','1513984569596')\\n            .addE('caused')\\n            .to(g.V().has('objid','2635733690977'))\\n        \",\n",
       " \"\\n        g.V().has('objid','6636822965917')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','5640544774717'))\\n        \",\n",
       " \"\\n        g.V().has('objid','4099521721838')\\n            .addE('caused')\\n            .to(g.V().has('objid','6636822965917'))\\n        \",\n",
       " \"\\n        g.V().has('objid','3972424359551')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2816844503430'))\\n        \",\n",
       " \"\\n        g.V().has('objid','0389248018331')\\n            .addE('caused')\\n            .to(g.V().has('objid','3972424359551'))\\n        \",\n",
       " \"\\n        g.V().has('objid','1219711859411')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2816844503430'))\\n        \",\n",
       " \"\\n        g.V().has('objid','6434625393637')\\n            .addE('caused')\\n            .to(g.V().has('objid','1219711859411'))\\n        \",\n",
       " \"\\n        g.V().has('objid','4435074906951')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','2721412697024')\\n            .addE('caused')\\n            .to(g.V().has('objid','4435074906951'))\\n        \",\n",
       " \"\\n        g.V().has('objid','3068604636316')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','3735917286448')\\n            .addE('caused')\\n            .to(g.V().has('objid','3068604636316'))\\n        \",\n",
       " \"\\n        g.V().has('objid','6418710251834')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','5640544774717'))\\n        \",\n",
       " \"\\n        g.V().has('objid','5908398361747')\\n            .addE('caused')\\n            .to(g.V().has('objid','6418710251834'))\\n        \",\n",
       " \"\\n        g.V().has('objid','6807686847885')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2816844503430'))\\n        \",\n",
       " \"\\n        g.V().has('objid','9820062295194')\\n            .addE('caused')\\n            .to(g.V().has('objid','6807686847885'))\\n        \",\n",
       " \"\\n        g.V().has('objid','5483205137047')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','5640544774717'))\\n        \",\n",
       " \"\\n        g.V().has('objid','5856112216725')\\n            .addE('caused')\\n            .to(g.V().has('objid','5483205137047'))\\n        \",\n",
       " \"\\n        g.V().has('objid','9061877932725')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','5640544774717'))\\n        \",\n",
       " \"\\n        g.V().has('objid','6321321817492')\\n            .addE('caused')\\n            .to(g.V().has('objid','9061877932725'))\\n        \",\n",
       " \"\\n        g.V().has('objid','9947853447205')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','8490894854096'))\\n        \",\n",
       " \"\\n        g.V().has('objid','9890591392190')\\n            .addE('caused')\\n            .to(g.V().has('objid','9947853447205'))\\n        \",\n",
       " \"\\n        g.V().has('objid','6129673517652')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','8490894854096'))\\n        \",\n",
       " \"\\n        g.V().has('objid','9068536152668')\\n            .addE('caused')\\n            .to(g.V().has('objid','6129673517652'))\\n        \",\n",
       " \"\\n        g.V().has('objid','2930086451633')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','8490894854096'))\\n        \",\n",
       " \"\\n        g.V().has('objid','4377394578049')\\n            .addE('caused')\\n            .to(g.V().has('objid','2930086451633'))\\n        \",\n",
       " \"\\n        g.V().has('objid','3524048238597')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','8490894854096'))\\n        \",\n",
       " \"\\n        g.V().has('objid','8096543483724')\\n            .addE('caused')\\n            .to(g.V().has('objid','3524048238597'))\\n        \",\n",
       " \"\\n        g.V().has('objid','6417608007126')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','8490894854096'))\\n        \",\n",
       " \"\\n        g.V().has('objid','8876287369940')\\n            .addE('caused')\\n            .to(g.V().has('objid','6417608007126'))\\n        \",\n",
       " \"\\n        g.V().has('objid','1242957607992')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','5087070127104')\\n            .addE('caused')\\n            .to(g.V().has('objid','1242957607992'))\\n        \",\n",
       " \"\\n        g.V().has('objid','1413266005156')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','1756526331281')\\n            .addE('caused')\\n            .to(g.V().has('objid','1413266005156'))\\n        \",\n",
       " \"\\n        g.V().has('objid','1431285291254')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','5640544774717'))\\n        \",\n",
       " \"\\n        g.V().has('objid','9629904984175')\\n            .addE('caused')\\n            .to(g.V().has('objid','1431285291254'))\\n        \",\n",
       " \"\\n        g.V().has('objid','1036381649520')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','5640544774717'))\\n        \",\n",
       " \"\\n        g.V().has('objid','8026028327611')\\n            .addE('caused')\\n            .to(g.V().has('objid','1036381649520'))\\n        \",\n",
       " \"\\n        g.V().has('objid','4299954541207')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','8490894854096'))\\n        \",\n",
       " \"\\n        g.V().has('objid','7834145976449')\\n            .addE('caused')\\n            .to(g.V().has('objid','4299954541207'))\\n        \"]"
      ]
     },
     "execution_count": 44,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "event_edges "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "exoplanets",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.16"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "625a17269cb94aebb094cbcf5e0e8340f26b69d46569da60e8fc69439048adbf"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
