{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Managing population growth"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys\n",
    "import numpy as np\n",
    "import pandas as pd\n",
    "import altair as alt\n",
    "sys.path.append('..')\n",
    "import helpers.dbquery as db\n",
    "import helpers.functions as f\n",
    "import yaml, ssl, asyncio, pickle, os, ast\n",
    "import nb_black\n",
    "\n",
    "ssl._create_default_https_context = ssl._create_unverified_context\n",
    "asyncio.set_event_loop_policy(asyncio.WindowsSelectorEventLoopPolicy())\n",
    "import nest_asyncio\n",
    "# this is required for running in a Jupyter Notebook. \n",
    "nest_asyncio.apply()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "# mapping to the modules that make the app\n",
    "sys.path.insert(0, \"../../app\")\n",
    "sys.path.insert(0, \"../../functions/popgrowth\")\n",
    "\n",
    "sys.path.insert\n",
    "import models\n",
    "\n",
    "c = models.CosmosdbClient()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'pop_health_requirement': 0.6,\n",
       " 'pop_consumes': 2,\n",
       " 'starve_damage': 0.05,\n",
       " 'changing_values': ['conformity',\n",
       "  'literacy',\n",
       "  'aggression',\n",
       "  'constitution',\n",
       "  'wealth',\n",
       "  'factionLoyalty']}"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "params = yaml.safe_load(open(os.path.join(os.getenv(\"abspath\"),\"functions/popgrowth/settings.yml\")))\n",
    "syllables = pickle.load(open(os.path.join(os.getenv(\"abspath\"),\"app/creators/specs/syllables.p\"), \"rb\"))\n",
    "username = 'notebook'\n",
    "params"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Time is updated by the `time` function. It is always running."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'currentTime': 24181,\n",
       " 'updatedFrom': 'azfunction',\n",
       " 'updatedAt': '2023-03-04 17:20:00.318149',\n",
       " 'objid': '7263327370874',\n",
       " 'name': 'time',\n",
       " 'originTime': 0,\n",
       " 'username': 'notebook',\n",
       " 'objtype': 'time',\n",
       " 'id': '7263327370874'}"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "c.run_query(\"g.V().hasLabel('time').valueMap()\")\n",
    "params['time'] = c.clean_nodes(c.res)[0]\n",
    "params['time']"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "For this notebook, setting the `pop_health_requirement` to an arbitrary value just to examine."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "params['pop_health_requirement'] = 0.4"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Population Resource Consumption"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "from tools import consumption"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>conformity</th>\n",
       "      <th>literacy</th>\n",
       "      <th>aggression</th>\n",
       "      <th>constitution</th>\n",
       "      <th>health</th>\n",
       "      <th>isInFaction</th>\n",
       "      <th>industry</th>\n",
       "      <th>wealth</th>\n",
       "      <th>factionLoyalty</th>\n",
       "      <th>isIdle</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Salwimilhai Man</td>\n",
       "      <td>9956768968114</td>\n",
       "      <td>0.477</td>\n",
       "      <td>0.468</td>\n",
       "      <td>0.440</td>\n",
       "      <td>0.400</td>\n",
       "      <td>0.5</td>\n",
       "      <td>5422923466823</td>\n",
       "      <td>0.4200</td>\n",
       "      <td>0.4440</td>\n",
       "      <td>0.595</td>\n",
       "      <td>true</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>9956768968114</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Kyvanwes Dialy</td>\n",
       "      <td>2268493607146</td>\n",
       "      <td>0.536</td>\n",
       "      <td>0.521</td>\n",
       "      <td>0.583</td>\n",
       "      <td>0.515</td>\n",
       "      <td>0.5</td>\n",
       "      <td>4045695310102</td>\n",
       "      <td>0.5490</td>\n",
       "      <td>0.5350</td>\n",
       "      <td>0.531</td>\n",
       "      <td>true</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>2268493607146</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Kyvanwes Hy</td>\n",
       "      <td>8767451884029</td>\n",
       "      <td>0.553</td>\n",
       "      <td>0.498</td>\n",
       "      <td>0.480</td>\n",
       "      <td>0.528</td>\n",
       "      <td>0.5</td>\n",
       "      <td>4045695310102</td>\n",
       "      <td>0.5040</td>\n",
       "      <td>0.5010</td>\n",
       "      <td>0.691</td>\n",
       "      <td>true</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>8767451884029</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Rinmayherdroegaonbad Pestlan</td>\n",
       "      <td>2065545354087</td>\n",
       "      <td>0.719</td>\n",
       "      <td>0.445</td>\n",
       "      <td>0.484</td>\n",
       "      <td>0.601</td>\n",
       "      <td>0.5</td>\n",
       "      <td>5700878531117</td>\n",
       "      <td>0.5425</td>\n",
       "      <td>0.4938</td>\n",
       "      <td>0.722</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal</td>\n",
       "      <td>pop</td>\n",
       "      <td>2065545354087</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Uniabrafalefanak Batheights</td>\n",
       "      <td>2297177711622</td>\n",
       "      <td>0.549</td>\n",
       "      <td>0.425</td>\n",
       "      <td>0.319</td>\n",
       "      <td>0.711</td>\n",
       "      <td>0.5</td>\n",
       "      <td>1948134031021</td>\n",
       "      <td>0.5150</td>\n",
       "      <td>0.4700</td>\n",
       "      <td>0.724</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal</td>\n",
       "      <td>pop</td>\n",
       "      <td>2297177711622</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Mactarji Me</td>\n",
       "      <td>1174720039684</td>\n",
       "      <td>0.543</td>\n",
       "      <td>0.437</td>\n",
       "      <td>0.453</td>\n",
       "      <td>0.562</td>\n",
       "      <td>0.5</td>\n",
       "      <td>5964376509986</td>\n",
       "      <td>0.5075</td>\n",
       "      <td>0.4723</td>\n",
       "      <td>0.548</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>1174720039684</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Yuseldal Hau</td>\n",
       "      <td>9747253261413</td>\n",
       "      <td>0.475</td>\n",
       "      <td>0.364</td>\n",
       "      <td>0.406</td>\n",
       "      <td>0.605</td>\n",
       "      <td>0.5</td>\n",
       "      <td>2955465151925</td>\n",
       "      <td>0.5055</td>\n",
       "      <td>0.4348</td>\n",
       "      <td>0.524</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>9747253261413</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                           name          objid  conformity  literacy  \\\n",
       "0               Salwimilhai Man  9956768968114       0.477     0.468   \n",
       "1                Kyvanwes Dialy  2268493607146       0.536     0.521   \n",
       "2                   Kyvanwes Hy  8767451884029       0.553     0.498   \n",
       "3  Rinmayherdroegaonbad Pestlan  2065545354087       0.719     0.445   \n",
       "4   Uniabrafalefanak Batheights  2297177711622       0.549     0.425   \n",
       "5                   Mactarji Me  1174720039684       0.543     0.437   \n",
       "6                  Yuseldal Hau  9747253261413       0.475     0.364   \n",
       "\n",
       "   aggression  constitution  health    isInFaction  industry  wealth  \\\n",
       "0       0.440         0.400     0.5  5422923466823    0.4200  0.4440   \n",
       "1       0.583         0.515     0.5  4045695310102    0.5490  0.5350   \n",
       "2       0.480         0.528     0.5  4045695310102    0.5040  0.5010   \n",
       "3       0.484         0.601     0.5  5700878531117    0.5425  0.4938   \n",
       "4       0.319         0.711     0.5  1948134031021    0.5150  0.4700   \n",
       "5       0.453         0.562     0.5  5964376509986    0.5075  0.4723   \n",
       "6       0.406         0.605     0.5  2955465151925    0.5055  0.4348   \n",
       "\n",
       "   factionLoyalty isIdle                           username objtype  \\\n",
       "0           0.595   true  william.jeffrey.harding@gmail.com     pop   \n",
       "1           0.531   true  william.jeffrey.harding@gmail.com     pop   \n",
       "2           0.691   true  william.jeffrey.harding@gmail.com     pop   \n",
       "3           0.722   true                       BillmanLocal     pop   \n",
       "4           0.724   true                       BillmanLocal     pop   \n",
       "5           0.548   true                      BillmanLocal2     pop   \n",
       "6           0.524   true                      BillmanLocal2     pop   \n",
       "\n",
       "              id  \n",
       "0  9956768968114  \n",
       "1  2268493607146  \n",
       "2  8767451884029  \n",
       "3  2065545354087  \n",
       "4  2297177711622  \n",
       "5  1174720039684  \n",
       "6  9747253261413  "
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pops_df,species_df,locations_df = consumption.all_pops_consumption(c)\n",
    "pops_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>consumes</th>\n",
       "      <th>effuses</th>\n",
       "      <th>viral_resilience</th>\n",
       "      <th>habitat_resilience</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Kam</td>\n",
       "      <td>4921351182242</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>species</td>\n",
       "      <td>4921351182242</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Kam</td>\n",
       "      <td>4921351182242</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>species</td>\n",
       "      <td>4921351182242</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Kam</td>\n",
       "      <td>4921351182242</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>species</td>\n",
       "      <td>4921351182242</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Belneurei</td>\n",
       "      <td>7635975712366</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal</td>\n",
       "      <td>species</td>\n",
       "      <td>7635975712366</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Belneurei</td>\n",
       "      <td>7635975712366</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal</td>\n",
       "      <td>species</td>\n",
       "      <td>7635975712366</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Ven</td>\n",
       "      <td>1676891887348</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>1676891887348</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Ven</td>\n",
       "      <td>1676891887348</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>1676891887348</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "        name          objid   consumes                    effuses  \\\n",
       "0        Kam  4921351182242  [Organic]  [Organic waste, Plastics]   \n",
       "1        Kam  4921351182242  [Organic]  [Organic waste, Plastics]   \n",
       "2        Kam  4921351182242  [Organic]  [Organic waste, Plastics]   \n",
       "3  Belneurei  7635975712366  [Organic]  [Organic waste, Plastics]   \n",
       "4  Belneurei  7635975712366  [Organic]  [Organic waste, Plastics]   \n",
       "5        Ven  1676891887348  [Organic]  [Organic waste, Plastics]   \n",
       "6        Ven  1676891887348  [Organic]  [Organic waste, Plastics]   \n",
       "\n",
       "   viral_resilience  habitat_resilience                           username  \\\n",
       "0               0.7                 0.2  william.jeffrey.harding@gmail.com   \n",
       "1               0.7                 0.2  william.jeffrey.harding@gmail.com   \n",
       "2               0.7                 0.2  william.jeffrey.harding@gmail.com   \n",
       "3               0.7                 0.2                       BillmanLocal   \n",
       "4               0.7                 0.2                       BillmanLocal   \n",
       "5               0.7                 0.2                      BillmanLocal2   \n",
       "6               0.7                 0.2                      BillmanLocal2   \n",
       "\n",
       "   objtype             id  \n",
       "0  species  4921351182242  \n",
       "1  species  4921351182242  \n",
       "2  species  4921351182242  \n",
       "3  species  7635975712366  \n",
       "4  species  7635975712366  \n",
       "5  species  1676891887348  \n",
       "6  species  1676891887348  "
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "species_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>class</th>\n",
       "      <th>objid</th>\n",
       "      <th>radius</th>\n",
       "      <th>mass</th>\n",
       "      <th>orbitsDistance</th>\n",
       "      <th>orbitsId</th>\n",
       "      <th>orbitsName</th>\n",
       "      <th>isSupportsLife</th>\n",
       "      <th>isPopulated</th>\n",
       "      <th>type</th>\n",
       "      <th>isHomeworld</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Yrie</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>9775478565804</td>\n",
       "      <td>0.740</td>\n",
       "      <td>0.353</td>\n",
       "      <td>3</td>\n",
       "      <td>4059328791789</td>\n",
       "      <td>Mes</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>planet</td>\n",
       "      <td>9775478565804</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Yrie</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>9775478565804</td>\n",
       "      <td>0.740</td>\n",
       "      <td>0.353</td>\n",
       "      <td>3</td>\n",
       "      <td>4059328791789</td>\n",
       "      <td>Mes</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>planet</td>\n",
       "      <td>9775478565804</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Yrie</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>9775478565804</td>\n",
       "      <td>0.740</td>\n",
       "      <td>0.353</td>\n",
       "      <td>3</td>\n",
       "      <td>4059328791789</td>\n",
       "      <td>Mes</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>planet</td>\n",
       "      <td>9775478565804</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Dos</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>7696190212701</td>\n",
       "      <td>1.071</td>\n",
       "      <td>0.741</td>\n",
       "      <td>1</td>\n",
       "      <td>7627175892791</td>\n",
       "      <td>Ramsartau</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>BillmanLocal</td>\n",
       "      <td>planet</td>\n",
       "      <td>7696190212701</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Dos</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>7696190212701</td>\n",
       "      <td>1.071</td>\n",
       "      <td>0.741</td>\n",
       "      <td>1</td>\n",
       "      <td>7627175892791</td>\n",
       "      <td>Ramsartau</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>BillmanLocal</td>\n",
       "      <td>planet</td>\n",
       "      <td>7696190212701</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Curos</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>1032253142942</td>\n",
       "      <td>0.967</td>\n",
       "      <td>0.326</td>\n",
       "      <td>1</td>\n",
       "      <td>5579246069560</td>\n",
       "      <td>Kique</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>1032253142942</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>Curos</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>1032253142942</td>\n",
       "      <td>0.967</td>\n",
       "      <td>0.326</td>\n",
       "      <td>1</td>\n",
       "      <td>5579246069560</td>\n",
       "      <td>Kique</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>1032253142942</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    name        class          objid  radius   mass  orbitsDistance  \\\n",
       "0   Yrie  terrestrial  9775478565804   0.740  0.353               3   \n",
       "1   Yrie  terrestrial  9775478565804   0.740  0.353               3   \n",
       "2   Yrie  terrestrial  9775478565804   0.740  0.353               3   \n",
       "3    Dos  terrestrial  7696190212701   1.071  0.741               1   \n",
       "4    Dos  terrestrial  7696190212701   1.071  0.741               1   \n",
       "5  Curos  terrestrial  1032253142942   0.967  0.326               1   \n",
       "6  Curos  terrestrial  1032253142942   0.967  0.326               1   \n",
       "\n",
       "        orbitsId orbitsName isSupportsLife isPopulated         type  \\\n",
       "0  4059328791789        Mes           True        True  terrestrial   \n",
       "1  4059328791789        Mes           True        True  terrestrial   \n",
       "2  4059328791789        Mes           True        True  terrestrial   \n",
       "3  7627175892791  Ramsartau           True        True  terrestrial   \n",
       "4  7627175892791  Ramsartau           True        True  terrestrial   \n",
       "5  5579246069560      Kique           True        True  terrestrial   \n",
       "6  5579246069560      Kique           True        True  terrestrial   \n",
       "\n",
       "  isHomeworld                           username objtype             id  \n",
       "0        True  william.jeffrey.harding@gmail.com  planet  9775478565804  \n",
       "1        True  william.jeffrey.harding@gmail.com  planet  9775478565804  \n",
       "2        True  william.jeffrey.harding@gmail.com  planet  9775478565804  \n",
       "3        True                       BillmanLocal  planet  7696190212701  \n",
       "4        True                       BillmanLocal  planet  7696190212701  \n",
       "5        True                      BillmanLocal2  planet  1032253142942  \n",
       "6        True                      BillmanLocal2  planet  1032253142942  "
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "locations_df"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "First getting the list of consumption for each pop.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>location_id</th>\n",
       "      <th>consumes</th>\n",
       "      <th>pop</th>\n",
       "      <th>consumption</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1032253142942</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>7696190212701</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>9775478565804</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>3</td>\n",
       "      <td>6</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     location_id   consumes  pop  consumption\n",
       "0  1032253142942  [Organic]    2            4\n",
       "1  7696190212701  [Organic]    2            4\n",
       "2  9775478565804  [Organic]    3            6"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "consumption_df = consumption.get_consumption_df(locations_df,species_df,params)\n",
    "consumption_df"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We expand that dataset to break open the list of people in each pop. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "c:\\Users\\william.harding\\anaconda3\\envs\\exoplanets\\lib\\site-packages\\pandas\\core\\series.py:1056: SettingWithCopyWarning: \n",
      "A value is trying to be set on a copy of a slice from a DataFrame\n",
      "\n",
      "See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy\n",
      "  cacher_needs_updating = self._check_is_chained_assignment_possible()\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>location_id</th>\n",
       "      <th>consumes</th>\n",
       "      <th>pop</th>\n",
       "      <th>consumption</th>\n",
       "      <th>multi</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1032253142942</td>\n",
       "      <td>Organic</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>7696190212701</td>\n",
       "      <td>Organic</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>9775478565804</td>\n",
       "      <td>Organic</td>\n",
       "      <td>3</td>\n",
       "      <td>6</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     location_id consumes pop consumption multi\n",
       "0  1032253142942  Organic   2           4  True\n",
       "1  7696190212701  Organic   2           4  True\n",
       "2  9775478565804  Organic   3           6  True"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "consumption_df = consumption.expand_consumption_df(consumption_df)\n",
    "consumption_df"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Then we get a list of the resources available on that location. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'labels': [['location'], ['resource']],\n",
       "  'objects': [{'objid': ['9775478565804'], 'name': ['Yrie']},\n",
       "   {'volume': [813], 'objid': ['8247185782909'], 'name': ['Organic']}]},\n",
       " {'labels': [['location'], ['resource']],\n",
       "  'objects': [{'objid': ['7696190212701'], 'name': ['Dos']},\n",
       "   {'volume': [1056], 'objid': ['3854368291228'], 'name': ['Organic']}]},\n",
       " {'labels': [['location'], ['resource']],\n",
       "  'objects': [{'objid': ['1032253142942'], 'name': ['Curos']},\n",
       "   {'volume': [892], 'objid': ['0339811963682'], 'name': ['Organic']}]}]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "c.run_query(consumption.make_resource_query(consumption_df))\n",
    "resources = c.res\n",
    "resources"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>location_id</th>\n",
       "      <th>consumes</th>\n",
       "      <th>pop</th>\n",
       "      <th>consumption</th>\n",
       "      <th>multi</th>\n",
       "      <th>available</th>\n",
       "      <th>remaining</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1032253142942</td>\n",
       "      <td>Organic</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>True</td>\n",
       "      <td>892.0</td>\n",
       "      <td>888.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>7696190212701</td>\n",
       "      <td>Organic</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>True</td>\n",
       "      <td>1056.0</td>\n",
       "      <td>1052.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>9775478565804</td>\n",
       "      <td>Organic</td>\n",
       "      <td>3</td>\n",
       "      <td>6</td>\n",
       "      <td>True</td>\n",
       "      <td>813.0</td>\n",
       "      <td>807.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     location_id consumes pop consumption multi  available  remaining\n",
       "0  1032253142942  Organic   2           4  True      892.0      888.0\n",
       "1  7696190212701  Organic   2           4  True     1056.0     1052.0\n",
       "2  9775478565804  Organic   3           6  True      813.0      807.0"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "consumption_df = consumption.tally_consumption(c,consumption_df,resources)\n",
    "consumption_df"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Then we update the resources by taking out the resources that exist. You can check that this has happened in the graph by looking at the location ids. This is a verification query that isn't run in the function application."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "0    None\n",
       "1    None\n",
       "dtype: object"
      ]
     },
     "execution_count": 52,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "consumption_df.apply(lambda x: consumption.make_resource_update_query(c,x),axis=1)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "g.V().has('objid','1212171618802').out('hasResource').valueMap()\n",
      "\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>volume</th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>description</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>864</td>\n",
       "      <td>Organic</td>\n",
       "      <td>1139592844940</td>\n",
       "      <td>bilogical material that can be consumed by pops</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>resource</td>\n",
       "      <td>1139592844940</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>107</td>\n",
       "      <td>Common Minerals</td>\n",
       "      <td>4579244562521</td>\n",
       "      <td>Iron and other common material used in constru...</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>resource</td>\n",
       "      <td>4579244562521</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>46</td>\n",
       "      <td>Rare Minerals</td>\n",
       "      <td>7328863888302</td>\n",
       "      <td>lithium, silver and other rare minerals used i...</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>resource</td>\n",
       "      <td>7328863888302</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>10419</td>\n",
       "      <td>Water</td>\n",
       "      <td>0620999397406</td>\n",
       "      <td>H2O ready to be consumed, either frozen or in ...</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>resource</td>\n",
       "      <td>0620999397406</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   volume             name          objid  \\\n",
       "0     864          Organic  1139592844940   \n",
       "1     107  Common Minerals  4579244562521   \n",
       "2      46    Rare Minerals  7328863888302   \n",
       "3   10419            Water  0620999397406   \n",
       "\n",
       "                                         description  \\\n",
       "0    bilogical material that can be consumed by pops   \n",
       "1  Iron and other common material used in constru...   \n",
       "2  lithium, silver and other rare minerals used i...   \n",
       "3  H2O ready to be consumed, either frozen or in ...   \n",
       "\n",
       "                            username   objtype             id  \n",
       "0  william.jeffrey.harding@gmail.com  resource  1139592844940  \n",
       "1  william.jeffrey.harding@gmail.com  resource  4579244562521  \n",
       "2  william.jeffrey.harding@gmail.com  resource  7328863888302  \n",
       "3  william.jeffrey.harding@gmail.com  resource  0620999397406  "
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "validate_resources_updated_query = f\"\"\"\n",
    "g.V().has('objid','1212171618802').out('hasResource').valueMap()\n",
    "\"\"\"\n",
    "print(validate_resources_updated_query)\n",
    "c.run_query(validate_resources_updated_query)\n",
    "pd.DataFrame.from_records(c.clean_nodes(c.res))"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Now for the starving. Populations without enough food will starve (health declines). Populations with < 0 health will die."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>location_id</th>\n",
       "      <th>consumes</th>\n",
       "      <th>pop</th>\n",
       "      <th>consumption</th>\n",
       "      <th>multi</th>\n",
       "      <th>available</th>\n",
       "      <th>remaining</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>1212171618802</td>\n",
       "      <td>Organic</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>True</td>\n",
       "      <td>868.0</td>\n",
       "      <td>864.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1566812213349</td>\n",
       "      <td>Organic</td>\n",
       "      <td>2</td>\n",
       "      <td>4</td>\n",
       "      <td>True</td>\n",
       "      <td>728.0</td>\n",
       "      <td>724.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     location_id consumes pop consumption multi  available  remaining\n",
       "0  1212171618802  Organic   2           4  True      868.0      864.0\n",
       "1  1566812213349  Organic   2           4  True      728.0      724.0"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "consumption_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>location_id</th>\n",
       "      <th>consumes</th>\n",
       "      <th>pop</th>\n",
       "      <th>consumption</th>\n",
       "      <th>multi</th>\n",
       "      <th>available</th>\n",
       "      <th>remaining</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "Empty DataFrame\n",
       "Columns: [location_id, consumes, pop, consumption, multi, available, remaining]\n",
       "Index: []"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "consumption_df[consumption_df['remaining']<=0].apply(lambda x: consumption.lower_health(c,params,x),axis=1)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Looking more closely at `lower_health`\n",
    "This only happens on locations that have < 0 resources. But here we're going to do it regardless"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "location_id    1212171618802\n",
      "consumes             Organic\n",
      "pop                        2\n",
      "consumption                4\n",
      "multi                   True\n",
      "available              868.0\n",
      "remaining              864.0\n",
      "Name: 0, dtype: object\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "[{'labels': [['location'], ['pop'], ['species']],\n",
       "  'objects': [{'objid': ['1212171618802'], 'name': ['Yepi']},\n",
       "   {'name': ['Dorf Maymanessha'],\n",
       "    'objid': ['3740655755079'],\n",
       "    'health': [0.5],\n",
       "    'username': ['william.jeffrey.harding@gmail.com']},\n",
       "   {'name': ['Gordi'],\n",
       "    'objid': ['0327650709394'],\n",
       "    'consumes': ['[Organic]']}]},\n",
       " {'labels': [['location'], ['pop'], ['species']],\n",
       "  'objects': [{'objid': ['1212171618802'], 'name': ['Yepi']},\n",
       "   {'name': ['Behaleslaikon Pla'],\n",
       "    'objid': ['7148617739848'],\n",
       "    'health': [0.5],\n",
       "    'username': ['william.jeffrey.harding@gmail.com']},\n",
       "   {'name': ['Gordi'],\n",
       "    'objid': ['0327650709394'],\n",
       "    'consumes': ['[Organic]']}]}]"
      ]
     },
     "execution_count": 18,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "x = consumption_df.loc[0]\n",
    "print(x)\n",
    "\n",
    "dead_pop_nodes = []\n",
    "dead_pop_ids = []\n",
    "death_event_edges = []\n",
    "query =f\"\"\"\n",
    "g.V().has('objid','{x.location_id}').as('location').in('inhabits')\n",
    "    .haslabel('pop').as('pop')\n",
    "    .out('isOfSpecies').as('species')\n",
    "    .path()\n",
    "        .by(valueMap('objid','name'))\n",
    "        .by(valueMap('name','objid','health','username'))\n",
    "        .by(valueMap('name','objid','consumes'))\n",
    "\"\"\"\n",
    "c.run_query(query)\n",
    "out = c.res\n",
    "out"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 pops will starve in 1212171618802\n"
     ]
    }
   ],
   "source": [
    "print(f\"{len(out)} pops will starve in {x.location_id}\")"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We are only going to starve the pop if the pop consumes that resource. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'labels': [['location'], ['pop'], ['species']], 'objects': [{'objid': ['1212171618802'], 'name': ['Yepi']}, {'name': ['Behaleslaikon Pla'], 'objid': ['7148617739848'], 'health': [0.5], 'username': ['william.jeffrey.harding@gmail.com']}, {'name': ['Gordi'], 'objid': ['0327650709394'], 'consumes': ['[Organic]']}]} True\n"
     ]
    }
   ],
   "source": [
    "for i in out:\n",
    "    health = i['objects'][1]['health'][0]\n",
    "    objid = i['objects'][1]['objid'][0]\n",
    "    consumes = yaml.safe_load(i['objects'][2]['consumes'][0])\n",
    "    all_death = 0\n",
    "\n",
    "print(i, x.consumes in consumes)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "health just goes down. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "                g.V().has('objid','7148617739848').property('health',0.45)\n",
      "                \n"
     ]
    }
   ],
   "source": [
    "starve_query = f\"\"\"\n",
    "                g.V().has('objid','{objid}').property('health',{health-params['starve_damage']})\n",
    "                \"\"\"\n",
    "print(starve_query)"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Let's pretend that the pop will die. IF they do, it will create a `death event`."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'objid': '9409138528410',\n",
       " 'name': 'starvation',\n",
       " 'label': 'event',\n",
       " 'text': 'The population (Behaleslaikon Pla) inhabiting Yepi has died of starvation.',\n",
       " 'visibleTo': 'william.jeffrey.harding@gmail.com',\n",
       " 'time': 23763,\n",
       " 'username': 'azfunction'}"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "death_event = consumption.death_by_starvation_event(c.clean_node(i['objects'][0]),i['objects'][1],params)\n",
    "death_event"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "We will also link that event to an appropriate `happendAt` so that we can see it when looking at events related to specific things. "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "g.V().has('objid','9409138528410')\n",
      "            .addE('happenedAt')\n",
      "            .to(g.V().has('objid','1212171618802'))\n"
     ]
    }
   ],
   "source": [
    "print(c.create_custom_edge(death_event, c.clean_node(i['objects'][0]), 'happenedAt').strip())"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Population growth\n",
    "* Populations that die are deleted, so they don't grow.\n",
    "* However all pops that can grow will, regardless of wheter they are starving or not. \n",
    "* Starving will lower thier health, which will eventually make them unable to grow. \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [],
   "source": [
    "from tools import growth\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "lenth of pops == 0 : False\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>health</th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>conformity</th>\n",
       "      <th>literacy</th>\n",
       "      <th>aggression</th>\n",
       "      <th>constitution</th>\n",
       "      <th>isInFaction</th>\n",
       "      <th>industry</th>\n",
       "      <th>wealth</th>\n",
       "      <th>factionLoyalty</th>\n",
       "      <th>isIdle</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.5</td>\n",
       "      <td>Monuevil Harreipia</td>\n",
       "      <td>8622793176589</td>\n",
       "      <td>0.453</td>\n",
       "      <td>0.508</td>\n",
       "      <td>0.501</td>\n",
       "      <td>0.446</td>\n",
       "      <td>9132659179734</td>\n",
       "      <td>0.4735</td>\n",
       "      <td>0.4908</td>\n",
       "      <td>0.447</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>8622793176589</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0.5</td>\n",
       "      <td>Chan Lamauhal</td>\n",
       "      <td>9972182873463</td>\n",
       "      <td>0.499</td>\n",
       "      <td>0.676</td>\n",
       "      <td>0.516</td>\n",
       "      <td>0.506</td>\n",
       "      <td>2075919117794</td>\n",
       "      <td>0.5110</td>\n",
       "      <td>0.5935</td>\n",
       "      <td>0.606</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>9972182873463</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>0.5</td>\n",
       "      <td>Dorf Maymanessha</td>\n",
       "      <td>3740655755079</td>\n",
       "      <td>0.538</td>\n",
       "      <td>0.524</td>\n",
       "      <td>0.526</td>\n",
       "      <td>0.670</td>\n",
       "      <td>3600019733579</td>\n",
       "      <td>0.5980</td>\n",
       "      <td>0.5610</td>\n",
       "      <td>0.538</td>\n",
       "      <td>true</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>3740655755079</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0.5</td>\n",
       "      <td>Behaleslaikon Pla</td>\n",
       "      <td>7148617739848</td>\n",
       "      <td>0.509</td>\n",
       "      <td>0.439</td>\n",
       "      <td>0.699</td>\n",
       "      <td>0.399</td>\n",
       "      <td>8774319370110</td>\n",
       "      <td>0.5490</td>\n",
       "      <td>0.4940</td>\n",
       "      <td>0.404</td>\n",
       "      <td>true</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>7148617739848</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   health                name          objid  conformity  literacy  \\\n",
       "0     0.5  Monuevil Harreipia  8622793176589       0.453     0.508   \n",
       "1     0.5       Chan Lamauhal  9972182873463       0.499     0.676   \n",
       "2     0.5    Dorf Maymanessha  3740655755079       0.538     0.524   \n",
       "3     0.5   Behaleslaikon Pla  7148617739848       0.509     0.439   \n",
       "\n",
       "   aggression  constitution    isInFaction  industry  wealth  factionLoyalty  \\\n",
       "0       0.501         0.446  9132659179734    0.4735  0.4908           0.447   \n",
       "1       0.516         0.506  2075919117794    0.5110  0.5935           0.606   \n",
       "2       0.526         0.670  3600019733579    0.5980  0.5610           0.538   \n",
       "3       0.699         0.399  8774319370110    0.5490  0.4940           0.404   \n",
       "\n",
       "  isIdle                           username objtype             id  \n",
       "0   true                      BillmanLocal2     pop  8622793176589  \n",
       "1   true                      BillmanLocal2     pop  9972182873463  \n",
       "2   true  william.jeffrey.harding@gmail.com     pop  3740655755079  \n",
       "3   true  william.jeffrey.harding@gmail.com     pop  7148617739848  "
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pops_df,species_df,locations_df = growth.get_pop_health(c,params)\n",
    "print(f\"lenth of pops == 0 : {len(pops_df)==0}\")\n",
    "pops_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>consumes</th>\n",
       "      <th>effuses</th>\n",
       "      <th>viral_resilience</th>\n",
       "      <th>habitat_resilience</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Losfenly</td>\n",
       "      <td>5303083615604</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>5303083615604</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Losfenly</td>\n",
       "      <td>5303083615604</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>5303083615604</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Gordi</td>\n",
       "      <td>0327650709394</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>species</td>\n",
       "      <td>0327650709394</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Gordi</td>\n",
       "      <td>0327650709394</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>species</td>\n",
       "      <td>0327650709394</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       name          objid   consumes                    effuses  \\\n",
       "0  Losfenly  5303083615604  [Organic]  [Organic waste, Plastics]   \n",
       "1  Losfenly  5303083615604  [Organic]  [Organic waste, Plastics]   \n",
       "2     Gordi  0327650709394  [Organic]  [Organic waste, Plastics]   \n",
       "3     Gordi  0327650709394  [Organic]  [Organic waste, Plastics]   \n",
       "\n",
       "   viral_resilience  habitat_resilience                           username  \\\n",
       "0               0.7                 0.2                      BillmanLocal2   \n",
       "1               0.7                 0.2                      BillmanLocal2   \n",
       "2               0.7                 0.2  william.jeffrey.harding@gmail.com   \n",
       "3               0.7                 0.2  william.jeffrey.harding@gmail.com   \n",
       "\n",
       "   objtype             id  \n",
       "0  species  5303083615604  \n",
       "1  species  5303083615604  \n",
       "2  species  0327650709394  \n",
       "3  species  0327650709394  "
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "species_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>class</th>\n",
       "      <th>objid</th>\n",
       "      <th>radius</th>\n",
       "      <th>mass</th>\n",
       "      <th>orbitsDistance</th>\n",
       "      <th>orbitsId</th>\n",
       "      <th>orbitsName</th>\n",
       "      <th>isSupportsLife</th>\n",
       "      <th>isPopulated</th>\n",
       "      <th>type</th>\n",
       "      <th>isHomeworld</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Tesebrid</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>1566812213349</td>\n",
       "      <td>1.019</td>\n",
       "      <td>0.00</td>\n",
       "      <td>2</td>\n",
       "      <td>2367018655305</td>\n",
       "      <td>Varhu</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>1566812213349</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Tesebrid</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>1566812213349</td>\n",
       "      <td>1.019</td>\n",
       "      <td>0.00</td>\n",
       "      <td>2</td>\n",
       "      <td>2367018655305</td>\n",
       "      <td>Varhu</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>1566812213349</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Yepi</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>1212171618802</td>\n",
       "      <td>1.268</td>\n",
       "      <td>0.99</td>\n",
       "      <td>1</td>\n",
       "      <td>4037124139478</td>\n",
       "      <td>Qaneu</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>planet</td>\n",
       "      <td>1212171618802</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Yepi</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>1212171618802</td>\n",
       "      <td>1.268</td>\n",
       "      <td>0.99</td>\n",
       "      <td>1</td>\n",
       "      <td>4037124139478</td>\n",
       "      <td>Qaneu</td>\n",
       "      <td>True</td>\n",
       "      <td>True</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>True</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>planet</td>\n",
       "      <td>1212171618802</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "       name        class          objid  radius  mass  orbitsDistance  \\\n",
       "0  Tesebrid  terrestrial  1566812213349   1.019  0.00               2   \n",
       "1  Tesebrid  terrestrial  1566812213349   1.019  0.00               2   \n",
       "2      Yepi  terrestrial  1212171618802   1.268  0.99               1   \n",
       "3      Yepi  terrestrial  1212171618802   1.268  0.99               1   \n",
       "\n",
       "        orbitsId orbitsName isSupportsLife isPopulated         type  \\\n",
       "0  2367018655305      Varhu           True        True  terrestrial   \n",
       "1  2367018655305      Varhu           True        True  terrestrial   \n",
       "2  4037124139478      Qaneu           True        True  terrestrial   \n",
       "3  4037124139478      Qaneu           True        True  terrestrial   \n",
       "\n",
       "  isHomeworld                           username objtype             id  \n",
       "0        True                      BillmanLocal2  planet  1566812213349  \n",
       "1        True                      BillmanLocal2  planet  1566812213349  \n",
       "2        True  william.jeffrey.harding@gmail.com  planet  1212171618802  \n",
       "3        True  william.jeffrey.harding@gmail.com  planet  1212171618802  "
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "locations_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 28,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>health</th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>conformity</th>\n",
       "      <th>literacy</th>\n",
       "      <th>aggression</th>\n",
       "      <th>constitution</th>\n",
       "      <th>isInFaction</th>\n",
       "      <th>industry</th>\n",
       "      <th>wealth</th>\n",
       "      <th>factionLoyalty</th>\n",
       "      <th>isIdle</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "      <th>roll</th>\n",
       "      <th>grow</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.5</td>\n",
       "      <td>Monuevil Harreipia</td>\n",
       "      <td>8622793176589</td>\n",
       "      <td>0.453</td>\n",
       "      <td>0.508</td>\n",
       "      <td>0.501</td>\n",
       "      <td>0.446</td>\n",
       "      <td>9132659179734</td>\n",
       "      <td>0.4735</td>\n",
       "      <td>0.4908</td>\n",
       "      <td>0.447</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>8622793176589</td>\n",
       "      <td>0.140471</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0.5</td>\n",
       "      <td>Chan Lamauhal</td>\n",
       "      <td>9972182873463</td>\n",
       "      <td>0.499</td>\n",
       "      <td>0.676</td>\n",
       "      <td>0.516</td>\n",
       "      <td>0.506</td>\n",
       "      <td>2075919117794</td>\n",
       "      <td>0.5110</td>\n",
       "      <td>0.5935</td>\n",
       "      <td>0.606</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>9972182873463</td>\n",
       "      <td>0.496344</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>0.5</td>\n",
       "      <td>Dorf Maymanessha</td>\n",
       "      <td>3740655755079</td>\n",
       "      <td>0.538</td>\n",
       "      <td>0.524</td>\n",
       "      <td>0.526</td>\n",
       "      <td>0.670</td>\n",
       "      <td>3600019733579</td>\n",
       "      <td>0.5980</td>\n",
       "      <td>0.5610</td>\n",
       "      <td>0.538</td>\n",
       "      <td>true</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>3740655755079</td>\n",
       "      <td>0.638432</td>\n",
       "      <td>False</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0.5</td>\n",
       "      <td>Behaleslaikon Pla</td>\n",
       "      <td>7148617739848</td>\n",
       "      <td>0.509</td>\n",
       "      <td>0.439</td>\n",
       "      <td>0.699</td>\n",
       "      <td>0.399</td>\n",
       "      <td>8774319370110</td>\n",
       "      <td>0.5490</td>\n",
       "      <td>0.4940</td>\n",
       "      <td>0.404</td>\n",
       "      <td>true</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>7148617739848</td>\n",
       "      <td>0.414724</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   health                name          objid  conformity  literacy  \\\n",
       "0     0.5  Monuevil Harreipia  8622793176589       0.453     0.508   \n",
       "1     0.5       Chan Lamauhal  9972182873463       0.499     0.676   \n",
       "2     0.5    Dorf Maymanessha  3740655755079       0.538     0.524   \n",
       "3     0.5   Behaleslaikon Pla  7148617739848       0.509     0.439   \n",
       "\n",
       "   aggression  constitution    isInFaction  industry  wealth  factionLoyalty  \\\n",
       "0       0.501         0.446  9132659179734    0.4735  0.4908           0.447   \n",
       "1       0.516         0.506  2075919117794    0.5110  0.5935           0.606   \n",
       "2       0.526         0.670  3600019733579    0.5980  0.5610           0.538   \n",
       "3       0.699         0.399  8774319370110    0.5490  0.4940           0.404   \n",
       "\n",
       "  isIdle                           username objtype             id      roll  \\\n",
       "0   true                      BillmanLocal2     pop  8622793176589  0.140471   \n",
       "1   true                      BillmanLocal2     pop  9972182873463  0.496344   \n",
       "2   true  william.jeffrey.harding@gmail.com     pop  3740655755079  0.638432   \n",
       "3   true  william.jeffrey.harding@gmail.com     pop  7148617739848  0.414724   \n",
       "\n",
       "    grow  \n",
       "0   True  \n",
       "1   True  \n",
       "2  False  \n",
       "3   True  "
      ]
     },
     "execution_count": 28,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pops_df['roll'] = pops_df['objid'].apply(lambda x: np.random.random())\n",
    "pops_df['grow'] = pops_df[['wealth','health']].T.mean() >= pops_df['roll']\n",
    "\n",
    "reproducing_pops = pops_df[pops_df['grow']].drop(['roll','grow'],axis=1)\n",
    "pops_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>health</th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>conformity</th>\n",
       "      <th>literacy</th>\n",
       "      <th>aggression</th>\n",
       "      <th>constitution</th>\n",
       "      <th>isInFaction</th>\n",
       "      <th>industry</th>\n",
       "      <th>wealth</th>\n",
       "      <th>factionLoyalty</th>\n",
       "      <th>isIdle</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.5</td>\n",
       "      <td>Monuevil Harreipia</td>\n",
       "      <td>8622793176589</td>\n",
       "      <td>0.453</td>\n",
       "      <td>0.508</td>\n",
       "      <td>0.501</td>\n",
       "      <td>0.446</td>\n",
       "      <td>9132659179734</td>\n",
       "      <td>0.4735</td>\n",
       "      <td>0.4908</td>\n",
       "      <td>0.447</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>8622793176589</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0.5</td>\n",
       "      <td>Chan Lamauhal</td>\n",
       "      <td>9972182873463</td>\n",
       "      <td>0.499</td>\n",
       "      <td>0.676</td>\n",
       "      <td>0.516</td>\n",
       "      <td>0.506</td>\n",
       "      <td>2075919117794</td>\n",
       "      <td>0.5110</td>\n",
       "      <td>0.5935</td>\n",
       "      <td>0.606</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>9972182873463</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0.5</td>\n",
       "      <td>Behaleslaikon Pla</td>\n",
       "      <td>7148617739848</td>\n",
       "      <td>0.509</td>\n",
       "      <td>0.439</td>\n",
       "      <td>0.699</td>\n",
       "      <td>0.399</td>\n",
       "      <td>8774319370110</td>\n",
       "      <td>0.5490</td>\n",
       "      <td>0.4940</td>\n",
       "      <td>0.404</td>\n",
       "      <td>true</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>7148617739848</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   health                name          objid  conformity  literacy  \\\n",
       "0     0.5  Monuevil Harreipia  8622793176589       0.453     0.508   \n",
       "1     0.5       Chan Lamauhal  9972182873463       0.499     0.676   \n",
       "3     0.5   Behaleslaikon Pla  7148617739848       0.509     0.439   \n",
       "\n",
       "   aggression  constitution    isInFaction  industry  wealth  factionLoyalty  \\\n",
       "0       0.501         0.446  9132659179734    0.4735  0.4908           0.447   \n",
       "1       0.516         0.506  2075919117794    0.5110  0.5935           0.606   \n",
       "3       0.699         0.399  8774319370110    0.5490  0.4940           0.404   \n",
       "\n",
       "  isIdle                           username objtype             id  \n",
       "0   true                      BillmanLocal2     pop  8622793176589  \n",
       "1   true                      BillmanLocal2     pop  9972182873463  \n",
       "3   true  william.jeffrey.harding@gmail.com     pop  7148617739848  "
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "reproducing_pops"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "metadata": {},
   "outputs": [],
   "source": [
    "nodes = []\n",
    "edges = []\n",
    "# Event edges must be uploaded separately, because the event nodes haven't been created yet.    \n",
    "event_edges = []"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "metadata": {},
   "outputs": [],
   "source": [
    "for i in reproducing_pops.index.to_list():\n",
    "    p = reproducing_pops.loc[i].to_dict()\n",
    "    species = species_df.loc[i].to_dict()\n",
    "    location = locations_df.loc[i].to_dict()\n",
    "    child = growth.grow_pop(p,species,params,syllables)\n",
    "    nodes.append(child)\n",
    "    event = growth.population_growth_event(p, location,child,params)\n",
    "    nodes.append(event)\n",
    "    edges.append({\"node1\": child[\"objid\"], \"node2\": p[\"objid\"], \"label\": \"childOf\"})\n",
    "    edges.append({\"node1\": child[\"objid\"], \"node2\": child[\"isInFaction\"], \"label\": \"isInFaction\"})\n",
    "    edges.append({\"node1\": child[\"objid\"], \"node2\": species[\"objid\"], \"label\": \"isOfSpecies\"})\n",
    "    event_edges.append(c.create_custom_edge(event,location,'happenedAt'))\n",
    "    event_edges.append(c.create_custom_edge(p,event,'caused'))\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'health': 0.5,\n",
       " 'name': 'Behaleslaikon Pla',\n",
       " 'objid': '7148617739848',\n",
       " 'conformity': 0.509,\n",
       " 'literacy': 0.439,\n",
       " 'aggression': 0.699,\n",
       " 'constitution': 0.399,\n",
       " 'isInFaction': '8774319370110',\n",
       " 'industry': 0.549,\n",
       " 'wealth': 0.494,\n",
       " 'factionLoyalty': 0.404,\n",
       " 'isIdle': 'true',\n",
       " 'username': 'william.jeffrey.harding@gmail.com',\n",
       " 'objtype': 'pop',\n",
       " 'id': '7148617739848'}"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "p"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'health': 0.3,\n",
       " 'name': 'Behaleslaikon Plaben',\n",
       " 'objid': '2001620281634',\n",
       " 'conformity': 0.429,\n",
       " 'literacy': 0.343,\n",
       " 'aggression': 0.621,\n",
       " 'constitution': 0.305,\n",
       " 'isInFaction': '8774319370110',\n",
       " 'industry': 0.329,\n",
       " 'wealth': 0.328,\n",
       " 'factionLoyalty': 0.305,\n",
       " 'isIdle': 'true',\n",
       " 'username': 'william.jeffrey.harding@gmail.com',\n",
       " 'objtype': 'pop',\n",
       " 'id': '2001620281634',\n",
       " 'label': 'pop'}"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "growth.grow_pop(p,species,params,syllables)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>health</th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>conformity</th>\n",
       "      <th>literacy</th>\n",
       "      <th>aggression</th>\n",
       "      <th>constitution</th>\n",
       "      <th>isInFaction</th>\n",
       "      <th>industry</th>\n",
       "      <th>wealth</th>\n",
       "      <th>factionLoyalty</th>\n",
       "      <th>isIdle</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "      <th>label</th>\n",
       "      <th>text</th>\n",
       "      <th>visibleTo</th>\n",
       "      <th>time</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.3</td>\n",
       "      <td>Monuevil Harreipiador</td>\n",
       "      <td>7465445793593</td>\n",
       "      <td>0.416</td>\n",
       "      <td>0.469</td>\n",
       "      <td>0.456</td>\n",
       "      <td>0.521</td>\n",
       "      <td>9132659179734</td>\n",
       "      <td>0.284</td>\n",
       "      <td>0.324</td>\n",
       "      <td>0.433</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>7465445793593</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0.3</td>\n",
       "      <td>Monuevil Harreipiate</td>\n",
       "      <td>3197398916113</td>\n",
       "      <td>0.386</td>\n",
       "      <td>0.478</td>\n",
       "      <td>0.420</td>\n",
       "      <td>0.384</td>\n",
       "      <td>9132659179734</td>\n",
       "      <td>0.284</td>\n",
       "      <td>0.365</td>\n",
       "      <td>0.387</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>3197398916113</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>2264452032270</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Monuevil Harreipia) inhabiting...</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>23763.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0.3</td>\n",
       "      <td>Chan Lamauhalhay</td>\n",
       "      <td>0245165221776</td>\n",
       "      <td>0.554</td>\n",
       "      <td>0.715</td>\n",
       "      <td>0.461</td>\n",
       "      <td>0.589</td>\n",
       "      <td>2075919117794</td>\n",
       "      <td>0.307</td>\n",
       "      <td>0.267</td>\n",
       "      <td>0.537</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>0245165221776</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>8977074283212</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Chan Lamauhal) inhabiting Tese...</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>23763.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>0.3</td>\n",
       "      <td>Behaleslaikon Plare</td>\n",
       "      <td>3121628058607</td>\n",
       "      <td>0.539</td>\n",
       "      <td>0.528</td>\n",
       "      <td>0.719</td>\n",
       "      <td>0.415</td>\n",
       "      <td>8774319370110</td>\n",
       "      <td>0.329</td>\n",
       "      <td>0.221</td>\n",
       "      <td>0.334</td>\n",
       "      <td>true</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>3121628058607</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>3717898925491</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Behaleslaikon Pla) inhabiting ...</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>23763.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   health                   name          objid  conformity  literacy  \\\n",
       "0     0.3  Monuevil Harreipiador  7465445793593       0.416     0.469   \n",
       "1     0.3   Monuevil Harreipiate  3197398916113       0.386     0.478   \n",
       "2     NaN      population growth  2264452032270         NaN       NaN   \n",
       "3     0.3       Chan Lamauhalhay  0245165221776       0.554     0.715   \n",
       "4     NaN      population growth  8977074283212         NaN       NaN   \n",
       "5     0.3    Behaleslaikon Plare  3121628058607       0.539     0.528   \n",
       "6     NaN      population growth  3717898925491         NaN       NaN   \n",
       "\n",
       "   aggression  constitution    isInFaction  industry  wealth  factionLoyalty  \\\n",
       "0       0.456         0.521  9132659179734     0.284   0.324           0.433   \n",
       "1       0.420         0.384  9132659179734     0.284   0.365           0.387   \n",
       "2         NaN           NaN            NaN       NaN     NaN             NaN   \n",
       "3       0.461         0.589  2075919117794     0.307   0.267           0.537   \n",
       "4         NaN           NaN            NaN       NaN     NaN             NaN   \n",
       "5       0.719         0.415  8774319370110     0.329   0.221           0.334   \n",
       "6         NaN           NaN            NaN       NaN     NaN             NaN   \n",
       "\n",
       "  isIdle                           username objtype             id  label  \\\n",
       "0   true                      BillmanLocal2     pop  7465445793593    pop   \n",
       "1   true                      BillmanLocal2     pop  3197398916113    pop   \n",
       "2    NaN                                NaN     NaN            NaN  event   \n",
       "3   true                      BillmanLocal2     pop  0245165221776    pop   \n",
       "4    NaN                                NaN     NaN            NaN  event   \n",
       "5   true  william.jeffrey.harding@gmail.com     pop  3121628058607    pop   \n",
       "6    NaN                                NaN     NaN            NaN  event   \n",
       "\n",
       "                                                text  \\\n",
       "0                                                NaN   \n",
       "1                                                NaN   \n",
       "2  The population (Monuevil Harreipia) inhabiting...   \n",
       "3                                                NaN   \n",
       "4  The population (Chan Lamauhal) inhabiting Tese...   \n",
       "5                                                NaN   \n",
       "6  The population (Behaleslaikon Pla) inhabiting ...   \n",
       "\n",
       "                           visibleTo     time  \n",
       "0                                NaN      NaN  \n",
       "1                                NaN      NaN  \n",
       "2                      BillmanLocal2  23763.0  \n",
       "3                                NaN      NaN  \n",
       "4                      BillmanLocal2  23763.0  \n",
       "5                                NaN      NaN  \n",
       "6  william.jeffrey.harding@gmail.com  23763.0  "
      ]
     },
     "execution_count": 34,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.DataFrame.from_records(nodes)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>label</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>3197398916113</td>\n",
       "      <td>8622793176589</td>\n",
       "      <td>childOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>3197398916113</td>\n",
       "      <td>9132659179734</td>\n",
       "      <td>isInFaction</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>3197398916113</td>\n",
       "      <td>5303083615604</td>\n",
       "      <td>isOfSpecies</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0245165221776</td>\n",
       "      <td>9972182873463</td>\n",
       "      <td>childOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0245165221776</td>\n",
       "      <td>2075919117794</td>\n",
       "      <td>isInFaction</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>0245165221776</td>\n",
       "      <td>5303083615604</td>\n",
       "      <td>isOfSpecies</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>3121628058607</td>\n",
       "      <td>7148617739848</td>\n",
       "      <td>childOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>3121628058607</td>\n",
       "      <td>8774319370110</td>\n",
       "      <td>isInFaction</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>3121628058607</td>\n",
       "      <td>0327650709394</td>\n",
       "      <td>isOfSpecies</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           node1          node2        label\n",
       "0  3197398916113  8622793176589      childOf\n",
       "1  3197398916113  9132659179734  isInFaction\n",
       "2  3197398916113  5303083615604  isOfSpecies\n",
       "3  0245165221776  9972182873463      childOf\n",
       "4  0245165221776  2075919117794  isInFaction\n",
       "5  0245165221776  5303083615604  isOfSpecies\n",
       "6  3121628058607  7148617739848      childOf\n",
       "7  3121628058607  8774319370110  isInFaction\n",
       "8  3121628058607  0327650709394  isOfSpecies"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.DataFrame.from_records(edges)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[\"\\n        g.V().has('objid','2264452032270')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','1566812213349'))\\n        \",\n",
       " \"\\n        g.V().has('objid','8622793176589')\\n            .addE('caused')\\n            .to(g.V().has('objid','2264452032270'))\\n        \",\n",
       " \"\\n        g.V().has('objid','8977074283212')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','1566812213349'))\\n        \",\n",
       " \"\\n        g.V().has('objid','9972182873463')\\n            .addE('caused')\\n            .to(g.V().has('objid','8977074283212'))\\n        \",\n",
       " \"\\n        g.V().has('objid','3717898925491')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','1212171618802'))\\n        \",\n",
       " \"\\n        g.V().has('objid','7148617739848')\\n            .addE('caused')\\n            .to(g.V().has('objid','3717898925491'))\\n        \"]"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "event_edges"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "exoplanets",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.0"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "625a17269cb94aebb094cbcf5e0e8340f26b69d46569da60e8fc69439048adbf"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
