{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Population growth\n",
    "* Populations that die are deleted, so they don't grow.\n",
    "* However all pops that can grow will, regardless of wheter they are starving or not. \n",
    "* Starving will lower thier health, which will eventually make them unable to grow. \n",
    "\n",
    "Sarving and Death is taken care of elsewhere, so this notebook won't have that filter. \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "executing local windows deployment\n"
     ]
    }
   ],
   "source": [
    "import sys\n",
    "import numpy as np\n",
    "import pandas as pd\n",
    "\n",
    "# mapping to the modules that make the app\n",
    "sys.path.insert(0, \"..\")\n",
    "sys.path.insert(0, \"../..\")\n",
    "sys.path.insert(0, \"../../app\")\n",
    "sys.path.insert(0, \"../../functions/popgrowth/\")\n",
    "\n",
    "import yaml, ssl, asyncio, pickle, os, ast\n",
    "\n",
    "ssl._create_default_https_context = ssl._create_unverified_context\n",
    "asyncio.set_event_loop_policy(asyncio.WindowsSelectorEventLoopPolicy())\n",
    "\n",
    "import nest_asyncio\n",
    "# this is required for running in a Jupyter Notebook. \n",
    "nest_asyncio.apply()\n",
    "\n",
    "#importing the libraries from the app\n",
    "from app.connectors import cmdb_graph\n",
    "from app.objects import time\n",
    "from app.objects import population\n",
    "from app.functions import language\n",
    "from helpers import test_queries\n",
    "\n",
    "c = cmdb_graph.CosmosdbClient()\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Much of the Population growth is handled in scripts inside the Azure Function"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "params = yaml.safe_load(open(os.path.join(os.getenv(\"abspath\"),\"functions/popgrowth/settings.yml\")))\n",
    "syllables = pickle.load(open(os.path.join(os.getenv(\"abspath\"),\"app/creators/specs/syllables.p\"), \"rb\"))\n",
    "username = 'notebook'"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Time is updated by the `time` function. It is always running."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "< time at: 2023-07-30T17:44:11.675233+00:00 UTU:28311 >"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "t = time.Time(c)\n",
    "t.get_current_UTU()\n",
    "params['currentTime'] = t.params['currentTime']\n",
    "t"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'pop_health_requirement': 0.6,\n",
       " 'pop_consumes': 2,\n",
       " 'starve_damage': 0.05,\n",
       " 'changing_values': ['conformity',\n",
       "  'literacy',\n",
       "  'aggression',\n",
       "  'constitution',\n",
       "  'wealth',\n",
       "  'factionLoyalty'],\n",
       " 'currentTime': 28311}"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "params"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "For this notebook, setting the `pop_health_requirement` to an arbitrary value just to examine."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "params['pop_health_requirement'] = 0.4"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [],
   "source": [
    "# from tools import growth\n",
    "global_health_manager = population.Global_Pop_Manager(params,c)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [],
   "source": [
    "global_health_manager.get_pop_health()\n",
    "\n",
    "pops_df = pd.DataFrame([d['pop'] for d in global_health_manager.data])\n",
    "species_df = pd.DataFrame([d['species'] for d in global_health_manager.data])\n",
    "locations_df = pd.DataFrame([d['location'] for d in global_health_manager.data])\n",
    "factions_df = pd.DataFrame([d['faction'] for d in global_health_manager.data])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "lenth of pops == 0 : False\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>health</th>\n",
       "      <th>isIdle</th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>conformity</th>\n",
       "      <th>literacy</th>\n",
       "      <th>aggression</th>\n",
       "      <th>constitution</th>\n",
       "      <th>isIn</th>\n",
       "      <th>industry</th>\n",
       "      <th>wealth</th>\n",
       "      <th>factionLoyalty</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.70</td>\n",
       "      <td>false</td>\n",
       "      <td>Obattla Magor</td>\n",
       "      <td>7467985401518</td>\n",
       "      <td>0.421</td>\n",
       "      <td>0.376</td>\n",
       "      <td>0.632</td>\n",
       "      <td>0.338</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.4850</td>\n",
       "      <td>0.4305</td>\n",
       "      <td>0.505</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>7467985401518</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Pe</td>\n",
       "      <td>5100638967625</td>\n",
       "      <td>0.325</td>\n",
       "      <td>0.352</td>\n",
       "      <td>0.606</td>\n",
       "      <td>0.450</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.5280</td>\n",
       "      <td>0.4400</td>\n",
       "      <td>0.459</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>5100638967625</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Van</td>\n",
       "      <td>1800951322768</td>\n",
       "      <td>0.446</td>\n",
       "      <td>0.390</td>\n",
       "      <td>0.549</td>\n",
       "      <td>0.573</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.5610</td>\n",
       "      <td>0.4755</td>\n",
       "      <td>0.423</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>1800951322768</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Rochi</td>\n",
       "      <td>0692394121482</td>\n",
       "      <td>0.452</td>\n",
       "      <td>0.395</td>\n",
       "      <td>0.514</td>\n",
       "      <td>0.546</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.5300</td>\n",
       "      <td>0.4625</td>\n",
       "      <td>0.354</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>0692394121482</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Hassia Sin</td>\n",
       "      <td>0248671359952</td>\n",
       "      <td>0.623</td>\n",
       "      <td>0.215</td>\n",
       "      <td>0.704</td>\n",
       "      <td>0.569</td>\n",
       "      <td>4146242421204</td>\n",
       "      <td>0.6365</td>\n",
       "      <td>0.4258</td>\n",
       "      <td>0.662</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>0248671359952</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>121</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Serzeampro Bilnoru</td>\n",
       "      <td>9142883900818</td>\n",
       "      <td>0.557</td>\n",
       "      <td>0.544</td>\n",
       "      <td>0.609</td>\n",
       "      <td>0.557</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.3500</td>\n",
       "      <td>0.3900</td>\n",
       "      <td>0.749</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>9142883900818</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>122</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ciki Yqa</td>\n",
       "      <td>2819449749992</td>\n",
       "      <td>0.298</td>\n",
       "      <td>0.586</td>\n",
       "      <td>0.489</td>\n",
       "      <td>0.468</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>0.2660</td>\n",
       "      <td>0.2940</td>\n",
       "      <td>0.316</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>2819449749992</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>123</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Serzeampro Wilfo</td>\n",
       "      <td>0872830607503</td>\n",
       "      <td>0.469</td>\n",
       "      <td>0.545</td>\n",
       "      <td>0.722</td>\n",
       "      <td>0.570</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.3940</td>\n",
       "      <td>0.2740</td>\n",
       "      <td>0.494</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>0872830607503</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>124</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Serzeampro Gradonnue</td>\n",
       "      <td>7834145976449</td>\n",
       "      <td>0.340</td>\n",
       "      <td>0.495</td>\n",
       "      <td>0.532</td>\n",
       "      <td>0.635</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.3450</td>\n",
       "      <td>0.3030</td>\n",
       "      <td>0.331</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>7834145976449</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>125</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ciki Fesha</td>\n",
       "      <td>0652360161340</td>\n",
       "      <td>0.524</td>\n",
       "      <td>0.726</td>\n",
       "      <td>0.452</td>\n",
       "      <td>0.635</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>0.2970</td>\n",
       "      <td>0.3150</td>\n",
       "      <td>0.521</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>0652360161340</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>126 rows × 15 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "     health isIdle                  name          objid  conformity  literacy  \\\n",
       "0      0.70  false         Obattla Magor  7467985401518       0.421     0.376   \n",
       "1      0.70   true            Obattla Pe  5100638967625       0.325     0.352   \n",
       "2      0.70   true           Obattla Van  1800951322768       0.446     0.390   \n",
       "3      0.70   true         Obattla Rochi  0692394121482       0.452     0.395   \n",
       "4      0.70   true            Hassia Sin  0248671359952       0.623     0.215   \n",
       "..      ...    ...                   ...            ...         ...       ...   \n",
       "121    0.42   true    Serzeampro Bilnoru  9142883900818       0.557     0.544   \n",
       "122    0.42   true              Ciki Yqa  2819449749992       0.298     0.586   \n",
       "123    0.42   true      Serzeampro Wilfo  0872830607503       0.469     0.545   \n",
       "124    0.42   true  Serzeampro Gradonnue  7834145976449       0.340     0.495   \n",
       "125    0.42   true            Ciki Fesha  0652360161340       0.524     0.726   \n",
       "\n",
       "     aggression  constitution           isIn  industry  wealth  \\\n",
       "0         0.632         0.338  8822366435138    0.4850  0.4305   \n",
       "1         0.606         0.450  8822366435138    0.5280  0.4400   \n",
       "2         0.549         0.573  8822366435138    0.5610  0.4755   \n",
       "3         0.514         0.546  8822366435138    0.5300  0.4625   \n",
       "4         0.704         0.569  4146242421204    0.6365  0.4258   \n",
       "..          ...           ...            ...       ...     ...   \n",
       "121       0.609         0.557  4873232607770    0.3500  0.3900   \n",
       "122       0.489         0.468  0015468195520    0.2660  0.2940   \n",
       "123       0.722         0.570  4873232607770    0.3940  0.2740   \n",
       "124       0.532         0.635  4873232607770    0.3450  0.3030   \n",
       "125       0.452         0.635  0015468195520    0.2970  0.3150   \n",
       "\n",
       "     factionLoyalty       username objtype             id  \n",
       "0             0.505  BillmanLocal2     pop  7467985401518  \n",
       "1             0.459  BillmanLocal2     pop  5100638967625  \n",
       "2             0.423  BillmanLocal2     pop  1800951322768  \n",
       "3             0.354  BillmanLocal2     pop  0692394121482  \n",
       "4             0.662  BillmanLocal2     pop  0248671359952  \n",
       "..              ...            ...     ...            ...  \n",
       "121           0.749  Billmanserver     pop  9142883900818  \n",
       "122           0.316  Billmanserver     pop  2819449749992  \n",
       "123           0.494  Billmanserver     pop  0872830607503  \n",
       "124           0.331  Billmanserver     pop  7834145976449  \n",
       "125           0.521  Billmanserver     pop  0652360161340  \n",
       "\n",
       "[126 rows x 15 columns]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# pops_df,species_df,locations_df,factions_df = growth.get_pop_health(c,params)\n",
    "print(f\"lenth of pops == 0 : {len(pops_df)==0}\")\n",
    "pops_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>consumes</th>\n",
       "      <th>effuses</th>\n",
       "      <th>viral_resilience</th>\n",
       "      <th>habitat_resilience</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Koykudra</td>\n",
       "      <td>4291284873310</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>4291284873310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Koykudra</td>\n",
       "      <td>4291284873310</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>4291284873310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Koykudra</td>\n",
       "      <td>4291284873310</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>4291284873310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Koykudra</td>\n",
       "      <td>4291284873310</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>4291284873310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Koykudra</td>\n",
       "      <td>4291284873310</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>species</td>\n",
       "      <td>4291284873310</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>121</th>\n",
       "      <td>Til</td>\n",
       "      <td>5478087080681</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>species</td>\n",
       "      <td>5478087080681</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>122</th>\n",
       "      <td>Til</td>\n",
       "      <td>5478087080681</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>species</td>\n",
       "      <td>5478087080681</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>123</th>\n",
       "      <td>Til</td>\n",
       "      <td>5478087080681</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>species</td>\n",
       "      <td>5478087080681</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>124</th>\n",
       "      <td>Til</td>\n",
       "      <td>5478087080681</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>species</td>\n",
       "      <td>5478087080681</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>125</th>\n",
       "      <td>Til</td>\n",
       "      <td>5478087080681</td>\n",
       "      <td>[Organic]</td>\n",
       "      <td>[Organic waste, Plastics]</td>\n",
       "      <td>0.7</td>\n",
       "      <td>0.2</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>species</td>\n",
       "      <td>5478087080681</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>126 rows × 9 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "         name          objid   consumes                    effuses  \\\n",
       "0    Koykudra  4291284873310  [Organic]  [Organic waste, Plastics]   \n",
       "1    Koykudra  4291284873310  [Organic]  [Organic waste, Plastics]   \n",
       "2    Koykudra  4291284873310  [Organic]  [Organic waste, Plastics]   \n",
       "3    Koykudra  4291284873310  [Organic]  [Organic waste, Plastics]   \n",
       "4    Koykudra  4291284873310  [Organic]  [Organic waste, Plastics]   \n",
       "..        ...            ...        ...                        ...   \n",
       "121       Til  5478087080681  [Organic]  [Organic waste, Plastics]   \n",
       "122       Til  5478087080681  [Organic]  [Organic waste, Plastics]   \n",
       "123       Til  5478087080681  [Organic]  [Organic waste, Plastics]   \n",
       "124       Til  5478087080681  [Organic]  [Organic waste, Plastics]   \n",
       "125       Til  5478087080681  [Organic]  [Organic waste, Plastics]   \n",
       "\n",
       "     viral_resilience  habitat_resilience       username  objtype  \\\n",
       "0                 0.7                 0.2  BillmanLocal2  species   \n",
       "1                 0.7                 0.2  BillmanLocal2  species   \n",
       "2                 0.7                 0.2  BillmanLocal2  species   \n",
       "3                 0.7                 0.2  BillmanLocal2  species   \n",
       "4                 0.7                 0.2  BillmanLocal2  species   \n",
       "..                ...                 ...            ...      ...   \n",
       "121               0.7                 0.2  Billmanserver  species   \n",
       "122               0.7                 0.2  Billmanserver  species   \n",
       "123               0.7                 0.2  Billmanserver  species   \n",
       "124               0.7                 0.2  Billmanserver  species   \n",
       "125               0.7                 0.2  Billmanserver  species   \n",
       "\n",
       "                id  \n",
       "0    4291284873310  \n",
       "1    4291284873310  \n",
       "2    4291284873310  \n",
       "3    4291284873310  \n",
       "4    4291284873310  \n",
       "..             ...  \n",
       "121  5478087080681  \n",
       "122  5478087080681  \n",
       "123  5478087080681  \n",
       "124  5478087080681  \n",
       "125  5478087080681  \n",
       "\n",
       "[126 rows x 9 columns]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "species_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>class</th>\n",
       "      <th>objid</th>\n",
       "      <th>radius</th>\n",
       "      <th>mass</th>\n",
       "      <th>orbitsDistance</th>\n",
       "      <th>orbitsId</th>\n",
       "      <th>orbitsName</th>\n",
       "      <th>isSupportsLife</th>\n",
       "      <th>isPopulated</th>\n",
       "      <th>isHomeworld</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Dorf</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>2972908340606</td>\n",
       "      <td>0.884</td>\n",
       "      <td>0.882</td>\n",
       "      <td>1.057</td>\n",
       "      <td>9570931993836</td>\n",
       "      <td>Lisallos</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>2972908340606</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Dorf</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>2972908340606</td>\n",
       "      <td>0.884</td>\n",
       "      <td>0.882</td>\n",
       "      <td>1.057</td>\n",
       "      <td>9570931993836</td>\n",
       "      <td>Lisallos</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>2972908340606</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Dorf</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>2972908340606</td>\n",
       "      <td>0.884</td>\n",
       "      <td>0.882</td>\n",
       "      <td>1.057</td>\n",
       "      <td>9570931993836</td>\n",
       "      <td>Lisallos</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>2972908340606</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Dorf</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>2972908340606</td>\n",
       "      <td>0.884</td>\n",
       "      <td>0.882</td>\n",
       "      <td>1.057</td>\n",
       "      <td>9570931993836</td>\n",
       "      <td>Lisallos</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>2972908340606</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Dorf</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>2972908340606</td>\n",
       "      <td>0.884</td>\n",
       "      <td>0.882</td>\n",
       "      <td>1.057</td>\n",
       "      <td>9570931993836</td>\n",
       "      <td>Lisallos</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>planet</td>\n",
       "      <td>2972908340606</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>121</th>\n",
       "      <td>Taipe</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>8490894854096</td>\n",
       "      <td>0.898</td>\n",
       "      <td>0.113</td>\n",
       "      <td>1.087</td>\n",
       "      <td>1849212388331</td>\n",
       "      <td>Lindraja</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>planet</td>\n",
       "      <td>8490894854096</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>122</th>\n",
       "      <td>Taipe</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>8490894854096</td>\n",
       "      <td>0.898</td>\n",
       "      <td>0.113</td>\n",
       "      <td>1.087</td>\n",
       "      <td>1849212388331</td>\n",
       "      <td>Lindraja</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>planet</td>\n",
       "      <td>8490894854096</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>123</th>\n",
       "      <td>Taipe</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>8490894854096</td>\n",
       "      <td>0.898</td>\n",
       "      <td>0.113</td>\n",
       "      <td>1.087</td>\n",
       "      <td>1849212388331</td>\n",
       "      <td>Lindraja</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>planet</td>\n",
       "      <td>8490894854096</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>124</th>\n",
       "      <td>Taipe</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>8490894854096</td>\n",
       "      <td>0.898</td>\n",
       "      <td>0.113</td>\n",
       "      <td>1.087</td>\n",
       "      <td>1849212388331</td>\n",
       "      <td>Lindraja</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>planet</td>\n",
       "      <td>8490894854096</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>125</th>\n",
       "      <td>Taipe</td>\n",
       "      <td>terrestrial</td>\n",
       "      <td>8490894854096</td>\n",
       "      <td>0.898</td>\n",
       "      <td>0.113</td>\n",
       "      <td>1.087</td>\n",
       "      <td>1849212388331</td>\n",
       "      <td>Lindraja</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>true</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>planet</td>\n",
       "      <td>8490894854096</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>126 rows × 14 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "      name        class          objid  radius   mass  orbitsDistance  \\\n",
       "0     Dorf  terrestrial  2972908340606   0.884  0.882           1.057   \n",
       "1     Dorf  terrestrial  2972908340606   0.884  0.882           1.057   \n",
       "2     Dorf  terrestrial  2972908340606   0.884  0.882           1.057   \n",
       "3     Dorf  terrestrial  2972908340606   0.884  0.882           1.057   \n",
       "4     Dorf  terrestrial  2972908340606   0.884  0.882           1.057   \n",
       "..     ...          ...            ...     ...    ...             ...   \n",
       "121  Taipe  terrestrial  8490894854096   0.898  0.113           1.087   \n",
       "122  Taipe  terrestrial  8490894854096   0.898  0.113           1.087   \n",
       "123  Taipe  terrestrial  8490894854096   0.898  0.113           1.087   \n",
       "124  Taipe  terrestrial  8490894854096   0.898  0.113           1.087   \n",
       "125  Taipe  terrestrial  8490894854096   0.898  0.113           1.087   \n",
       "\n",
       "          orbitsId orbitsName isSupportsLife isPopulated isHomeworld  \\\n",
       "0    9570931993836   Lisallos           true        true        true   \n",
       "1    9570931993836   Lisallos           true        true        true   \n",
       "2    9570931993836   Lisallos           true        true        true   \n",
       "3    9570931993836   Lisallos           true        true        true   \n",
       "4    9570931993836   Lisallos           true        true        true   \n",
       "..             ...        ...            ...         ...         ...   \n",
       "121  1849212388331   Lindraja           true        true        true   \n",
       "122  1849212388331   Lindraja           true        true        true   \n",
       "123  1849212388331   Lindraja           true        true        true   \n",
       "124  1849212388331   Lindraja           true        true        true   \n",
       "125  1849212388331   Lindraja           true        true        true   \n",
       "\n",
       "          username objtype             id  \n",
       "0    BillmanLocal2  planet  2972908340606  \n",
       "1    BillmanLocal2  planet  2972908340606  \n",
       "2    BillmanLocal2  planet  2972908340606  \n",
       "3    BillmanLocal2  planet  2972908340606  \n",
       "4    BillmanLocal2  planet  2972908340606  \n",
       "..             ...     ...            ...  \n",
       "121  Billmanserver  planet  8490894854096  \n",
       "122  Billmanserver  planet  8490894854096  \n",
       "123  Billmanserver  planet  8490894854096  \n",
       "124  Billmanserver  planet  8490894854096  \n",
       "125  Billmanserver  planet  8490894854096  \n",
       "\n",
       "[126 rows x 14 columns]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "locations_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>pop_locations</th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>lat</th>\n",
       "      <th>long</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "      <th>pop_loactions</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[[0, 0], [-1, 1], [-2, 0], [0, 2], [-1, -1], [...</td>\n",
       "      <td>Obattla</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>-0.149</td>\n",
       "      <td>0.0</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>faction</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[[0, 0], [-1, 1], [-2, 0], [0, 2], [-1, -1], [...</td>\n",
       "      <td>Obattla</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>-0.149</td>\n",
       "      <td>0.0</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>faction</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[[0, 0], [-1, 1], [-2, 0], [0, 2], [-1, -1], [...</td>\n",
       "      <td>Obattla</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>-0.149</td>\n",
       "      <td>0.0</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>faction</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[[0, 0], [-1, 1], [-2, 0], [0, 2], [-1, -1], [...</td>\n",
       "      <td>Obattla</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>-0.149</td>\n",
       "      <td>0.0</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>faction</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[[0, 0], [-2, 2], [-1, -1], [2, 0], [-1, 3], [...</td>\n",
       "      <td>Hassia</td>\n",
       "      <td>4146242421204</td>\n",
       "      <td>0.149</td>\n",
       "      <td>0.0</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>faction</td>\n",
       "      <td>4146242421204</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>121</th>\n",
       "      <td>[[0, 0], [2, -2], [0, -2], [-2, -2], [0, 2], [...</td>\n",
       "      <td>Serzeampro</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.113</td>\n",
       "      <td>0.0</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>faction</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>122</th>\n",
       "      <td>[[0, 0], [0, -2], [-2, 2], [-2, -2], [2, 2], [...</td>\n",
       "      <td>Ciki</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>-0.113</td>\n",
       "      <td>0.0</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>faction</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>123</th>\n",
       "      <td>[[0, 0], [2, -2], [0, -2], [-2, -2], [0, 2], [...</td>\n",
       "      <td>Serzeampro</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.113</td>\n",
       "      <td>0.0</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>faction</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>124</th>\n",
       "      <td>[[0, 0], [2, -2], [0, -2], [-2, -2], [0, 2], [...</td>\n",
       "      <td>Serzeampro</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.113</td>\n",
       "      <td>0.0</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>faction</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>125</th>\n",
       "      <td>[[0, 0], [0, -2], [-2, 2], [-2, -2], [2, 2], [...</td>\n",
       "      <td>Ciki</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>-0.113</td>\n",
       "      <td>0.0</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>faction</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>126 rows × 9 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "                                         pop_locations        name  \\\n",
       "0    [[0, 0], [-1, 1], [-2, 0], [0, 2], [-1, -1], [...     Obattla   \n",
       "1    [[0, 0], [-1, 1], [-2, 0], [0, 2], [-1, -1], [...     Obattla   \n",
       "2    [[0, 0], [-1, 1], [-2, 0], [0, 2], [-1, -1], [...     Obattla   \n",
       "3    [[0, 0], [-1, 1], [-2, 0], [0, 2], [-1, -1], [...     Obattla   \n",
       "4    [[0, 0], [-2, 2], [-1, -1], [2, 0], [-1, 3], [...      Hassia   \n",
       "..                                                 ...         ...   \n",
       "121  [[0, 0], [2, -2], [0, -2], [-2, -2], [0, 2], [...  Serzeampro   \n",
       "122  [[0, 0], [0, -2], [-2, 2], [-2, -2], [2, 2], [...        Ciki   \n",
       "123  [[0, 0], [2, -2], [0, -2], [-2, -2], [0, 2], [...  Serzeampro   \n",
       "124  [[0, 0], [2, -2], [0, -2], [-2, -2], [0, 2], [...  Serzeampro   \n",
       "125  [[0, 0], [0, -2], [-2, 2], [-2, -2], [2, 2], [...        Ciki   \n",
       "\n",
       "             objid    lat  long       username  objtype             id  \\\n",
       "0    8822366435138 -0.149   0.0  BillmanLocal2  faction  8822366435138   \n",
       "1    8822366435138 -0.149   0.0  BillmanLocal2  faction  8822366435138   \n",
       "2    8822366435138 -0.149   0.0  BillmanLocal2  faction  8822366435138   \n",
       "3    8822366435138 -0.149   0.0  BillmanLocal2  faction  8822366435138   \n",
       "4    4146242421204  0.149   0.0  BillmanLocal2  faction  4146242421204   \n",
       "..             ...    ...   ...            ...      ...            ...   \n",
       "121  4873232607770  0.113   0.0  Billmanserver  faction  4873232607770   \n",
       "122  0015468195520 -0.113   0.0  Billmanserver  faction  0015468195520   \n",
       "123  4873232607770  0.113   0.0  Billmanserver  faction  4873232607770   \n",
       "124  4873232607770  0.113   0.0  Billmanserver  faction  4873232607770   \n",
       "125  0015468195520 -0.113   0.0  Billmanserver  faction  0015468195520   \n",
       "\n",
       "    pop_loactions  \n",
       "0             NaN  \n",
       "1             NaN  \n",
       "2             NaN  \n",
       "3             NaN  \n",
       "4             NaN  \n",
       "..            ...  \n",
       "121           NaN  \n",
       "122           NaN  \n",
       "123           NaN  \n",
       "124           NaN  \n",
       "125           NaN  \n",
       "\n",
       "[126 rows x 9 columns]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "factions_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>health</th>\n",
       "      <th>isIdle</th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>conformity</th>\n",
       "      <th>literacy</th>\n",
       "      <th>aggression</th>\n",
       "      <th>constitution</th>\n",
       "      <th>isIn</th>\n",
       "      <th>industry</th>\n",
       "      <th>wealth</th>\n",
       "      <th>factionLoyalty</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.70</td>\n",
       "      <td>false</td>\n",
       "      <td>Obattla Magor</td>\n",
       "      <td>7467985401518</td>\n",
       "      <td>0.421</td>\n",
       "      <td>0.376</td>\n",
       "      <td>0.632</td>\n",
       "      <td>0.338</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.4850</td>\n",
       "      <td>0.4305</td>\n",
       "      <td>0.505</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>7467985401518</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Hassia Sin</td>\n",
       "      <td>0248671359952</td>\n",
       "      <td>0.623</td>\n",
       "      <td>0.215</td>\n",
       "      <td>0.704</td>\n",
       "      <td>0.569</td>\n",
       "      <td>4146242421204</td>\n",
       "      <td>0.6365</td>\n",
       "      <td>0.4258</td>\n",
       "      <td>0.662</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>0248671359952</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Ser</td>\n",
       "      <td>7828874183454</td>\n",
       "      <td>0.372</td>\n",
       "      <td>0.370</td>\n",
       "      <td>0.575</td>\n",
       "      <td>0.581</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.5780</td>\n",
       "      <td>0.4740</td>\n",
       "      <td>0.424</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>7828874183454</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Magordra</td>\n",
       "      <td>0126014006101</td>\n",
       "      <td>0.421</td>\n",
       "      <td>0.474</td>\n",
       "      <td>0.684</td>\n",
       "      <td>0.377</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.2910</td>\n",
       "      <td>0.2290</td>\n",
       "      <td>0.594</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>0126014006101</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Hassia Sinfort</td>\n",
       "      <td>4119534664272</td>\n",
       "      <td>0.710</td>\n",
       "      <td>0.179</td>\n",
       "      <td>0.667</td>\n",
       "      <td>0.658</td>\n",
       "      <td>4146242421204</td>\n",
       "      <td>0.3820</td>\n",
       "      <td>0.2990</td>\n",
       "      <td>0.642</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>4119534664272</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Servo</td>\n",
       "      <td>9772027208419</td>\n",
       "      <td>0.344</td>\n",
       "      <td>0.401</td>\n",
       "      <td>0.545</td>\n",
       "      <td>0.670</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.3470</td>\n",
       "      <td>0.3230</td>\n",
       "      <td>0.498</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>9772027208419</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Wo</td>\n",
       "      <td>9552341693154</td>\n",
       "      <td>0.494</td>\n",
       "      <td>0.615</td>\n",
       "      <td>0.354</td>\n",
       "      <td>0.410</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.3820</td>\n",
       "      <td>0.4985</td>\n",
       "      <td>0.485</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>9552341693154</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Zopon Haydorfkerberg</td>\n",
       "      <td>1417654942596</td>\n",
       "      <td>0.370</td>\n",
       "      <td>0.389</td>\n",
       "      <td>0.509</td>\n",
       "      <td>0.389</td>\n",
       "      <td>9376731217333</td>\n",
       "      <td>0.4490</td>\n",
       "      <td>0.4190</td>\n",
       "      <td>0.510</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>1417654942596</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Quabanmarwar</td>\n",
       "      <td>1786540026813</td>\n",
       "      <td>0.473</td>\n",
       "      <td>0.475</td>\n",
       "      <td>0.511</td>\n",
       "      <td>0.539</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.4750</td>\n",
       "      <td>0.4750</td>\n",
       "      <td>0.491</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>1786540026813</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Siatiapec</td>\n",
       "      <td>5669843388137</td>\n",
       "      <td>0.859</td>\n",
       "      <td>0.824</td>\n",
       "      <td>0.225</td>\n",
       "      <td>0.232</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.2285</td>\n",
       "      <td>0.3762</td>\n",
       "      <td>0.827</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>5669843388137</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>0.75</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Niaar</td>\n",
       "      <td>7036253430140</td>\n",
       "      <td>0.584</td>\n",
       "      <td>0.692</td>\n",
       "      <td>0.252</td>\n",
       "      <td>0.248</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.2500</td>\n",
       "      <td>0.4210</td>\n",
       "      <td>0.521</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>7036253430140</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Pekreis</td>\n",
       "      <td>9364366778430</td>\n",
       "      <td>0.251</td>\n",
       "      <td>0.322</td>\n",
       "      <td>0.592</td>\n",
       "      <td>0.503</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.3170</td>\n",
       "      <td>0.2350</td>\n",
       "      <td>0.485</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>9364366778430</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Toski</td>\n",
       "      <td>1537196746887</td>\n",
       "      <td>0.814</td>\n",
       "      <td>0.571</td>\n",
       "      <td>0.271</td>\n",
       "      <td>0.288</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.1730</td>\n",
       "      <td>0.3330</td>\n",
       "      <td>0.617</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>1537196746887</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Artesner</td>\n",
       "      <td>3135645518769</td>\n",
       "      <td>0.473</td>\n",
       "      <td>0.469</td>\n",
       "      <td>0.568</td>\n",
       "      <td>0.610</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.3430</td>\n",
       "      <td>0.2790</td>\n",
       "      <td>0.538</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>3135645518769</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Boupatciaceou</td>\n",
       "      <td>6532454518591</td>\n",
       "      <td>0.646</td>\n",
       "      <td>0.626</td>\n",
       "      <td>0.310</td>\n",
       "      <td>0.223</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.1530</td>\n",
       "      <td>0.2760</td>\n",
       "      <td>0.900</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>6532454518591</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Niaarbeach</td>\n",
       "      <td>3773349428121</td>\n",
       "      <td>0.488</td>\n",
       "      <td>0.613</td>\n",
       "      <td>0.226</td>\n",
       "      <td>0.321</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.1500</td>\n",
       "      <td>0.2540</td>\n",
       "      <td>0.590</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>3773349428121</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Toscruz</td>\n",
       "      <td>1345947410478</td>\n",
       "      <td>0.665</td>\n",
       "      <td>0.556</td>\n",
       "      <td>0.370</td>\n",
       "      <td>0.287</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.1730</td>\n",
       "      <td>0.2690</td>\n",
       "      <td>0.754</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>1345947410478</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>52</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Pebai</td>\n",
       "      <td>9209226114605</td>\n",
       "      <td>0.341</td>\n",
       "      <td>0.422</td>\n",
       "      <td>0.589</td>\n",
       "      <td>0.355</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.3170</td>\n",
       "      <td>0.2590</td>\n",
       "      <td>0.458</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>9209226114605</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>53</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Vangar</td>\n",
       "      <td>2663180042456</td>\n",
       "      <td>0.531</td>\n",
       "      <td>0.414</td>\n",
       "      <td>0.560</td>\n",
       "      <td>0.516</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.3370</td>\n",
       "      <td>0.2610</td>\n",
       "      <td>0.469</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>2663180042456</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>62</th>\n",
       "      <td>0.45</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Niaarter</td>\n",
       "      <td>8617946232855</td>\n",
       "      <td>0.615</td>\n",
       "      <td>0.760</td>\n",
       "      <td>0.285</td>\n",
       "      <td>0.312</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.1500</td>\n",
       "      <td>0.2130</td>\n",
       "      <td>0.532</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>8617946232855</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>65</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Enwilsha</td>\n",
       "      <td>1448707139353</td>\n",
       "      <td>0.656</td>\n",
       "      <td>0.533</td>\n",
       "      <td>0.377</td>\n",
       "      <td>0.309</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.1800</td>\n",
       "      <td>0.2800</td>\n",
       "      <td>0.883</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>1448707139353</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>70</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Aytubon</td>\n",
       "      <td>5602624787540</td>\n",
       "      <td>0.645</td>\n",
       "      <td>0.578</td>\n",
       "      <td>0.471</td>\n",
       "      <td>0.317</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.2570</td>\n",
       "      <td>0.4100</td>\n",
       "      <td>0.477</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>5602624787540</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>71</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Quabanmarwarmel</td>\n",
       "      <td>6508710218398</td>\n",
       "      <td>0.523</td>\n",
       "      <td>0.400</td>\n",
       "      <td>0.460</td>\n",
       "      <td>0.477</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.2850</td>\n",
       "      <td>0.3610</td>\n",
       "      <td>0.504</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>6508710218398</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>73</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Boupatciacekoy</td>\n",
       "      <td>0389248018331</td>\n",
       "      <td>0.769</td>\n",
       "      <td>0.724</td>\n",
       "      <td>0.359</td>\n",
       "      <td>0.135</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.1530</td>\n",
       "      <td>0.3410</td>\n",
       "      <td>0.912</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>0389248018331</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Magorkon</td>\n",
       "      <td>7511884158024</td>\n",
       "      <td>0.417</td>\n",
       "      <td>0.421</td>\n",
       "      <td>0.568</td>\n",
       "      <td>0.271</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.2910</td>\n",
       "      <td>0.1820</td>\n",
       "      <td>0.509</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>7511884158024</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>77</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Vanhin</td>\n",
       "      <td>2721412697024</td>\n",
       "      <td>0.449</td>\n",
       "      <td>0.414</td>\n",
       "      <td>0.501</td>\n",
       "      <td>0.566</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.3370</td>\n",
       "      <td>0.1980</td>\n",
       "      <td>0.436</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>2721412697024</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>81</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Aytuhu</td>\n",
       "      <td>4828570071553</td>\n",
       "      <td>0.515</td>\n",
       "      <td>0.692</td>\n",
       "      <td>0.459</td>\n",
       "      <td>0.340</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.2570</td>\n",
       "      <td>0.3020</td>\n",
       "      <td>0.640</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>4828570071553</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>82</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Lismontpastilhills</td>\n",
       "      <td>6689339860449</td>\n",
       "      <td>0.669</td>\n",
       "      <td>0.588</td>\n",
       "      <td>0.331</td>\n",
       "      <td>0.702</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.3080</td>\n",
       "      <td>0.2700</td>\n",
       "      <td>0.704</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>6689339860449</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>83</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Quabanmarwarpro</td>\n",
       "      <td>2640969887821</td>\n",
       "      <td>0.382</td>\n",
       "      <td>0.516</td>\n",
       "      <td>0.457</td>\n",
       "      <td>0.548</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.2850</td>\n",
       "      <td>0.2570</td>\n",
       "      <td>0.584</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>2640969887821</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>84</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Zopon Lischarhalai</td>\n",
       "      <td>5908398361747</td>\n",
       "      <td>0.561</td>\n",
       "      <td>0.461</td>\n",
       "      <td>0.641</td>\n",
       "      <td>0.427</td>\n",
       "      <td>9376731217333</td>\n",
       "      <td>0.2910</td>\n",
       "      <td>0.3180</td>\n",
       "      <td>0.618</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>5908398361747</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>90</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Vanpla</td>\n",
       "      <td>7366041268748</td>\n",
       "      <td>0.378</td>\n",
       "      <td>0.312</td>\n",
       "      <td>0.456</td>\n",
       "      <td>0.651</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.3370</td>\n",
       "      <td>0.3550</td>\n",
       "      <td>0.478</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>7366041268748</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>91</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Hassia Sinwar</td>\n",
       "      <td>4471854915241</td>\n",
       "      <td>0.593</td>\n",
       "      <td>0.175</td>\n",
       "      <td>0.639</td>\n",
       "      <td>0.598</td>\n",
       "      <td>4146242421204</td>\n",
       "      <td>0.3820</td>\n",
       "      <td>0.2510</td>\n",
       "      <td>0.707</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>4471854915241</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>94</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Zopon Haydorfkerbergkay</td>\n",
       "      <td>9033250037782</td>\n",
       "      <td>0.419</td>\n",
       "      <td>0.386</td>\n",
       "      <td>0.575</td>\n",
       "      <td>0.433</td>\n",
       "      <td>9376731217333</td>\n",
       "      <td>0.2690</td>\n",
       "      <td>0.3420</td>\n",
       "      <td>0.500</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>9033250037782</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>95</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Aytutro</td>\n",
       "      <td>3034705573257</td>\n",
       "      <td>0.653</td>\n",
       "      <td>0.563</td>\n",
       "      <td>0.435</td>\n",
       "      <td>0.471</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.2570</td>\n",
       "      <td>0.3440</td>\n",
       "      <td>0.559</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>3034705573257</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>97</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Quabanmarwaro</td>\n",
       "      <td>6321321817492</td>\n",
       "      <td>0.411</td>\n",
       "      <td>0.436</td>\n",
       "      <td>0.505</td>\n",
       "      <td>0.567</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.2850</td>\n",
       "      <td>0.2180</td>\n",
       "      <td>0.405</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>6321321817492</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>102</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Ciki Y</td>\n",
       "      <td>4377394578049</td>\n",
       "      <td>0.366</td>\n",
       "      <td>0.554</td>\n",
       "      <td>0.430</td>\n",
       "      <td>0.456</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>0.4430</td>\n",
       "      <td>0.4985</td>\n",
       "      <td>0.412</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>4377394578049</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>103</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Serzeampro Wil</td>\n",
       "      <td>1772981049949</td>\n",
       "      <td>0.424</td>\n",
       "      <td>0.469</td>\n",
       "      <td>0.647</td>\n",
       "      <td>0.668</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.6575</td>\n",
       "      <td>0.5632</td>\n",
       "      <td>0.394</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>1772981049949</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>104</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Ciki Basma</td>\n",
       "      <td>1247897538416</td>\n",
       "      <td>0.510</td>\n",
       "      <td>0.532</td>\n",
       "      <td>0.390</td>\n",
       "      <td>0.478</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>0.4340</td>\n",
       "      <td>0.4830</td>\n",
       "      <td>0.602</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>1247897538416</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>105</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Serzeampro Gradon</td>\n",
       "      <td>8096543483724</td>\n",
       "      <td>0.432</td>\n",
       "      <td>0.502</td>\n",
       "      <td>0.546</td>\n",
       "      <td>0.604</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.5750</td>\n",
       "      <td>0.5385</td>\n",
       "      <td>0.375</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>8096543483724</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>106</th>\n",
       "      <td>0.70</td>\n",
       "      <td>true</td>\n",
       "      <td>Ciki Fe</td>\n",
       "      <td>8876287369940</td>\n",
       "      <td>0.456</td>\n",
       "      <td>0.725</td>\n",
       "      <td>0.428</td>\n",
       "      <td>0.562</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>0.4950</td>\n",
       "      <td>0.6100</td>\n",
       "      <td>0.529</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>8876287369940</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>107</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Magorah</td>\n",
       "      <td>5087070127104</td>\n",
       "      <td>0.433</td>\n",
       "      <td>0.318</td>\n",
       "      <td>0.612</td>\n",
       "      <td>0.322</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.2910</td>\n",
       "      <td>0.2090</td>\n",
       "      <td>0.465</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>5087070127104</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>111</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Wosun</td>\n",
       "      <td>9629904984175</td>\n",
       "      <td>0.400</td>\n",
       "      <td>0.521</td>\n",
       "      <td>0.351</td>\n",
       "      <td>0.345</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.2290</td>\n",
       "      <td>0.2960</td>\n",
       "      <td>0.583</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>9629904984175</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>115</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Quabanmarwarne</td>\n",
       "      <td>3802278433946</td>\n",
       "      <td>0.487</td>\n",
       "      <td>0.381</td>\n",
       "      <td>0.579</td>\n",
       "      <td>0.582</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.2850</td>\n",
       "      <td>0.2960</td>\n",
       "      <td>0.427</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>3802278433946</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>118</th>\n",
       "      <td>0.45</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Tankyquepu</td>\n",
       "      <td>7271925834872</td>\n",
       "      <td>0.798</td>\n",
       "      <td>0.666</td>\n",
       "      <td>0.375</td>\n",
       "      <td>0.307</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.1770</td>\n",
       "      <td>0.1960</td>\n",
       "      <td>0.548</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>7271925834872</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>121</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Serzeampro Bilnoru</td>\n",
       "      <td>9142883900818</td>\n",
       "      <td>0.557</td>\n",
       "      <td>0.544</td>\n",
       "      <td>0.609</td>\n",
       "      <td>0.557</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.3500</td>\n",
       "      <td>0.3900</td>\n",
       "      <td>0.749</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>9142883900818</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "     health isIdle                        name          objid  conformity  \\\n",
       "0      0.70  false               Obattla Magor  7467985401518       0.421   \n",
       "4      0.70   true                  Hassia Sin  0248671359952       0.623   \n",
       "6      0.70   true                 Obattla Ser  7828874183454       0.372   \n",
       "7      0.42   true            Obattla Magordra  0126014006101       0.421   \n",
       "13     0.42   true              Hassia Sinfort  4119534664272       0.710   \n",
       "15     0.42   true               Obattla Servo  9772027208419       0.344   \n",
       "17     0.70   true                  Ganjtil Wo  9552341693154       0.494   \n",
       "18     0.70   true        Zopon Haydorfkerberg  1417654942596       0.370   \n",
       "21     0.70   true        Ganjtil Quabanmarwar  1786540026813       0.473   \n",
       "25     0.70   true        Tilcasport Siatiapec  5669843388137       0.859   \n",
       "26     0.75   true            Tilcasport Niaar  7036253430140       0.584   \n",
       "30     0.42   true             Obattla Pekreis  9364366778430       0.251   \n",
       "36     0.42   true            Tilcasport Toski  1537196746887       0.814   \n",
       "41     0.42   true            Obattla Artesner  3135645518769       0.473   \n",
       "48     0.42   true    Tilcasport Boupatciaceou  6532454518591       0.646   \n",
       "49     0.42   true       Tilcasport Niaarbeach  3773349428121       0.488   \n",
       "50     0.42   true          Tilcasport Toscruz  1345947410478       0.665   \n",
       "52     0.42   true               Obattla Pebai  9209226114605       0.341   \n",
       "53     0.42   true              Obattla Vangar  2663180042456       0.531   \n",
       "62     0.45   true         Tilcasport Niaarter  8617946232855       0.615   \n",
       "65     0.42   true         Tilcasport Enwilsha  1448707139353       0.656   \n",
       "70     0.42   true             Ganjtil Aytubon  5602624787540       0.645   \n",
       "71     0.42   true     Ganjtil Quabanmarwarmel  6508710218398       0.523   \n",
       "73     0.42   true   Tilcasport Boupatciacekoy  0389248018331       0.769   \n",
       "75     0.42   true            Obattla Magorkon  7511884158024       0.417   \n",
       "77     0.42   true              Obattla Vanhin  2721412697024       0.449   \n",
       "81     0.42   true              Ganjtil Aytuhu  4828570071553       0.515   \n",
       "82     0.42   true  Ganjtil Lismontpastilhills  6689339860449       0.669   \n",
       "83     0.42   true     Ganjtil Quabanmarwarpro  2640969887821       0.382   \n",
       "84     0.42   true          Zopon Lischarhalai  5908398361747       0.561   \n",
       "90     0.42   true              Obattla Vanpla  7366041268748       0.378   \n",
       "91     0.42   true               Hassia Sinwar  4471854915241       0.593   \n",
       "94     0.42   true     Zopon Haydorfkerbergkay  9033250037782       0.419   \n",
       "95     0.42   true             Ganjtil Aytutro  3034705573257       0.653   \n",
       "97     0.42   true       Ganjtil Quabanmarwaro  6321321817492       0.411   \n",
       "102    0.70   true                      Ciki Y  4377394578049       0.366   \n",
       "103    0.70   true              Serzeampro Wil  1772981049949       0.424   \n",
       "104    0.70   true                  Ciki Basma  1247897538416       0.510   \n",
       "105    0.70   true           Serzeampro Gradon  8096543483724       0.432   \n",
       "106    0.70   true                     Ciki Fe  8876287369940       0.456   \n",
       "107    0.42   true             Obattla Magorah  5087070127104       0.433   \n",
       "111    0.42   true               Ganjtil Wosun  9629904984175       0.400   \n",
       "115    0.42   true      Ganjtil Quabanmarwarne  3802278433946       0.487   \n",
       "118    0.45   true       Tilcasport Tankyquepu  7271925834872       0.798   \n",
       "121    0.42   true          Serzeampro Bilnoru  9142883900818       0.557   \n",
       "\n",
       "     literacy  aggression  constitution           isIn  industry  wealth  \\\n",
       "0       0.376       0.632         0.338  8822366435138    0.4850  0.4305   \n",
       "4       0.215       0.704         0.569  4146242421204    0.6365  0.4258   \n",
       "6       0.370       0.575         0.581  8822366435138    0.5780  0.4740   \n",
       "7       0.474       0.684         0.377  8822366435138    0.2910  0.2290   \n",
       "13      0.179       0.667         0.658  4146242421204    0.3820  0.2990   \n",
       "15      0.401       0.545         0.670  8822366435138    0.3470  0.3230   \n",
       "17      0.615       0.354         0.410  4115897493342    0.3820  0.4985   \n",
       "18      0.389       0.509         0.389  9376731217333    0.4490  0.4190   \n",
       "21      0.475       0.511         0.539  4115897493342    0.4750  0.4750   \n",
       "25      0.824       0.225         0.232  4232678858631    0.2285  0.3762   \n",
       "26      0.692       0.252         0.248  4232678858631    0.2500  0.4210   \n",
       "30      0.322       0.592         0.503  8822366435138    0.3170  0.2350   \n",
       "36      0.571       0.271         0.288  4232678858631    0.1730  0.3330   \n",
       "41      0.469       0.568         0.610  8822366435138    0.3430  0.2790   \n",
       "48      0.626       0.310         0.223  4232678858631    0.1530  0.2760   \n",
       "49      0.613       0.226         0.321  4232678858631    0.1500  0.2540   \n",
       "50      0.556       0.370         0.287  4232678858631    0.1730  0.2690   \n",
       "52      0.422       0.589         0.355  8822366435138    0.3170  0.2590   \n",
       "53      0.414       0.560         0.516  8822366435138    0.3370  0.2610   \n",
       "62      0.760       0.285         0.312  4232678858631    0.1500  0.2130   \n",
       "65      0.533       0.377         0.309  4232678858631    0.1800  0.2800   \n",
       "70      0.578       0.471         0.317  4115897493342    0.2570  0.4100   \n",
       "71      0.400       0.460         0.477  4115897493342    0.2850  0.3610   \n",
       "73      0.724       0.359         0.135  4232678858631    0.1530  0.3410   \n",
       "75      0.421       0.568         0.271  8822366435138    0.2910  0.1820   \n",
       "77      0.414       0.501         0.566  8822366435138    0.3370  0.1980   \n",
       "81      0.692       0.459         0.340  4115897493342    0.2570  0.3020   \n",
       "82      0.588       0.331         0.702  4115897493342    0.3080  0.2700   \n",
       "83      0.516       0.457         0.548  4115897493342    0.2850  0.2570   \n",
       "84      0.461       0.641         0.427  9376731217333    0.2910  0.3180   \n",
       "90      0.312       0.456         0.651  8822366435138    0.3370  0.3550   \n",
       "91      0.175       0.639         0.598  4146242421204    0.3820  0.2510   \n",
       "94      0.386       0.575         0.433  9376731217333    0.2690  0.3420   \n",
       "95      0.563       0.435         0.471  4115897493342    0.2570  0.3440   \n",
       "97      0.436       0.505         0.567  4115897493342    0.2850  0.2180   \n",
       "102     0.554       0.430         0.456  0015468195520    0.4430  0.4985   \n",
       "103     0.469       0.647         0.668  4873232607770    0.6575  0.5632   \n",
       "104     0.532       0.390         0.478  0015468195520    0.4340  0.4830   \n",
       "105     0.502       0.546         0.604  4873232607770    0.5750  0.5385   \n",
       "106     0.725       0.428         0.562  0015468195520    0.4950  0.6100   \n",
       "107     0.318       0.612         0.322  8822366435138    0.2910  0.2090   \n",
       "111     0.521       0.351         0.345  4115897493342    0.2290  0.2960   \n",
       "115     0.381       0.579         0.582  4115897493342    0.2850  0.2960   \n",
       "118     0.666       0.375         0.307  4232678858631    0.1770  0.1960   \n",
       "121     0.544       0.609         0.557  4873232607770    0.3500  0.3900   \n",
       "\n",
       "     factionLoyalty                           username objtype             id  \n",
       "0             0.505                      BillmanLocal2     pop  7467985401518  \n",
       "4             0.662                      BillmanLocal2     pop  0248671359952  \n",
       "6             0.424                      BillmanLocal2     pop  7828874183454  \n",
       "7             0.594                      BillmanLocal2     pop  0126014006101  \n",
       "13            0.642                      BillmanLocal2     pop  4119534664272  \n",
       "15            0.498                      BillmanLocal2     pop  9772027208419  \n",
       "17            0.485                          manderson     pop  9552341693154  \n",
       "18            0.510                          manderson     pop  1417654942596  \n",
       "21            0.491                          manderson     pop  1786540026813  \n",
       "25            0.827  william.jeffrey.harding@gmail.com     pop  5669843388137  \n",
       "26            0.521  william.jeffrey.harding@gmail.com     pop  7036253430140  \n",
       "30            0.485                      BillmanLocal2     pop  9364366778430  \n",
       "36            0.617  william.jeffrey.harding@gmail.com     pop  1537196746887  \n",
       "41            0.538                      BillmanLocal2     pop  3135645518769  \n",
       "48            0.900  william.jeffrey.harding@gmail.com     pop  6532454518591  \n",
       "49            0.590  william.jeffrey.harding@gmail.com     pop  3773349428121  \n",
       "50            0.754  william.jeffrey.harding@gmail.com     pop  1345947410478  \n",
       "52            0.458                      BillmanLocal2     pop  9209226114605  \n",
       "53            0.469                      BillmanLocal2     pop  2663180042456  \n",
       "62            0.532  william.jeffrey.harding@gmail.com     pop  8617946232855  \n",
       "65            0.883  william.jeffrey.harding@gmail.com     pop  1448707139353  \n",
       "70            0.477                          manderson     pop  5602624787540  \n",
       "71            0.504                          manderson     pop  6508710218398  \n",
       "73            0.912  william.jeffrey.harding@gmail.com     pop  0389248018331  \n",
       "75            0.509                      BillmanLocal2     pop  7511884158024  \n",
       "77            0.436                      BillmanLocal2     pop  2721412697024  \n",
       "81            0.640                          manderson     pop  4828570071553  \n",
       "82            0.704                          manderson     pop  6689339860449  \n",
       "83            0.584                          manderson     pop  2640969887821  \n",
       "84            0.618                          manderson     pop  5908398361747  \n",
       "90            0.478                      BillmanLocal2     pop  7366041268748  \n",
       "91            0.707                      BillmanLocal2     pop  4471854915241  \n",
       "94            0.500                          manderson     pop  9033250037782  \n",
       "95            0.559                          manderson     pop  3034705573257  \n",
       "97            0.405                          manderson     pop  6321321817492  \n",
       "102           0.412                      Billmanserver     pop  4377394578049  \n",
       "103           0.394                      Billmanserver     pop  1772981049949  \n",
       "104           0.602                      Billmanserver     pop  1247897538416  \n",
       "105           0.375                      Billmanserver     pop  8096543483724  \n",
       "106           0.529                      Billmanserver     pop  8876287369940  \n",
       "107           0.465                      BillmanLocal2     pop  5087070127104  \n",
       "111           0.583                          manderson     pop  9629904984175  \n",
       "115           0.427                          manderson     pop  3802278433946  \n",
       "118           0.548  william.jeffrey.harding@gmail.com     pop  7271925834872  \n",
       "121           0.749                      Billmanserver     pop  9142883900818  "
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pops_df['roll'] = pops_df['objid'].apply(lambda x: np.random.random())\n",
    "pops_df['grow'] = pops_df[['wealth','health']].T.mean() >= pops_df['roll']\n",
    "\n",
    "reproducing_pops = pops_df[pops_df['grow']].drop(['roll','grow'],axis=1)\n",
    "reproducing_pops"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "45 of 126 will grow\n"
     ]
    }
   ],
   "source": [
    "print(f\"{len(reproducing_pops)} of {len(pops_df)} will grow\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Going to create species objects for the populations that will reproduce"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<species: None; 4291284873310; Koykudra>,\n",
       " <species: None; 7324266402745; Si>,\n",
       " <species: None; 1245644824657; Towner>,\n",
       " <species: None; 5478087080681; Til>]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "species = [population.species.Species(species_df.drop_duplicates().T.to_dict()[i]) for i in  species_df.drop_duplicates().T.to_dict().keys()]\n",
    "species"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'4291284873310': <species: None; 4291284873310; Koykudra>,\n",
       " '7324266402745': <species: None; 7324266402745; Si>,\n",
       " '1245644824657': <species: None; 1245644824657; Towner>,\n",
       " '5478087080681': <species: None; 5478087080681; Til>}"
      ]
     },
     "execution_count": 15,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "for i in species:\n",
    "    global_health_manager.species_dict[i.objid]=i\n",
    "global_health_manager.species_dict"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[<faction: None; 8822366435138; Obattla>,\n",
       " <faction: None; 4146242421204; Hassia>,\n",
       " <faction: None; 4115897493342; Ganjtil>,\n",
       " <faction: None; 9376731217333; Zopon>,\n",
       " <faction: None; 4232678858631; Tilcasport>,\n",
       " <faction: None; 4873232607770; Serzeampro>,\n",
       " <faction: None; 0015468195520; Ciki>]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "factions = [population.Faction(factions_df.drop_duplicates().T.to_dict()[i]) for i in  factions_df.drop_duplicates().T.to_dict().keys()]\n",
    "factions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<faction: None; 8822366435138; Obattla>"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def get_faction(objid):\n",
    "    res = [i for i in factions if i.objid == objid]\n",
    "    return res[0]\n",
    "\n",
    "get_faction(factions[0].objid)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [],
   "source": [
    "children = []\n",
    "events = []\n",
    "event_edges = []\n",
    "for i in reproducing_pops.index.to_list():\n",
    "    s = global_health_manager.species_dict[species_df.loc[i].to_dict()['objid']]\n",
    "    p = reproducing_pops.loc[i].to_dict()\n",
    "    #adding the current pop as a defautl to the species.\n",
    "    s.config['defaults'] = p\n",
    "    f = factions_df.loc[i].to_dict()\n",
    "    l = locations_df.loc[i].to_dict()\n",
    "    child = population.Pop(s)\n",
    "    child.birthplace = l\n",
    "    child.inhabitsEdge = {\"node1\": child.objid, \"node2\": l['objid'], \"label\": \"inhabits\"}\n",
    "    child.name = p['name']+language.make_word(1).lower()\n",
    "    get_faction(f['objid']).assign_pop_to_faction(child)\n",
    "    event = global_health_manager.population_growth_event(p,l,child)\n",
    "    events.append(event)\n",
    "    event_edges.append(c.create_custom_edge(event,l,'happenedAt'))\n",
    "    event_edges.append(c.create_custom_edge(p,event,'caused'))\n",
    "    children.append(child)    \n",
    "\n",
    "    \n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>objid</th>\n",
       "      <th>name</th>\n",
       "      <th>label</th>\n",
       "      <th>text</th>\n",
       "      <th>visibleTo</th>\n",
       "      <th>time</th>\n",
       "      <th>username</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>6766110645393</td>\n",
       "      <td>population growth</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Obattla Magor) inhabiting Dorf...</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>28311</td>\n",
       "      <td>event</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>3986452507572</td>\n",
       "      <td>population growth</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Hassia Sin) inhabiting Dorf ha...</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>28311</td>\n",
       "      <td>event</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>0796270282880</td>\n",
       "      <td>population growth</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Obattla Ser) inhabiting Dorf h...</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>28311</td>\n",
       "      <td>event</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>5530356909900</td>\n",
       "      <td>population growth</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Obattla Magordra) inhabiting D...</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>28311</td>\n",
       "      <td>event</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>3542151214490</td>\n",
       "      <td>population growth</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Hassia Sinfort) inhabiting Dor...</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>28311</td>\n",
       "      <td>event</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           objid               name  label  \\\n",
       "0  6766110645393  population growth  event   \n",
       "1  3986452507572  population growth  event   \n",
       "2  0796270282880  population growth  event   \n",
       "3  5530356909900  population growth  event   \n",
       "4  3542151214490  population growth  event   \n",
       "\n",
       "                                                text      visibleTo   time  \\\n",
       "0  The population (Obattla Magor) inhabiting Dorf...  BillmanLocal2  28311   \n",
       "1  The population (Hassia Sin) inhabiting Dorf ha...  BillmanLocal2  28311   \n",
       "2  The population (Obattla Ser) inhabiting Dorf h...  BillmanLocal2  28311   \n",
       "3  The population (Obattla Magordra) inhabiting D...  BillmanLocal2  28311   \n",
       "4  The population (Hassia Sinfort) inhabiting Dor...  BillmanLocal2  28311   \n",
       "\n",
       "  username  \n",
       "0    event  \n",
       "1    event  \n",
       "2    event  \n",
       "3    event  \n",
       "4    event  "
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.DataFrame(events).head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>label</th>\n",
       "      <th>conformity</th>\n",
       "      <th>literacy</th>\n",
       "      <th>aggression</th>\n",
       "      <th>constitution</th>\n",
       "      <th>health</th>\n",
       "      <th>isIn</th>\n",
       "      <th>industry</th>\n",
       "      <th>wealth</th>\n",
       "      <th>factionLoyalty</th>\n",
       "      <th>isIdle</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Obattla Magormo</td>\n",
       "      <td>2685489327234</td>\n",
       "      <td>pop</td>\n",
       "      <td>0.294</td>\n",
       "      <td>0.473</td>\n",
       "      <td>0.529</td>\n",
       "      <td>0.226</td>\n",
       "      <td>0.70</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.3775</td>\n",
       "      <td>0.42525</td>\n",
       "      <td>0.317</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Hassia Sinay</td>\n",
       "      <td>3464399901345</td>\n",
       "      <td>pop</td>\n",
       "      <td>0.509</td>\n",
       "      <td>0.422</td>\n",
       "      <td>0.342</td>\n",
       "      <td>0.421</td>\n",
       "      <td>0.70</td>\n",
       "      <td>4146242421204</td>\n",
       "      <td>0.3815</td>\n",
       "      <td>0.40175</td>\n",
       "      <td>0.522</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Obattla Serwo</td>\n",
       "      <td>5796414489637</td>\n",
       "      <td>pop</td>\n",
       "      <td>0.474</td>\n",
       "      <td>0.682</td>\n",
       "      <td>0.553</td>\n",
       "      <td>0.475</td>\n",
       "      <td>0.70</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.5140</td>\n",
       "      <td>0.59800</td>\n",
       "      <td>0.484</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Obattla Magordratal</td>\n",
       "      <td>0332270996058</td>\n",
       "      <td>pop</td>\n",
       "      <td>0.346</td>\n",
       "      <td>0.390</td>\n",
       "      <td>0.653</td>\n",
       "      <td>0.651</td>\n",
       "      <td>0.42</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.6520</td>\n",
       "      <td>0.52100</td>\n",
       "      <td>0.016</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Hassia Sinfortbin</td>\n",
       "      <td>0341442655485</td>\n",
       "      <td>pop</td>\n",
       "      <td>0.478</td>\n",
       "      <td>0.616</td>\n",
       "      <td>0.508</td>\n",
       "      <td>0.619</td>\n",
       "      <td>0.42</td>\n",
       "      <td>4146242421204</td>\n",
       "      <td>0.5635</td>\n",
       "      <td>0.58975</td>\n",
       "      <td>0.402</td>\n",
       "      <td>True</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                  name          objid label  conformity  literacy  aggression  \\\n",
       "0      Obattla Magormo  2685489327234   pop       0.294     0.473       0.529   \n",
       "1         Hassia Sinay  3464399901345   pop       0.509     0.422       0.342   \n",
       "2        Obattla Serwo  5796414489637   pop       0.474     0.682       0.553   \n",
       "3  Obattla Magordratal  0332270996058   pop       0.346     0.390       0.653   \n",
       "4    Hassia Sinfortbin  0341442655485   pop       0.478     0.616       0.508   \n",
       "\n",
       "   constitution  health           isIn  industry   wealth  factionLoyalty  \\\n",
       "0         0.226    0.70  8822366435138    0.3775  0.42525           0.317   \n",
       "1         0.421    0.70  4146242421204    0.3815  0.40175           0.522   \n",
       "2         0.475    0.70  8822366435138    0.5140  0.59800           0.484   \n",
       "3         0.651    0.42  8822366435138    0.6520  0.52100           0.016   \n",
       "4         0.619    0.42  4146242421204    0.5635  0.58975           0.402   \n",
       "\n",
       "   isIdle  \n",
       "0    True  \n",
       "1    True  \n",
       "2    True  \n",
       "3    True  \n",
       "4    True  "
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "children_df = pd.DataFrame([c.get_data() for c in children])\n",
    "children_df.head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'health': 0.42,\n",
       " 'isIdle': 'true',\n",
       " 'name': 'Serzeampro Bilnoru',\n",
       " 'objid': '9142883900818',\n",
       " 'conformity': 0.557,\n",
       " 'literacy': 0.544,\n",
       " 'aggression': 0.609,\n",
       " 'constitution': 0.557,\n",
       " 'isIn': '4873232607770',\n",
       " 'industry': 0.35,\n",
       " 'wealth': 0.39,\n",
       " 'factionLoyalty': 0.749,\n",
       " 'username': 'Billmanserver',\n",
       " 'objtype': 'pop',\n",
       " 'id': '9142883900818'}"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "p"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'name': 'Serzeampro Bilnoruter',\n",
       " 'objid': '9972441886224',\n",
       " 'label': 'pop',\n",
       " 'conformity': 0.44,\n",
       " 'literacy': 0.611,\n",
       " 'aggression': 0.453,\n",
       " 'constitution': 0.737,\n",
       " 'health': 0.42,\n",
       " 'isIn': '4873232607770',\n",
       " 'industry': 0.595,\n",
       " 'wealth': 0.603,\n",
       " 'factionLoyalty': 0.376,\n",
       " 'isIdle': True}"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "child.get_data()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>label</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2685489327234</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>isIn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>5796414489637</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>isIn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>0332270996058</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>isIn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>2441394569957</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>isIn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>5339949641790</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>isIn</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           node1          node2 label\n",
       "0  2685489327234  8822366435138  isIn\n",
       "1  5796414489637  8822366435138  isIn\n",
       "2  0332270996058  8822366435138  isIn\n",
       "3  2441394569957  8822366435138  isIn\n",
       "4  5339949641790  8822366435138  isIn"
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "factionedges = []\n",
    "[f.get_pop_edges(factionedges) for f in factions]\n",
    "pd.DataFrame(factionedges).head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>label</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2685489327234</td>\n",
       "      <td>7467985401518</td>\n",
       "      <td>childOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>3464399901345</td>\n",
       "      <td>0248671359952</td>\n",
       "      <td>childOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>5796414489637</td>\n",
       "      <td>7828874183454</td>\n",
       "      <td>childOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0332270996058</td>\n",
       "      <td>0126014006101</td>\n",
       "      <td>childOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0341442655485</td>\n",
       "      <td>4119534664272</td>\n",
       "      <td>childOf</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           node1          node2    label\n",
       "0  2685489327234  7467985401518  childOf\n",
       "1  3464399901345  0248671359952  childOf\n",
       "2  5796414489637  7828874183454  childOf\n",
       "3  0332270996058  0126014006101  childOf\n",
       "4  0341442655485  4119534664272  childOf"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "childofEdges = [c.childOf for c in children]\n",
    "pd.DataFrame(childofEdges).head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>label</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2685489327234</td>\n",
       "      <td>4291284873310</td>\n",
       "      <td>isOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>3464399901345</td>\n",
       "      <td>4291284873310</td>\n",
       "      <td>isOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>5796414489637</td>\n",
       "      <td>4291284873310</td>\n",
       "      <td>isOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0332270996058</td>\n",
       "      <td>4291284873310</td>\n",
       "      <td>isOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0341442655485</td>\n",
       "      <td>4291284873310</td>\n",
       "      <td>isOf</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           node1          node2 label\n",
       "0  2685489327234  4291284873310  isOf\n",
       "1  3464399901345  4291284873310  isOf\n",
       "2  5796414489637  4291284873310  isOf\n",
       "3  0332270996058  4291284873310  isOf\n",
       "4  0341442655485  4291284873310  isOf"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "isOfEdges = [c.isOfSpecies for c in children]\n",
    "pd.DataFrame(isOfEdges).head()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>label</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>2685489327234</td>\n",
       "      <td>2972908340606</td>\n",
       "      <td>inhabits</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>3464399901345</td>\n",
       "      <td>2972908340606</td>\n",
       "      <td>inhabits</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>5796414489637</td>\n",
       "      <td>2972908340606</td>\n",
       "      <td>inhabits</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0332270996058</td>\n",
       "      <td>2972908340606</td>\n",
       "      <td>inhabits</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0341442655485</td>\n",
       "      <td>2972908340606</td>\n",
       "      <td>inhabits</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "           node1          node2     label\n",
       "0  2685489327234  2972908340606  inhabits\n",
       "1  3464399901345  2972908340606  inhabits\n",
       "2  5796414489637  2972908340606  inhabits\n",
       "3  0332270996058  2972908340606  inhabits\n",
       "4  0341442655485  2972908340606  inhabits"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "inhabitsEdges = [c.inhabitsEdge for c in children]\n",
    "pd.DataFrame(inhabitsEdges).head()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## Validating The Counts of Edges and Nodes Created"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Expecting 45 children, got 45\n",
      "Expecting isOfEdges 45\n",
      "Expecting inhabitsEdges 45\n",
      "Expecting childofEdges 45\n",
      "Expecting factionedges 45\n",
      "Expecting events 45\n",
      "Expecting event edges 90 (both caused and happenedAt)\n"
     ]
    }
   ],
   "source": [
    "assert(len(reproducing_pops) == len(children))\n",
    "print(f\"Expecting {len(reproducing_pops)} children, got {len(children)}\")\n",
    "\n",
    "assert(len(reproducing_pops) == len(isOfEdges))\n",
    "print(f\"Expecting isOfEdges {len(isOfEdges)}\")\n",
    "\n",
    "assert(len(reproducing_pops) == len(inhabitsEdges))\n",
    "print(f\"Expecting inhabitsEdges {len(inhabitsEdges)}\")\n",
    "\n",
    "assert(len(reproducing_pops) == len(childofEdges))\n",
    "print(f\"Expecting childofEdges {len(childofEdges)}\")\n",
    "\n",
    "assert(len(reproducing_pops) == len(factionedges))\n",
    "print(f\"Expecting factionedges {len(factionedges)}\")\n",
    "\n",
    "assert(len(reproducing_pops) == len(events))\n",
    "print(f\"Expecting events {len(events)}\")\n",
    "\n",
    "\n",
    "assert(len(event_edges) == len(events)*2)\n",
    "print(f\"Expecting event edges {len(event_edges)} (both caused and happenedAt)\")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "c.patch_property(f['objid'], 'pop_locations', str(pop_locations))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'pop_locations': ['[[0, 0], [0, -2], [-2, 2], [-2, -2], [2, 2], [-1, 1], [0, 2], [-2, 0], [1, -1], [1, 3], [-1, 3]]'],\n",
       "  'name': ['Ciki'],\n",
       "  'objid': ['0015468195520'],\n",
       "  'lat': [-0.113],\n",
       "  'long': [0.0],\n",
       "  'username': ['Billmanserver'],\n",
       "  'objtype': ['faction']}]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "c.run_query(f\"\"\"\n",
    "g.V().has('objid','{f['objid']}').valueMap()\n",
    "\"\"\")    \n",
    "\n",
    "c.res"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'health': 0.7,\n",
       " 'isIdle': 'true',\n",
       " 'name': 'Ciki Fe',\n",
       " 'objid': '8876287369940',\n",
       " 'conformity': 0.456,\n",
       " 'literacy': 0.725,\n",
       " 'aggression': 0.428,\n",
       " 'constitution': 0.562,\n",
       " 'isIn': '0015468195520',\n",
       " 'industry': 0.495,\n",
       " 'wealth': 0.61,\n",
       " 'factionLoyalty': 0.529,\n",
       " 'username': 'Billmanserver',\n",
       " 'objtype': 'pop',\n",
       " 'id': '8876287369940'}"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "p"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'health': 0.42,\n",
       " 'isIdle': 'true',\n",
       " 'name': 'Ciki Fehas',\n",
       " 'objid': '7005589919552',\n",
       " 'conformity': 0.524,\n",
       " 'literacy': 0.79,\n",
       " 'aggression': 0.489,\n",
       " 'constitution': 0.548,\n",
       " 'isIn': '0015468195520',\n",
       " 'industry': 0.297,\n",
       " 'wealth': 0.418,\n",
       " 'factionLoyalty': 0.504,\n",
       " 'username': 'Billmanserver',\n",
       " 'objtype': 'pop',\n",
       " 'id': '7005589919552',\n",
       " 'label': 'pop'}"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "growth.grow_pop(p,species,params,syllables)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>health</th>\n",
       "      <th>isIdle</th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>conformity</th>\n",
       "      <th>literacy</th>\n",
       "      <th>aggression</th>\n",
       "      <th>constitution</th>\n",
       "      <th>isIn</th>\n",
       "      <th>industry</th>\n",
       "      <th>wealth</th>\n",
       "      <th>factionLoyalty</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "      <th>label</th>\n",
       "      <th>text</th>\n",
       "      <th>visibleTo</th>\n",
       "      <th>time</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Magorpro</td>\n",
       "      <td>0913584747812</td>\n",
       "      <td>0.520</td>\n",
       "      <td>0.304</td>\n",
       "      <td>0.595</td>\n",
       "      <td>0.260</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.291</td>\n",
       "      <td>0.328</td>\n",
       "      <td>0.471</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>0913584747812</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>7184852353123</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Obattla Magor) inhabiting Dorf...</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Peby</td>\n",
       "      <td>0630745128207</td>\n",
       "      <td>0.401</td>\n",
       "      <td>0.323</td>\n",
       "      <td>0.666</td>\n",
       "      <td>0.380</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.317</td>\n",
       "      <td>0.291</td>\n",
       "      <td>0.384</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>0630745128207</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>2196391002317</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Obattla Pe) inhabiting Dorf ha...</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Vangar</td>\n",
       "      <td>5675131856567</td>\n",
       "      <td>0.511</td>\n",
       "      <td>0.404</td>\n",
       "      <td>0.519</td>\n",
       "      <td>0.473</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.337</td>\n",
       "      <td>0.349</td>\n",
       "      <td>0.383</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>5675131856567</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>7356076059018</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Obattla Van) inhabiting Dorf h...</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Hassia Sinmu</td>\n",
       "      <td>3307181878378</td>\n",
       "      <td>0.553</td>\n",
       "      <td>0.175</td>\n",
       "      <td>0.605</td>\n",
       "      <td>0.633</td>\n",
       "      <td>4146242421204</td>\n",
       "      <td>0.382</td>\n",
       "      <td>0.201</td>\n",
       "      <td>0.620</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>3307181878378</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>2276175445082</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Hassia Sin) inhabiting Dorf ha...</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Arteswil</td>\n",
       "      <td>8738754631576</td>\n",
       "      <td>0.535</td>\n",
       "      <td>0.391</td>\n",
       "      <td>0.591</td>\n",
       "      <td>0.642</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.343</td>\n",
       "      <td>0.378</td>\n",
       "      <td>0.553</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>8738754631576</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>5497131605023</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Obattla Artes) inhabiting Dorf...</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Obattla Sersprings</td>\n",
       "      <td>3727965196255</td>\n",
       "      <td>0.274</td>\n",
       "      <td>0.438</td>\n",
       "      <td>0.628</td>\n",
       "      <td>0.522</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>0.347</td>\n",
       "      <td>0.208</td>\n",
       "      <td>0.455</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>3727965196255</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>0690887141373</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Obattla Ser) inhabiting Dorf h...</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Siacarratgor</td>\n",
       "      <td>2152499680520</td>\n",
       "      <td>0.609</td>\n",
       "      <td>0.610</td>\n",
       "      <td>0.436</td>\n",
       "      <td>0.547</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.257</td>\n",
       "      <td>0.384</td>\n",
       "      <td>0.709</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>2152499680520</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>4840616715473</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Ganjtil Siacarrat) inhabiting ...</td>\n",
       "      <td>manderson</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Wogi</td>\n",
       "      <td>6064514068524</td>\n",
       "      <td>0.512</td>\n",
       "      <td>0.613</td>\n",
       "      <td>0.305</td>\n",
       "      <td>0.324</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.229</td>\n",
       "      <td>0.264</td>\n",
       "      <td>0.473</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>6064514068524</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>4703077847671</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Ganjtil Wo) inhabiting Luraszi...</td>\n",
       "      <td>manderson</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Zopon Haydorfkerbergpen</td>\n",
       "      <td>3216423906414</td>\n",
       "      <td>0.300</td>\n",
       "      <td>0.335</td>\n",
       "      <td>0.581</td>\n",
       "      <td>0.308</td>\n",
       "      <td>9376731217333</td>\n",
       "      <td>0.269</td>\n",
       "      <td>0.335</td>\n",
       "      <td>0.579</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>3216423906414</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>0775878869326</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Zopon Haydorfkerberg) inhabiti...</td>\n",
       "      <td>manderson</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Aytuu</td>\n",
       "      <td>4814336118524</td>\n",
       "      <td>0.620</td>\n",
       "      <td>0.624</td>\n",
       "      <td>0.438</td>\n",
       "      <td>0.379</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.257</td>\n",
       "      <td>0.334</td>\n",
       "      <td>0.536</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>4814336118524</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>7345988827345</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Ganjtil Aytu) inhabiting Luras...</td>\n",
       "      <td>manderson</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ganjtil Quabanmarwarre</td>\n",
       "      <td>3175874154129</td>\n",
       "      <td>0.510</td>\n",
       "      <td>0.560</td>\n",
       "      <td>0.570</td>\n",
       "      <td>0.595</td>\n",
       "      <td>4115897493342</td>\n",
       "      <td>0.285</td>\n",
       "      <td>0.254</td>\n",
       "      <td>0.461</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>3175874154129</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>6378902062013</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Ganjtil Quabanmarwar) inhabiti...</td>\n",
       "      <td>manderson</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Zopon Lischarhapest</td>\n",
       "      <td>6827404859809</td>\n",
       "      <td>0.520</td>\n",
       "      <td>0.582</td>\n",
       "      <td>0.525</td>\n",
       "      <td>0.387</td>\n",
       "      <td>9376731217333</td>\n",
       "      <td>0.291</td>\n",
       "      <td>0.299</td>\n",
       "      <td>0.554</td>\n",
       "      <td>manderson</td>\n",
       "      <td>pop</td>\n",
       "      <td>6827404859809</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>8513510577003</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Zopon Lischarha) inhabiting Lu...</td>\n",
       "      <td>manderson</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Boupatciacerich</td>\n",
       "      <td>6986617453979</td>\n",
       "      <td>0.737</td>\n",
       "      <td>0.747</td>\n",
       "      <td>0.382</td>\n",
       "      <td>0.104</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.153</td>\n",
       "      <td>0.374</td>\n",
       "      <td>0.931</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>6986617453979</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>5260747328170</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Tilcasport Boupatciace) inhabi...</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Siatiapeckes</td>\n",
       "      <td>8646845240336</td>\n",
       "      <td>0.861</td>\n",
       "      <td>0.897</td>\n",
       "      <td>0.133</td>\n",
       "      <td>0.214</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.137</td>\n",
       "      <td>0.175</td>\n",
       "      <td>0.826</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>8646845240336</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>7782388659825</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Tilcasport Siatiapec) inhabiti...</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>0.45</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Niaarsin</td>\n",
       "      <td>1820268905401</td>\n",
       "      <td>0.503</td>\n",
       "      <td>0.780</td>\n",
       "      <td>0.286</td>\n",
       "      <td>0.314</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.150</td>\n",
       "      <td>0.232</td>\n",
       "      <td>0.485</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>1820268905401</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>3200486583332</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Tilcasport Niaar) inhabiting P...</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>30</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Tilcasport Enwilby</td>\n",
       "      <td>5408205765317</td>\n",
       "      <td>0.726</td>\n",
       "      <td>0.588</td>\n",
       "      <td>0.292</td>\n",
       "      <td>0.244</td>\n",
       "      <td>4232678858631</td>\n",
       "      <td>0.180</td>\n",
       "      <td>0.202</td>\n",
       "      <td>0.762</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>pop</td>\n",
       "      <td>5408205765317</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>31</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>4526569155793</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Tilcasport Enwil) inhabiting P...</td>\n",
       "      <td>william.jeffrey.harding@gmail.com</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>32</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Serzeampro Wilye</td>\n",
       "      <td>4271185084463</td>\n",
       "      <td>0.354</td>\n",
       "      <td>0.472</td>\n",
       "      <td>0.553</td>\n",
       "      <td>0.762</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.394</td>\n",
       "      <td>0.269</td>\n",
       "      <td>0.350</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>4271185084463</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>33</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>2919916850958</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Serzeampro Wil) inhabiting Tai...</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>34</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ciki Basmadia</td>\n",
       "      <td>4667958701560</td>\n",
       "      <td>0.511</td>\n",
       "      <td>0.449</td>\n",
       "      <td>0.451</td>\n",
       "      <td>0.500</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>0.260</td>\n",
       "      <td>0.381</td>\n",
       "      <td>0.649</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>4667958701560</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>4183534367737</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Ciki Basma) inhabiting Taipe h...</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Serzeampro Gradonnor</td>\n",
       "      <td>2901583468148</td>\n",
       "      <td>0.502</td>\n",
       "      <td>0.498</td>\n",
       "      <td>0.608</td>\n",
       "      <td>0.629</td>\n",
       "      <td>4873232607770</td>\n",
       "      <td>0.345</td>\n",
       "      <td>0.350</td>\n",
       "      <td>0.327</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>2901583468148</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>4606339513308</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Serzeampro Gradon) inhabiting ...</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>0.42</td>\n",
       "      <td>true</td>\n",
       "      <td>Ciki Fepe</td>\n",
       "      <td>6707630942353</td>\n",
       "      <td>0.407</td>\n",
       "      <td>0.665</td>\n",
       "      <td>0.519</td>\n",
       "      <td>0.565</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>0.297</td>\n",
       "      <td>0.430</td>\n",
       "      <td>0.473</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>pop</td>\n",
       "      <td>6707630942353</td>\n",
       "      <td>pop</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>population growth</td>\n",
       "      <td>6276059687128</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>NaN</td>\n",
       "      <td>NaN</td>\n",
       "      <td>event</td>\n",
       "      <td>The population (Ciki Fe) inhabiting Taipe has ...</td>\n",
       "      <td>Billmanserver</td>\n",
       "      <td>28311.0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    health isIdle                        name          objid  conformity  \\\n",
       "0     0.42   true            Obattla Magorpro  0913584747812       0.520   \n",
       "1      NaN    NaN           population growth  7184852353123         NaN   \n",
       "2     0.42   true                Obattla Peby  0630745128207       0.401   \n",
       "3      NaN    NaN           population growth  2196391002317         NaN   \n",
       "4     0.42   true              Obattla Vangar  5675131856567       0.511   \n",
       "5      NaN    NaN           population growth  7356076059018         NaN   \n",
       "6     0.42   true                Hassia Sinmu  3307181878378       0.553   \n",
       "7      NaN    NaN           population growth  2276175445082         NaN   \n",
       "8     0.42   true            Obattla Arteswil  8738754631576       0.535   \n",
       "9      NaN    NaN           population growth  5497131605023         NaN   \n",
       "10    0.42   true          Obattla Sersprings  3727965196255       0.274   \n",
       "11     NaN    NaN           population growth  0690887141373         NaN   \n",
       "12    0.42   true        Ganjtil Siacarratgor  2152499680520       0.609   \n",
       "13     NaN    NaN           population growth  4840616715473         NaN   \n",
       "14    0.42   true                Ganjtil Wogi  6064514068524       0.512   \n",
       "15     NaN    NaN           population growth  4703077847671         NaN   \n",
       "16    0.42   true     Zopon Haydorfkerbergpen  3216423906414       0.300   \n",
       "17     NaN    NaN           population growth  0775878869326         NaN   \n",
       "18    0.42   true               Ganjtil Aytuu  4814336118524       0.620   \n",
       "19     NaN    NaN           population growth  7345988827345         NaN   \n",
       "20    0.42   true      Ganjtil Quabanmarwarre  3175874154129       0.510   \n",
       "21     NaN    NaN           population growth  6378902062013         NaN   \n",
       "22    0.42   true         Zopon Lischarhapest  6827404859809       0.520   \n",
       "23     NaN    NaN           population growth  8513510577003         NaN   \n",
       "24    0.42   true  Tilcasport Boupatciacerich  6986617453979       0.737   \n",
       "25     NaN    NaN           population growth  5260747328170         NaN   \n",
       "26    0.42   true     Tilcasport Siatiapeckes  8646845240336       0.861   \n",
       "27     NaN    NaN           population growth  7782388659825         NaN   \n",
       "28    0.45   true         Tilcasport Niaarsin  1820268905401       0.503   \n",
       "29     NaN    NaN           population growth  3200486583332         NaN   \n",
       "30    0.42   true          Tilcasport Enwilby  5408205765317       0.726   \n",
       "31     NaN    NaN           population growth  4526569155793         NaN   \n",
       "32    0.42   true            Serzeampro Wilye  4271185084463       0.354   \n",
       "33     NaN    NaN           population growth  2919916850958         NaN   \n",
       "34    0.42   true               Ciki Basmadia  4667958701560       0.511   \n",
       "35     NaN    NaN           population growth  4183534367737         NaN   \n",
       "36    0.42   true        Serzeampro Gradonnor  2901583468148       0.502   \n",
       "37     NaN    NaN           population growth  4606339513308         NaN   \n",
       "38    0.42   true                   Ciki Fepe  6707630942353       0.407   \n",
       "39     NaN    NaN           population growth  6276059687128         NaN   \n",
       "\n",
       "    literacy  aggression  constitution           isIn  industry  wealth  \\\n",
       "0      0.304       0.595         0.260  8822366435138     0.291   0.328   \n",
       "1        NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "2      0.323       0.666         0.380  8822366435138     0.317   0.291   \n",
       "3        NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "4      0.404       0.519         0.473  8822366435138     0.337   0.349   \n",
       "5        NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "6      0.175       0.605         0.633  4146242421204     0.382   0.201   \n",
       "7        NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "8      0.391       0.591         0.642  8822366435138     0.343   0.378   \n",
       "9        NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "10     0.438       0.628         0.522  8822366435138     0.347   0.208   \n",
       "11       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "12     0.610       0.436         0.547  4115897493342     0.257   0.384   \n",
       "13       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "14     0.613       0.305         0.324  4115897493342     0.229   0.264   \n",
       "15       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "16     0.335       0.581         0.308  9376731217333     0.269   0.335   \n",
       "17       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "18     0.624       0.438         0.379  4115897493342     0.257   0.334   \n",
       "19       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "20     0.560       0.570         0.595  4115897493342     0.285   0.254   \n",
       "21       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "22     0.582       0.525         0.387  9376731217333     0.291   0.299   \n",
       "23       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "24     0.747       0.382         0.104  4232678858631     0.153   0.374   \n",
       "25       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "26     0.897       0.133         0.214  4232678858631     0.137   0.175   \n",
       "27       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "28     0.780       0.286         0.314  4232678858631     0.150   0.232   \n",
       "29       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "30     0.588       0.292         0.244  4232678858631     0.180   0.202   \n",
       "31       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "32     0.472       0.553         0.762  4873232607770     0.394   0.269   \n",
       "33       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "34     0.449       0.451         0.500  0015468195520     0.260   0.381   \n",
       "35       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "36     0.498       0.608         0.629  4873232607770     0.345   0.350   \n",
       "37       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "38     0.665       0.519         0.565  0015468195520     0.297   0.430   \n",
       "39       NaN         NaN           NaN            NaN       NaN     NaN   \n",
       "\n",
       "    factionLoyalty                           username objtype             id  \\\n",
       "0            0.471                      BillmanLocal2     pop  0913584747812   \n",
       "1              NaN                              event     NaN            NaN   \n",
       "2            0.384                      BillmanLocal2     pop  0630745128207   \n",
       "3              NaN                              event     NaN            NaN   \n",
       "4            0.383                      BillmanLocal2     pop  5675131856567   \n",
       "5              NaN                              event     NaN            NaN   \n",
       "6            0.620                      BillmanLocal2     pop  3307181878378   \n",
       "7              NaN                              event     NaN            NaN   \n",
       "8            0.553                      BillmanLocal2     pop  8738754631576   \n",
       "9              NaN                              event     NaN            NaN   \n",
       "10           0.455                      BillmanLocal2     pop  3727965196255   \n",
       "11             NaN                              event     NaN            NaN   \n",
       "12           0.709                          manderson     pop  2152499680520   \n",
       "13             NaN                              event     NaN            NaN   \n",
       "14           0.473                          manderson     pop  6064514068524   \n",
       "15             NaN                              event     NaN            NaN   \n",
       "16           0.579                          manderson     pop  3216423906414   \n",
       "17             NaN                              event     NaN            NaN   \n",
       "18           0.536                          manderson     pop  4814336118524   \n",
       "19             NaN                              event     NaN            NaN   \n",
       "20           0.461                          manderson     pop  3175874154129   \n",
       "21             NaN                              event     NaN            NaN   \n",
       "22           0.554                          manderson     pop  6827404859809   \n",
       "23             NaN                              event     NaN            NaN   \n",
       "24           0.931  william.jeffrey.harding@gmail.com     pop  6986617453979   \n",
       "25             NaN                              event     NaN            NaN   \n",
       "26           0.826  william.jeffrey.harding@gmail.com     pop  8646845240336   \n",
       "27             NaN                              event     NaN            NaN   \n",
       "28           0.485  william.jeffrey.harding@gmail.com     pop  1820268905401   \n",
       "29             NaN                              event     NaN            NaN   \n",
       "30           0.762  william.jeffrey.harding@gmail.com     pop  5408205765317   \n",
       "31             NaN                              event     NaN            NaN   \n",
       "32           0.350                      Billmanserver     pop  4271185084463   \n",
       "33             NaN                              event     NaN            NaN   \n",
       "34           0.649                      Billmanserver     pop  4667958701560   \n",
       "35             NaN                              event     NaN            NaN   \n",
       "36           0.327                      Billmanserver     pop  2901583468148   \n",
       "37             NaN                              event     NaN            NaN   \n",
       "38           0.473                      Billmanserver     pop  6707630942353   \n",
       "39             NaN                              event     NaN            NaN   \n",
       "\n",
       "    label                                               text  \\\n",
       "0     pop                                                NaN   \n",
       "1   event  The population (Obattla Magor) inhabiting Dorf...   \n",
       "2     pop                                                NaN   \n",
       "3   event  The population (Obattla Pe) inhabiting Dorf ha...   \n",
       "4     pop                                                NaN   \n",
       "5   event  The population (Obattla Van) inhabiting Dorf h...   \n",
       "6     pop                                                NaN   \n",
       "7   event  The population (Hassia Sin) inhabiting Dorf ha...   \n",
       "8     pop                                                NaN   \n",
       "9   event  The population (Obattla Artes) inhabiting Dorf...   \n",
       "10    pop                                                NaN   \n",
       "11  event  The population (Obattla Ser) inhabiting Dorf h...   \n",
       "12    pop                                                NaN   \n",
       "13  event  The population (Ganjtil Siacarrat) inhabiting ...   \n",
       "14    pop                                                NaN   \n",
       "15  event  The population (Ganjtil Wo) inhabiting Luraszi...   \n",
       "16    pop                                                NaN   \n",
       "17  event  The population (Zopon Haydorfkerberg) inhabiti...   \n",
       "18    pop                                                NaN   \n",
       "19  event  The population (Ganjtil Aytu) inhabiting Luras...   \n",
       "20    pop                                                NaN   \n",
       "21  event  The population (Ganjtil Quabanmarwar) inhabiti...   \n",
       "22    pop                                                NaN   \n",
       "23  event  The population (Zopon Lischarha) inhabiting Lu...   \n",
       "24    pop                                                NaN   \n",
       "25  event  The population (Tilcasport Boupatciace) inhabi...   \n",
       "26    pop                                                NaN   \n",
       "27  event  The population (Tilcasport Siatiapec) inhabiti...   \n",
       "28    pop                                                NaN   \n",
       "29  event  The population (Tilcasport Niaar) inhabiting P...   \n",
       "30    pop                                                NaN   \n",
       "31  event  The population (Tilcasport Enwil) inhabiting P...   \n",
       "32    pop                                                NaN   \n",
       "33  event  The population (Serzeampro Wil) inhabiting Tai...   \n",
       "34    pop                                                NaN   \n",
       "35  event  The population (Ciki Basma) inhabiting Taipe h...   \n",
       "36    pop                                                NaN   \n",
       "37  event  The population (Serzeampro Gradon) inhabiting ...   \n",
       "38    pop                                                NaN   \n",
       "39  event  The population (Ciki Fe) inhabiting Taipe has ...   \n",
       "\n",
       "                            visibleTo     time  \n",
       "0                                 NaN      NaN  \n",
       "1                       BillmanLocal2  28311.0  \n",
       "2                                 NaN      NaN  \n",
       "3                       BillmanLocal2  28311.0  \n",
       "4                                 NaN      NaN  \n",
       "5                       BillmanLocal2  28311.0  \n",
       "6                                 NaN      NaN  \n",
       "7                       BillmanLocal2  28311.0  \n",
       "8                                 NaN      NaN  \n",
       "9                       BillmanLocal2  28311.0  \n",
       "10                                NaN      NaN  \n",
       "11                      BillmanLocal2  28311.0  \n",
       "12                                NaN      NaN  \n",
       "13                          manderson  28311.0  \n",
       "14                                NaN      NaN  \n",
       "15                          manderson  28311.0  \n",
       "16                                NaN      NaN  \n",
       "17                          manderson  28311.0  \n",
       "18                                NaN      NaN  \n",
       "19                          manderson  28311.0  \n",
       "20                                NaN      NaN  \n",
       "21                          manderson  28311.0  \n",
       "22                                NaN      NaN  \n",
       "23                          manderson  28311.0  \n",
       "24                                NaN      NaN  \n",
       "25  william.jeffrey.harding@gmail.com  28311.0  \n",
       "26                                NaN      NaN  \n",
       "27  william.jeffrey.harding@gmail.com  28311.0  \n",
       "28                                NaN      NaN  \n",
       "29  william.jeffrey.harding@gmail.com  28311.0  \n",
       "30                                NaN      NaN  \n",
       "31  william.jeffrey.harding@gmail.com  28311.0  \n",
       "32                                NaN      NaN  \n",
       "33                      Billmanserver  28311.0  \n",
       "34                                NaN      NaN  \n",
       "35                      Billmanserver  28311.0  \n",
       "36                                NaN      NaN  \n",
       "37                      Billmanserver  28311.0  \n",
       "38                                NaN      NaN  \n",
       "39                      Billmanserver  28311.0  "
      ]
     },
     "execution_count": 23,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.DataFrame.from_records(nodes)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>node1</th>\n",
       "      <th>node2</th>\n",
       "      <th>label</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0913584747812</td>\n",
       "      <td>7467985401518</td>\n",
       "      <td>childOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0913584747812</td>\n",
       "      <td>8822366435138</td>\n",
       "      <td>isIn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>0913584747812</td>\n",
       "      <td>4291284873310</td>\n",
       "      <td>isOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0913584747812</td>\n",
       "      <td>2972908340606</td>\n",
       "      <td>inhabits</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0630745128207</td>\n",
       "      <td>5100638967625</td>\n",
       "      <td>childOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>75</th>\n",
       "      <td>2901583468148</td>\n",
       "      <td>8490894854096</td>\n",
       "      <td>inhabits</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>76</th>\n",
       "      <td>6707630942353</td>\n",
       "      <td>8876287369940</td>\n",
       "      <td>childOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>77</th>\n",
       "      <td>6707630942353</td>\n",
       "      <td>0015468195520</td>\n",
       "      <td>isIn</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>78</th>\n",
       "      <td>6707630942353</td>\n",
       "      <td>5478087080681</td>\n",
       "      <td>isOf</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>79</th>\n",
       "      <td>6707630942353</td>\n",
       "      <td>8490894854096</td>\n",
       "      <td>inhabits</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>80 rows × 3 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "            node1          node2     label\n",
       "0   0913584747812  7467985401518   childOf\n",
       "1   0913584747812  8822366435138      isIn\n",
       "2   0913584747812  4291284873310      isOf\n",
       "3   0913584747812  2972908340606  inhabits\n",
       "4   0630745128207  5100638967625   childOf\n",
       "..            ...            ...       ...\n",
       "75  2901583468148  8490894854096  inhabits\n",
       "76  6707630942353  8876287369940   childOf\n",
       "77  6707630942353  0015468195520      isIn\n",
       "78  6707630942353  5478087080681      isOf\n",
       "79  6707630942353  8490894854096  inhabits\n",
       "\n",
       "[80 rows x 3 columns]"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.DataFrame.from_records(edges)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[\"\\n        g.V().has('objid','7184852353123')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','7467985401518')\\n            .addE('caused')\\n            .to(g.V().has('objid','7184852353123'))\\n        \",\n",
       " \"\\n        g.V().has('objid','2196391002317')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','5100638967625')\\n            .addE('caused')\\n            .to(g.V().has('objid','2196391002317'))\\n        \",\n",
       " \"\\n        g.V().has('objid','7356076059018')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','1800951322768')\\n            .addE('caused')\\n            .to(g.V().has('objid','7356076059018'))\\n        \",\n",
       " \"\\n        g.V().has('objid','2276175445082')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','0248671359952')\\n            .addE('caused')\\n            .to(g.V().has('objid','2276175445082'))\\n        \",\n",
       " \"\\n        g.V().has('objid','5497131605023')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','9819392335838')\\n            .addE('caused')\\n            .to(g.V().has('objid','5497131605023'))\\n        \",\n",
       " \"\\n        g.V().has('objid','0690887141373')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2972908340606'))\\n        \",\n",
       " \"\\n        g.V().has('objid','7828874183454')\\n            .addE('caused')\\n            .to(g.V().has('objid','0690887141373'))\\n        \",\n",
       " \"\\n        g.V().has('objid','4840616715473')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','5640544774717'))\\n        \",\n",
       " \"\\n        g.V().has('objid','3446159101358')\\n            .addE('caused')\\n            .to(g.V().has('objid','4840616715473'))\\n        \",\n",
       " \"\\n        g.V().has('objid','4703077847671')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','5640544774717'))\\n        \",\n",
       " \"\\n        g.V().has('objid','9552341693154')\\n            .addE('caused')\\n            .to(g.V().has('objid','4703077847671'))\\n        \",\n",
       " \"\\n        g.V().has('objid','0775878869326')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','5640544774717'))\\n        \",\n",
       " \"\\n        g.V().has('objid','1417654942596')\\n            .addE('caused')\\n            .to(g.V().has('objid','0775878869326'))\\n        \",\n",
       " \"\\n        g.V().has('objid','7345988827345')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','5640544774717'))\\n        \",\n",
       " \"\\n        g.V().has('objid','4772723923474')\\n            .addE('caused')\\n            .to(g.V().has('objid','7345988827345'))\\n        \",\n",
       " \"\\n        g.V().has('objid','6378902062013')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','5640544774717'))\\n        \",\n",
       " \"\\n        g.V().has('objid','1786540026813')\\n            .addE('caused')\\n            .to(g.V().has('objid','6378902062013'))\\n        \",\n",
       " \"\\n        g.V().has('objid','8513510577003')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','5640544774717'))\\n        \",\n",
       " \"\\n        g.V().has('objid','2152501246930')\\n            .addE('caused')\\n            .to(g.V().has('objid','8513510577003'))\\n        \",\n",
       " \"\\n        g.V().has('objid','5260747328170')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2816844503430'))\\n        \",\n",
       " \"\\n        g.V().has('objid','4742850136180')\\n            .addE('caused')\\n            .to(g.V().has('objid','5260747328170'))\\n        \",\n",
       " \"\\n        g.V().has('objid','7782388659825')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2816844503430'))\\n        \",\n",
       " \"\\n        g.V().has('objid','5669843388137')\\n            .addE('caused')\\n            .to(g.V().has('objid','7782388659825'))\\n        \",\n",
       " \"\\n        g.V().has('objid','3200486583332')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2816844503430'))\\n        \",\n",
       " \"\\n        g.V().has('objid','7036253430140')\\n            .addE('caused')\\n            .to(g.V().has('objid','3200486583332'))\\n        \",\n",
       " \"\\n        g.V().has('objid','4526569155793')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','2816844503430'))\\n        \",\n",
       " \"\\n        g.V().has('objid','3440955961419')\\n            .addE('caused')\\n            .to(g.V().has('objid','4526569155793'))\\n        \",\n",
       " \"\\n        g.V().has('objid','2919916850958')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','8490894854096'))\\n        \",\n",
       " \"\\n        g.V().has('objid','1772981049949')\\n            .addE('caused')\\n            .to(g.V().has('objid','2919916850958'))\\n        \",\n",
       " \"\\n        g.V().has('objid','4183534367737')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','8490894854096'))\\n        \",\n",
       " \"\\n        g.V().has('objid','1247897538416')\\n            .addE('caused')\\n            .to(g.V().has('objid','4183534367737'))\\n        \",\n",
       " \"\\n        g.V().has('objid','4606339513308')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','8490894854096'))\\n        \",\n",
       " \"\\n        g.V().has('objid','8096543483724')\\n            .addE('caused')\\n            .to(g.V().has('objid','4606339513308'))\\n        \",\n",
       " \"\\n        g.V().has('objid','6276059687128')\\n            .addE('happenedAt')\\n            .to(g.V().has('objid','8490894854096'))\\n        \",\n",
       " \"\\n        g.V().has('objid','8876287369940')\\n            .addE('caused')\\n            .to(g.V().has('objid','6276059687128'))\\n        \"]"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "event_edges"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "growth.grow(c,params,syllables)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "c.upload_data()"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "exoplanets",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.16"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "625a17269cb94aebb094cbcf5e0e8340f26b69d46569da60e8fc69439048adbf"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
