{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Getting People Data\n",
    "For use with the clickhandler"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys\n",
    "import numpy as np\n",
    "import pandas as pd\n",
    "import altair as alt\n",
    "sys.path.append('..')\n",
    "import helpers.dbquery as db\n",
    "import helpers.functions as f\n",
    "import yaml, ssl, asyncio\n",
    "import nb_black\n",
    "\n",
    "ssl._create_default_https_context = ssl._create_unverified_context\n",
    "asyncio.set_event_loop_policy(asyncio.WindowsSelectorEventLoopPolicy())\n",
    "import nest_asyncio\n",
    "# this is required for running in a Jupyter Notebook. \n",
    "nest_asyncio.apply()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>name</th>\n",
       "      <th>objid</th>\n",
       "      <th>conformity</th>\n",
       "      <th>literacy</th>\n",
       "      <th>aggression</th>\n",
       "      <th>constitution</th>\n",
       "      <th>health</th>\n",
       "      <th>isInFaction</th>\n",
       "      <th>industry</th>\n",
       "      <th>wealth</th>\n",
       "      <th>factionLoyalty</th>\n",
       "      <th>isIdle</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Se Bemon</td>\n",
       "      <td>8692749194716</td>\n",
       "      <td>0.298</td>\n",
       "      <td>0.034</td>\n",
       "      <td>1.080</td>\n",
       "      <td>0.932</td>\n",
       "      <td>0.5</td>\n",
       "      <td>6103221482049</td>\n",
       "      <td>1.0060</td>\n",
       "      <td>0.5200</td>\n",
       "      <td>0.256</td>\n",
       "      <td>True</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>8692749194716</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Ralplahi Deni</td>\n",
       "      <td>3697596910545</td>\n",
       "      <td>0.266</td>\n",
       "      <td>0.245</td>\n",
       "      <td>0.766</td>\n",
       "      <td>0.852</td>\n",
       "      <td>0.5</td>\n",
       "      <td>9230448847637</td>\n",
       "      <td>0.8090</td>\n",
       "      <td>0.5270</td>\n",
       "      <td>0.336</td>\n",
       "      <td>True</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>3697596910545</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Hahuamarikay Hinram</td>\n",
       "      <td>9451256864767</td>\n",
       "      <td>0.388</td>\n",
       "      <td>0.204</td>\n",
       "      <td>0.616</td>\n",
       "      <td>0.878</td>\n",
       "      <td>0.5</td>\n",
       "      <td>0232294329079</td>\n",
       "      <td>0.7470</td>\n",
       "      <td>0.4755</td>\n",
       "      <td>0.290</td>\n",
       "      <td>True</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>9451256864767</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Ralplahi Kreis</td>\n",
       "      <td>8677609612767</td>\n",
       "      <td>0.199</td>\n",
       "      <td>0.366</td>\n",
       "      <td>0.726</td>\n",
       "      <td>0.822</td>\n",
       "      <td>0.5</td>\n",
       "      <td>9230448847637</td>\n",
       "      <td>0.7740</td>\n",
       "      <td>0.5700</td>\n",
       "      <td>0.126</td>\n",
       "      <td>True</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>8677609612767</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Bia Pi</td>\n",
       "      <td>6720568407752</td>\n",
       "      <td>0.111</td>\n",
       "      <td>0.222</td>\n",
       "      <td>0.503</td>\n",
       "      <td>0.594</td>\n",
       "      <td>0.5</td>\n",
       "      <td>9093605982634</td>\n",
       "      <td>0.5485</td>\n",
       "      <td>0.3852</td>\n",
       "      <td>0.210</td>\n",
       "      <td>True</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>6720568407752</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>Hahuamarikay Puwan</td>\n",
       "      <td>5957118078765</td>\n",
       "      <td>0.222</td>\n",
       "      <td>0.128</td>\n",
       "      <td>0.649</td>\n",
       "      <td>0.900</td>\n",
       "      <td>0.5</td>\n",
       "      <td>0232294329079</td>\n",
       "      <td>0.7745</td>\n",
       "      <td>0.4512</td>\n",
       "      <td>0.180</td>\n",
       "      <td>True</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>5957118078765</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                  name          objid  conformity  literacy  aggression  \\\n",
       "0             Se Bemon  8692749194716       0.298     0.034       1.080   \n",
       "1        Ralplahi Deni  3697596910545       0.266     0.245       0.766   \n",
       "2  Hahuamarikay Hinram  9451256864767       0.388     0.204       0.616   \n",
       "3       Ralplahi Kreis  8677609612767       0.199     0.366       0.726   \n",
       "4               Bia Pi  6720568407752       0.111     0.222       0.503   \n",
       "5   Hahuamarikay Puwan  5957118078765       0.222     0.128       0.649   \n",
       "\n",
       "   constitution  health    isInFaction  industry  wealth  factionLoyalty  \\\n",
       "0         0.932     0.5  6103221482049    1.0060  0.5200           0.256   \n",
       "1         0.852     0.5  9230448847637    0.8090  0.5270           0.336   \n",
       "2         0.878     0.5  0232294329079    0.7470  0.4755           0.290   \n",
       "3         0.822     0.5  9230448847637    0.7740  0.5700           0.126   \n",
       "4         0.594     0.5  9093605982634    0.5485  0.3852           0.210   \n",
       "5         0.900     0.5  0232294329079    0.7745  0.4512           0.180   \n",
       "\n",
       "  isIdle       username objtype             id  \n",
       "0   True  BillmanLocal2     pop  8692749194716  \n",
       "1   True  BillmanLocal2     pop  3697596910545  \n",
       "2   True  BillmanLocal2     pop  9451256864767  \n",
       "3   True  BillmanLocal2     pop  8677609612767  \n",
       "4   True  BillmanLocal2     pop  6720568407752  \n",
       "5   True  BillmanLocal2     pop  5957118078765  "
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = db.run_query(\"g.V().hasLabel('pop').has('username','BillmanLocal2').valueMap()\")\n",
    "pops = pd.DataFrame([db.clean_node(n) for n in res])\n",
    "pops"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "popID = '4253777177342'\n",
    "res = db.run_query(f\"g.V().hasLabel('pop').has('objid','{popID}').outE().inV().dedup().values('name','label','name')\")\n",
    "res"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {},
   "outputs": [],
   "source": [
    "query = \"\"\"\n",
    "g.V().has('objid','7615388501660').as('location')\n",
    "\t.in('inhabits').as('population')\n",
    "\t.local(\n",
    "\t\tunion(\n",
    "\t\t\tout('isInFaction').as('faction'),\n",
    "\t\t\tout('isOfSpecies').as('species')\n",
    "\t\t\t)\n",
    "\t\t\t.fold()).as('faction','species')\n",
    "\t\t\t.path()\n",
    "\t\t\t.by(unfold().valueMap().fold())\n",
    "            \"\"\"\n",
    "# query = \"\"\"\n",
    "# g.V().has('objid','7615388501660').as('location')\n",
    "# \t.in('inhabits').as('population')\n",
    "# \t.out('isInFaction').as('faction')\n",
    "\n",
    "# \t\t\t.path()\n",
    "# \t\t\t.by(unfold().valueMap().fold())\n",
    "#             \"\"\"\n",
    "\n",
    "res = db.run_query(query)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>labels</th>\n",
       "      <th>objects</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>[[location], [population], [faction, species]]</td>\n",
       "      <td>[[{'objid': ['7615388501660'], 'name': ['Plara...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>[[location], [population], [faction, species]]</td>\n",
       "      <td>[[{'objid': ['7615388501660'], 'name': ['Plara...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>[[location], [population], [faction, species]]</td>\n",
       "      <td>[[{'objid': ['7615388501660'], 'name': ['Plara...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>[[location], [population], [faction, species]]</td>\n",
       "      <td>[[{'objid': ['7615388501660'], 'name': ['Plara...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>[[location], [population], [faction, species]]</td>\n",
       "      <td>[[{'objid': ['7615388501660'], 'name': ['Plara...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>[[location], [population], [faction, species]]</td>\n",
       "      <td>[[{'objid': ['7615388501660'], 'name': ['Plara...</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "                                           labels  \\\n",
       "0  [[location], [population], [faction, species]]   \n",
       "1  [[location], [population], [faction, species]]   \n",
       "2  [[location], [population], [faction, species]]   \n",
       "3  [[location], [population], [faction, species]]   \n",
       "4  [[location], [population], [faction, species]]   \n",
       "5  [[location], [population], [faction, species]]   \n",
       "\n",
       "                                             objects  \n",
       "0  [[{'objid': ['7615388501660'], 'name': ['Plara...  \n",
       "1  [[{'objid': ['7615388501660'], 'name': ['Plara...  \n",
       "2  [[{'objid': ['7615388501660'], 'name': ['Plara...  \n",
       "3  [[{'objid': ['7615388501660'], 'name': ['Plara...  \n",
       "4  [[{'objid': ['7615388501660'], 'name': ['Plara...  \n",
       "5  [[{'objid': ['7615388501660'], 'name': ['Plara...  "
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "pd.DataFrame(res)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{0: {'location': {'objid': '7615388501660',\n",
       "   'name': 'Plara',\n",
       "   'class': 'terrestrial',\n",
       "   'radius': 0.6865,\n",
       "   'mass': 0.1512,\n",
       "   'orbitsDistance': 0,\n",
       "   'orbitsId': '3442412221426',\n",
       "   'orbitsName': '',\n",
       "   'isSupportsLife': 'True',\n",
       "   'isPopulated': 'True',\n",
       "   'type': 'terrestrial',\n",
       "   'isHomeworld': 'True',\n",
       "   'username': 'BillmanLocal2',\n",
       "   'objtype': 'planet',\n",
       "   'id': '7615388501660'},\n",
       "  'population': {'name': 'Se Bemon',\n",
       "   'objid': '8692749194716',\n",
       "   'conformity': 0.298,\n",
       "   'literacy': 0.034,\n",
       "   'aggression': 1.08,\n",
       "   'constitution': 0.932,\n",
       "   'health': 0.5,\n",
       "   'isInFaction': '6103221482049',\n",
       "   'industry': 1.006,\n",
       "   'wealth': 0.52,\n",
       "   'factionLoyalty': 0.256,\n",
       "   'isIdle': 'True',\n",
       "   'username': 'BillmanLocal2',\n",
       "   'objtype': 'pop',\n",
       "   'id': '8692749194716'},\n",
       "  'faction': {'name': 'Se',\n",
       "   'objid': '6103221482049',\n",
       "   'username': 'BillmanLocal2',\n",
       "   'objtype': 'faction',\n",
       "   'id': '6103221482049'},\n",
       "  'species': {'name': 'Wan',\n",
       "   'objid': '0199620302205',\n",
       "   'consumes': 'organic',\n",
       "   'effuses': 'organic waste',\n",
       "   'viral_resilience': 0.7,\n",
       "   'habitat_resilience': 0.2,\n",
       "   'username': 'BillmanLocal2',\n",
       "   'objtype': 'species',\n",
       "   'id': '0199620302205'}},\n",
       " 1: {'location': {'objid': '7615388501660',\n",
       "   'name': 'Plara',\n",
       "   'class': 'terrestrial',\n",
       "   'radius': 0.6865,\n",
       "   'mass': 0.1512,\n",
       "   'orbitsDistance': 0,\n",
       "   'orbitsId': '3442412221426',\n",
       "   'orbitsName': '',\n",
       "   'isSupportsLife': 'True',\n",
       "   'isPopulated': 'True',\n",
       "   'type': 'terrestrial',\n",
       "   'isHomeworld': 'True',\n",
       "   'username': 'BillmanLocal2',\n",
       "   'objtype': 'planet',\n",
       "   'id': '7615388501660'},\n",
       "  'population': {'name': 'Ralplahi Deni',\n",
       "   'objid': '3697596910545',\n",
       "   'conformity': 0.266,\n",
       "   'literacy': 0.245,\n",
       "   'aggression': 0.766,\n",
       "   'constitution': 0.852,\n",
       "   'health': 0.5,\n",
       "   'isInFaction': '9230448847637',\n",
       "   'industry': 0.809,\n",
       "   'wealth': 0.527,\n",
       "   'factionLoyalty': 0.336,\n",
       "   'isIdle': 'True',\n",
       "   'username': 'BillmanLocal2',\n",
       "   'objtype': 'pop',\n",
       "   'id': '3697596910545'},\n",
       "  'faction': {'name': 'Ralplahi',\n",
       "   'objid': '9230448847637',\n",
       "   'username': 'BillmanLocal2',\n",
       "   'objtype': 'faction',\n",
       "   'id': '9230448847637'},\n",
       "  'species': {'name': 'Wan',\n",
       "   'objid': '0199620302205',\n",
       "   'consumes': 'organic',\n",
       "   'effuses': 'organic waste',\n",
       "   'viral_resilience': 0.7,\n",
       "   'habitat_resilience': 0.2,\n",
       "   'username': 'BillmanLocal2',\n",
       "   'objtype': 'species',\n",
       "   'id': '0199620302205'}},\n",
       " 2: {'location': {'objid': '7615388501660',\n",
       "   'name': 'Plara',\n",
       "   'class': 'terrestrial',\n",
       "   'radius': 0.6865,\n",
       "   'mass': 0.1512,\n",
       "   'orbitsDistance': 0,\n",
       "   'orbitsId': '3442412221426',\n",
       "   'orbitsName': '',\n",
       "   'isSupportsLife': 'True',\n",
       "   'isPopulated': 'True',\n",
       "   'type': 'terrestrial',\n",
       "   'isHomeworld': 'True',\n",
       "   'username': 'BillmanLocal2',\n",
       "   'objtype': 'planet',\n",
       "   'id': '7615388501660'},\n",
       "  'population': {'name': 'Hahuamarikay Hinram',\n",
       "   'objid': '9451256864767',\n",
       "   'conformity': 0.388,\n",
       "   'literacy': 0.204,\n",
       "   'aggression': 0.616,\n",
       "   'constitution': 0.878,\n",
       "   'health': 0.5,\n",
       "   'isInFaction': '0232294329079',\n",
       "   'industry': 0.747,\n",
       "   'wealth': 0.4755,\n",
       "   'factionLoyalty': 0.29,\n",
       "   'isIdle': 'True',\n",
       "   'username': 'BillmanLocal2',\n",
       "   'objtype': 'pop',\n",
       "   'id': '9451256864767'},\n",
       "  'faction': {'name': 'Hahuamarikay',\n",
       "   'objid': '0232294329079',\n",
       "   'username': 'BillmanLocal2',\n",
       "   'objtype': 'faction',\n",
       "   'id': '0232294329079'},\n",
       "  'species': {'name': 'Wan',\n",
       "   'objid': '0199620302205',\n",
       "   'consumes': 'organic',\n",
       "   'effuses': 'organic waste',\n",
       "   'viral_resilience': 0.7,\n",
       "   'habitat_resilience': 0.2,\n",
       "   'username': 'BillmanLocal2',\n",
       "   'objtype': 'species',\n",
       "   'id': '0199620302205'}},\n",
       " 3: {'location': {'objid': '7615388501660',\n",
       "   'name': 'Plara',\n",
       "   'class': 'terrestrial',\n",
       "   'radius': 0.6865,\n",
       "   'mass': 0.1512,\n",
       "   'orbitsDistance': 0,\n",
       "   'orbitsId': '3442412221426',\n",
       "   'orbitsName': '',\n",
       "   'isSupportsLife': 'True',\n",
       "   'isPopulated': 'True',\n",
       "   'type': 'terrestrial',\n",
       "   'isHomeworld': 'True',\n",
       "   'username': 'BillmanLocal2',\n",
       "   'objtype': 'planet',\n",
       "   'id': '7615388501660'},\n",
       "  'population': {'name': 'Ralplahi Kreis',\n",
       "   'objid': '8677609612767',\n",
       "   'conformity': 0.199,\n",
       "   'literacy': 0.366,\n",
       "   'aggression': 0.726,\n",
       "   'constitution': 0.822,\n",
       "   'health': 0.5,\n",
       "   'isInFaction': '9230448847637',\n",
       "   'industry': 0.774,\n",
       "   'wealth': 0.57,\n",
       "   'factionLoyalty': 0.126,\n",
       "   'isIdle': 'True',\n",
       "   'username': 'BillmanLocal2',\n",
       "   'objtype': 'pop',\n",
       "   'id': '8677609612767'},\n",
       "  'faction': {'name': 'Ralplahi',\n",
       "   'objid': '9230448847637',\n",
       "   'username': 'BillmanLocal2',\n",
       "   'objtype': 'faction',\n",
       "   'id': '9230448847637'},\n",
       "  'species': {'name': 'Wan',\n",
       "   'objid': '0199620302205',\n",
       "   'consumes': 'organic',\n",
       "   'effuses': 'organic waste',\n",
       "   'viral_resilience': 0.7,\n",
       "   'habitat_resilience': 0.2,\n",
       "   'username': 'BillmanLocal2',\n",
       "   'objtype': 'species',\n",
       "   'id': '0199620302205'}},\n",
       " 4: {'location': {'objid': '7615388501660',\n",
       "   'name': 'Plara',\n",
       "   'class': 'terrestrial',\n",
       "   'radius': 0.6865,\n",
       "   'mass': 0.1512,\n",
       "   'orbitsDistance': 0,\n",
       "   'orbitsId': '3442412221426',\n",
       "   'orbitsName': '',\n",
       "   'isSupportsLife': 'True',\n",
       "   'isPopulated': 'True',\n",
       "   'type': 'terrestrial',\n",
       "   'isHomeworld': 'True',\n",
       "   'username': 'BillmanLocal2',\n",
       "   'objtype': 'planet',\n",
       "   'id': '7615388501660'},\n",
       "  'population': {'name': 'Bia Pi',\n",
       "   'objid': '6720568407752',\n",
       "   'conformity': 0.111,\n",
       "   'literacy': 0.222,\n",
       "   'aggression': 0.503,\n",
       "   'constitution': 0.594,\n",
       "   'health': 0.5,\n",
       "   'isInFaction': '9093605982634',\n",
       "   'industry': 0.5485,\n",
       "   'wealth': 0.3852,\n",
       "   'factionLoyalty': 0.21,\n",
       "   'isIdle': 'True',\n",
       "   'username': 'BillmanLocal2',\n",
       "   'objtype': 'pop',\n",
       "   'id': '6720568407752'},\n",
       "  'faction': {'name': 'Bia',\n",
       "   'objid': '9093605982634',\n",
       "   'username': 'BillmanLocal2',\n",
       "   'objtype': 'faction',\n",
       "   'id': '9093605982634'},\n",
       "  'species': {'name': 'Wan',\n",
       "   'objid': '0199620302205',\n",
       "   'consumes': 'organic',\n",
       "   'effuses': 'organic waste',\n",
       "   'viral_resilience': 0.7,\n",
       "   'habitat_resilience': 0.2,\n",
       "   'username': 'BillmanLocal2',\n",
       "   'objtype': 'species',\n",
       "   'id': '0199620302205'}},\n",
       " 5: {'location': {'objid': '7615388501660',\n",
       "   'name': 'Plara',\n",
       "   'class': 'terrestrial',\n",
       "   'radius': 0.6865,\n",
       "   'mass': 0.1512,\n",
       "   'orbitsDistance': 0,\n",
       "   'orbitsId': '3442412221426',\n",
       "   'orbitsName': '',\n",
       "   'isSupportsLife': 'True',\n",
       "   'isPopulated': 'True',\n",
       "   'type': 'terrestrial',\n",
       "   'isHomeworld': 'True',\n",
       "   'username': 'BillmanLocal2',\n",
       "   'objtype': 'planet',\n",
       "   'id': '7615388501660'},\n",
       "  'population': {'name': 'Hahuamarikay Puwan',\n",
       "   'objid': '5957118078765',\n",
       "   'conformity': 0.222,\n",
       "   'literacy': 0.128,\n",
       "   'aggression': 0.649,\n",
       "   'constitution': 0.9,\n",
       "   'health': 0.5,\n",
       "   'isInFaction': '0232294329079',\n",
       "   'industry': 0.7745,\n",
       "   'wealth': 0.4512,\n",
       "   'factionLoyalty': 0.18,\n",
       "   'isIdle': 'True',\n",
       "   'username': 'BillmanLocal2',\n",
       "   'objtype': 'pop',\n",
       "   'id': '5957118078765'},\n",
       "  'faction': {'name': 'Hahuamarikay',\n",
       "   'objid': '0232294329079',\n",
       "   'username': 'BillmanLocal2',\n",
       "   'objtype': 'faction',\n",
       "   'id': '0232294329079'},\n",
       "  'species': {'name': 'Wan',\n",
       "   'objid': '0199620302205',\n",
       "   'consumes': 'organic',\n",
       "   'effuses': 'organic waste',\n",
       "   'viral_resilience': 0.7,\n",
       "   'habitat_resilience': 0.2,\n",
       "   'username': 'BillmanLocal2',\n",
       "   'objtype': 'species',\n",
       "   'id': '0199620302205'}}}"
      ]
     },
     "execution_count": 42,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "\n",
    "from functools import reduce\n",
    "import operator\n",
    "\n",
    "def clean_node(x):\n",
    "    for k in list(x.keys()):\n",
    "        if len(x[k]) == 1:\n",
    "            x[k] = x[k][0]\n",
    "    if 'objid' in x.keys():\n",
    "        x[\"id\"] = x[\"objid\"]\n",
    "    return x\n",
    "\n",
    "fab = {}\n",
    "for n,r in enumerate(res): \n",
    "    fab[n] = {}\n",
    "    labels = reduce(operator.concat, r['labels'])\n",
    "    objects = reduce(operator.concat, r['objects'])\n",
    "    for i,l in enumerate(labels):\n",
    "        fab[n][l]=clean_node(objects[i])\n",
    "\n",
    "fab\n",
    "        \n",
    "\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.7.0 ('exoplanets')",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.0"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "625a17269cb94aebb094cbcf5e0e8340f26b69d46569da60e8fc69439048adbf"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
