{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "# Getting People Data\n",
    "For use with the clickhandler"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "import sys\n",
    "import numpy as np\n",
    "import pandas as pd\n",
    "import altair as alt\n",
    "sys.path.append('..')\n",
    "import helpers.dbquery as db\n",
    "import helpers.functions as f\n",
    "import yaml, ssl, asyncio\n",
    "import nb_black\n",
    "\n",
    "ssl._create_default_https_context = ssl._create_unverified_context\n",
    "asyncio.set_event_loop_policy(asyncio.WindowsSelectorEventLoopPolicy())\n",
    "import nest_asyncio\n",
    "# this is required for running in a Jupyter Notebook. \n",
    "nest_asyncio.apply()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>conformity</th>\n",
       "      <th>literacy</th>\n",
       "      <th>aggression</th>\n",
       "      <th>constitution</th>\n",
       "      <th>objid</th>\n",
       "      <th>faction_no</th>\n",
       "      <th>name</th>\n",
       "      <th>isInFaction</th>\n",
       "      <th>industry</th>\n",
       "      <th>wealth</th>\n",
       "      <th>faction_loyalty</th>\n",
       "      <th>username</th>\n",
       "      <th>objtype</th>\n",
       "      <th>id</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0.199</td>\n",
       "      <td>0.722</td>\n",
       "      <td>0.508</td>\n",
       "      <td>0.481</td>\n",
       "      <td>4253777177342</td>\n",
       "      <td>0</td>\n",
       "      <td>Roysa Ta</td>\n",
       "      <td>3323278109620</td>\n",
       "      <td>0.4945</td>\n",
       "      <td>0.6082</td>\n",
       "      <td>0.5225</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>4253777177342</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>0.221</td>\n",
       "      <td>0.562</td>\n",
       "      <td>0.567</td>\n",
       "      <td>0.854</td>\n",
       "      <td>8383433262758</td>\n",
       "      <td>1</td>\n",
       "      <td>Renna Ditan</td>\n",
       "      <td>3229062775596</td>\n",
       "      <td>0.7105</td>\n",
       "      <td>0.6362</td>\n",
       "      <td>0.4490</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>8383433262758</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>0.261</td>\n",
       "      <td>0.840</td>\n",
       "      <td>0.414</td>\n",
       "      <td>0.341</td>\n",
       "      <td>6441186987909</td>\n",
       "      <td>2</td>\n",
       "      <td>Santvo Ta</td>\n",
       "      <td>8124662340858</td>\n",
       "      <td>0.3775</td>\n",
       "      <td>0.6088</td>\n",
       "      <td>0.5360</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>6441186987909</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>0.567</td>\n",
       "      <td>0.601</td>\n",
       "      <td>0.522</td>\n",
       "      <td>0.468</td>\n",
       "      <td>9718805094107</td>\n",
       "      <td>1</td>\n",
       "      <td>Renna U</td>\n",
       "      <td>3229062775596</td>\n",
       "      <td>0.4950</td>\n",
       "      <td>0.5480</td>\n",
       "      <td>0.4605</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>9718805094107</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>0.149</td>\n",
       "      <td>0.690</td>\n",
       "      <td>0.658</td>\n",
       "      <td>0.534</td>\n",
       "      <td>4663925026608</td>\n",
       "      <td>0</td>\n",
       "      <td>Roysa Ku</td>\n",
       "      <td>3323278109620</td>\n",
       "      <td>0.5960</td>\n",
       "      <td>0.6430</td>\n",
       "      <td>0.4923</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>4663925026608</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>0.345</td>\n",
       "      <td>0.768</td>\n",
       "      <td>0.386</td>\n",
       "      <td>0.501</td>\n",
       "      <td>3711302149204</td>\n",
       "      <td>0</td>\n",
       "      <td>Roysa Lamal</td>\n",
       "      <td>3323278109620</td>\n",
       "      <td>0.4435</td>\n",
       "      <td>0.6058</td>\n",
       "      <td>0.5000</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>3711302149204</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>0.192</td>\n",
       "      <td>0.884</td>\n",
       "      <td>0.468</td>\n",
       "      <td>0.665</td>\n",
       "      <td>5132690006532</td>\n",
       "      <td>0</td>\n",
       "      <td>Roysa Beam</td>\n",
       "      <td>3323278109620</td>\n",
       "      <td>0.5665</td>\n",
       "      <td>0.7252</td>\n",
       "      <td>0.4478</td>\n",
       "      <td>BillmanLocal2</td>\n",
       "      <td>pop</td>\n",
       "      <td>5132690006532</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "   conformity  literacy  aggression  constitution          objid  faction_no  \\\n",
       "0       0.199     0.722       0.508         0.481  4253777177342           0   \n",
       "1       0.221     0.562       0.567         0.854  8383433262758           1   \n",
       "2       0.261     0.840       0.414         0.341  6441186987909           2   \n",
       "3       0.567     0.601       0.522         0.468  9718805094107           1   \n",
       "4       0.149     0.690       0.658         0.534  4663925026608           0   \n",
       "5       0.345     0.768       0.386         0.501  3711302149204           0   \n",
       "6       0.192     0.884       0.468         0.665  5132690006532           0   \n",
       "\n",
       "          name    isInFaction  industry  wealth  faction_loyalty  \\\n",
       "0     Roysa Ta  3323278109620    0.4945  0.6082           0.5225   \n",
       "1  Renna Ditan  3229062775596    0.7105  0.6362           0.4490   \n",
       "2    Santvo Ta  8124662340858    0.3775  0.6088           0.5360   \n",
       "3      Renna U  3229062775596    0.4950  0.5480           0.4605   \n",
       "4     Roysa Ku  3323278109620    0.5960  0.6430           0.4923   \n",
       "5  Roysa Lamal  3323278109620    0.4435  0.6058           0.5000   \n",
       "6   Roysa Beam  3323278109620    0.5665  0.7252           0.4478   \n",
       "\n",
       "        username objtype             id  \n",
       "0  BillmanLocal2     pop  4253777177342  \n",
       "1  BillmanLocal2     pop  8383433262758  \n",
       "2  BillmanLocal2     pop  6441186987909  \n",
       "3  BillmanLocal2     pop  9718805094107  \n",
       "4  BillmanLocal2     pop  4663925026608  \n",
       "5  BillmanLocal2     pop  3711302149204  \n",
       "6  BillmanLocal2     pop  5132690006532  "
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "res = db.run_query(\"g.V().hasLabel('pop').has('username','BillmanLocal2').valueMap()\")\n",
    "pops = pd.DataFrame([db.clean_node(n) for n in res])\n",
    "pops"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Roysa',\n",
       " 'faction',\n",
       " 'Roysa',\n",
       " 'Kinhen',\n",
       " 'species',\n",
       " 'Kinhen',\n",
       " 'Earth',\n",
       " 'planet',\n",
       " 'Earth',\n",
       " 'objective',\n",
       " 'objective',\n",
       " 'objective',\n",
       " 'objective',\n",
       " 'objective']"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "popID = '4253777177342'\n",
    "res = db.run_query(f\"g.V().hasLabel('pop').has('objid','{popID}').outE().inV().dedup().values('name','label','name')\")\n",
    "res"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3.7.0 ('exoplanets')",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.7.0"
  },
  "orig_nbformat": 4,
  "vscode": {
   "interpreter": {
    "hash": "625a17269cb94aebb094cbcf5e0e8340f26b69d46569da60e8fc69439048adbf"
   }
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
